[
  {
    "title": "AOC: Imagine if it was ISIS that sent bombs to US officials, started shooting in grocery stores, and invading places of worship. How do you think this administration would respond? & why is the response so different when those same terrorist acts are committed by white supremacists?",
    "label": 0
  },
  {
    "title": "House Votes, 420-to-0, to Demand Public Release of Mueller Report",
    "label": 0
  },
  {
    "title": "Take a Look at Delusional Fear-Mongering",
    "label": 1
  },
  {
    "title": "Colleges Create AI to Identify 'Hate Speech' – Turns Out Minorities Are the Worst Offenders",
    "label": 1
  },
  {
    "title": "GOP Sens. Murkowski and Collins called out for hypocrisy on Al Franken -- while they still consider Brett Kavanaugh",
    "label": 0
  },
  {
    "title": "The Mayors of the Worst Cities in America are Running for President",
    "label": 1
  },
  {
    "title": "Ted Cruz self-quarantines after interaction with CPAC attendee who has coronavirus",
    "label": 1
  },
  {
    "title": "Hillary Clinton: But my emails.",
    "label": 0
  },
  {
    "title": "Gov. Bevin (R) concedes election following recanvass",
    "label": 0
  },
  {
    "title": "Really not sure",
    "label": 1
  },
  {
    "title": "My ex-Democrat hardcore Trump fan dad might be snapping out of it",
    "label": 0
  },
  {
    "title": "North Carolina elections board votes for new election in congressional race",
    "label": 0
  },
  {
    "title": "Trump supporters are furious about the giant 'angry baby' balloon: Protest called 'cringeworthy' and 'juvenile', while counter-campaign to fly a similar Sadiq Khan blimp has now reached its funding target",
    "label": 0
  },
  {
    "title": "Pretty much sums up my college experience thus far.",
    "label": 1
  },
  {
    "title": "Virginia gun store says firearms, ammunition, and magazines flying off the shelves. Upswing on buying by cash",
    "label": 1
  },
  {
    "title": "Pipe Bomb And Powder Delivered to CNN Was Harmless. And it had a sticker on it that said (I shit you not) Git er dun.",
    "label": 1
  },
  {
    "title": "20,000 people marched in Austin today.",
    "label": 0
  },
  {
    "title": "New Jersey Governor Signs Bills Restoring Voting Rights To More Than 80,000 People",
    "label": 0
  },
  {
    "title": "Politicized Fake News Media Ignores Obama Pandemic That Killed 12,469 Americans, Attacks President Trump’s Incredible Effort to Curb Coronavirus",
    "label": 1
  },
  {
    "title": "Presented with only this comment...",
    "label": 1
  },
  {
    "title": "Facebook deletes the largest Donald Trump fan page with over 3 million followers",
    "label": 1
  },
  {
    "title": "Trump said he would take on the drug companies. He lied. Trump said he would provide health insurance to everyone. He lied. Trump said he wouldn't try to cut Social Security like Paul Ryan. He lied. Enough of Trump's lies. Let's end Republican control of Congress on Nov. 6.",
    "label": 0
  },
  {
    "title": "Trump orders feds to declassify key FISA documents, text messages in FBI Russia probe | Statement from the Press Secretary",
    "label": 1
  },
  {
    "title": "Scott Dworkin: 'Trump didn’t even respond to Putin’s threat against the US yesterday. He didn’t condemn the terrorist who was planning an attack on Democrats. He did take the time to attack Democrats, the press, FBI and DoJ. Trump will be the greatest threat to America, until he leaves the WH.'",
    "label": 0
  },
  {
    "title": "Trump has placed himself above the law. His latest eruption confirms it. -- What do we do when the president of the United States is unwilling to acknowledge any rules-bound limits of any sort on his conduct — while openly declaring that no mechanism of accountability of any kind is legitimate?",
    "label": 0
  },
  {
    "title": "If Democrats nominate Bernie Sanders, they hand the election to Trump",
    "label": 1
  },
  {
    "title": "Trump's New Hampshire vote total more than doubles Obama's in the 2012 primary",
    "label": 1
  },
  {
    "title": "Obama’s Spying On The Press Was Far More Extensive Than Previously Thought",
    "label": 1
  },
  {
    "title": "Bill Kristol: '“We warn against any attempt to link Khashoggi’s crime to our leadership.” Who’s attempted such a link? The Post. Who owns the Post? Bezos. Who had the ability to hack Bezos and a connection to AMI? The Saudis. Who’s conspired with both the Saudis and AMI and hates Bezos? Trump.'",
    "label": 0
  },
  {
    "title": "Liberals didn’t complain about these",
    "label": 1
  },
  {
    "title": "Trump-loving Ohio autoworkers feel betrayed after GM plant closes: ‘We’ve seen nothing but job losses’",
    "label": 0
  },
  {
    "title": "Not a surprise: Behind the Cambridge Analytica Scandal, another Russian",
    "label": 0
  },
  {
    "title": "Smollett is privileged, not innocent",
    "label": 1
  },
  {
    "title": "'I left parts of my body behind fighting terrorists in Iraq': Sen. Tammy Duckworth responds to GOP congressman's claim that Democrats are 'in love with terrorists'",
    "label": 0
  },
  {
    "title": "Pelosi warns Trump about making 'threats' against Congress",
    "label": 0
  },
  {
    "title": "Trump is committing 'felony bribery' by giving fundraising cash to GOP senators ahead of impeachment trial, former Bush ethics lawyer warns",
    "label": 0
  },
  {
    "title": "Trump Approval Rating Nears 50 Percent Heading Into 2020",
    "label": 1
  },
  {
    "title": "Trump tests NEGATIVE for coronavirus",
    "label": 1
  },
  {
    "title": "The Real Conflict Is Not Racial Or Sexual, It’s Between The Ascendant Rich Elites And The Rest Of Us",
    "label": 1
  },
  {
    "title": "Steve Schmidt on Twitter: 'Some enterprising journalist should start a list naming every person and every firm that is on the Saudi payroll in Washington. The Saudi Lobby is a poster child for the corruption that runs rampant in Washington DC. It’s all in the open. We just don’t talk about it'",
    "label": 0
  },
  {
    "title": "Memo to Beto: Don’t Forget To Ban Cars, Knives, Stairs And Bathtubs",
    "label": 1
  },
  {
    "title": "10,500 Steaks at Dem Steak Fry Despite Meat Consumption Concerns",
    "label": 1
  },
  {
    "title": "BERNIE CAMP EXPOSED: Field Organizer Says ‘F***ing Cities Will Burn’ if Trump Wins, Calls for Murder of Enemies",
    "label": 1
  },
  {
    "title": "/r/republican hit 100k subscribers yesterday",
    "label": 1
  },
  {
    "title": "Man who fueled Trump's voter fraud conspiracy is registered in 3 states",
    "label": 0
  },
  {
    "title": "Senator Jeff Merkley on Twitter: .@realDonaldTrump hasn’t spent 94% of the border security money over the last two years. 94%! This isn’t about border security, it’s about politics.",
    "label": 0
  },
  {
    "title": "Trump Says If You Don't Love America, Leave It. He's Been Bashing the U.S. For Years.",
    "label": 0
  },
  {
    "title": "Flake calls Trump's comments on Ford 'appalling'",
    "label": 0
  },
  {
    "title": "Ohhhhh no the horror, how are going to survive without and endless stream of communist opinion pieces 😂😂",
    "label": 1
  },
  {
    "title": "The guy is a walking sugar cookie.",
    "label": 0
  },
  {
    "title": "FACT CHECK: Trump Asked a Reporter If She Was Working For China... She Is.",
    "label": 1
  },
  {
    "title": "Alexandria Ocasio-Cortez Says Unemployment Is Low 'Because Everyone Has Two Jobs,' Which Is Not How Unemployment Rates Work",
    "label": 1
  },
  {
    "title": "I‘m a German, who supports Trump.",
    "label": 1
  },
  {
    "title": "MS-13 gang member nicknamed ‘Animal’ sentenced to 40 years",
    "label": 1
  },
  {
    "title": "Being a Trump supporter is no longer allowed, it seems",
    "label": 1
  },
  {
    "title": "President Trump Demands California Return $3.5 Billion to US Govt. for Bullet Train They Just Cancelled",
    "label": 1
  },
  {
    "title": "In a nutshell",
    "label": 1
  },
  {
    "title": "The new NRA logo. Designed for us to fight back.",
    "label": 0
  },
  {
    "title": "What a REAL President Looks Like.",
    "label": 0
  },
  {
    "title": "Ilhan Omar Is Under Investigation For Misusing Campaign Contributions",
    "label": 1
  },
  {
    "title": "Poll: Voters in Georgia view Pelosi more favorably than Trump",
    "label": 0
  },
  {
    "title": "Hillary Clinton: The abortion bans in Alabama, Georgia, Ohio, Kentucky, and Mississippi are appalling attacks on women's lives and fundamental freedoms. Women's rights are human rights. We will not go back.",
    "label": 0
  },
  {
    "title": "Asha Rangappa on Twitter: 'Just a reminder in all the noise that House GOP hasn't released a transcript of FBI Agent Peter Strzok's testimony, despite his attorney's repeated calls to do so. For people who have been so vocal about 'transparency,' they certainly like keeping a lot of secrets.'",
    "label": 0
  },
  {
    "title": "What the Fake News Media doesn’t want you to see #Trumprally #MAGA #KAG2020",
    "label": 1
  },
  {
    "title": "Says President Donald Trump 'put out a $297 million contract to a vendor to show him how to hire Border Patrol. So, the first payment they made was $14.8 million. You know how many Border Patrol they hired with $14.8 million? Two.' — Henry Cuellar on Friday, February 22nd, 2019 in a press conference",
    "label": 0
  },
  {
    "title": "Lindsey Graham: Kavanaugh proved Dems will 'do anything to win'",
    "label": 1
  },
  {
    "title": "I was getting upset, but then it dawned on me...",
    "label": 1
  },
  {
    "title": "Despite Trump's campaign promise to revive U.S. manufacturing, General Motors to slash 14,000 jobs, close up to 5 plants",
    "label": 0
  },
  {
    "title": "Over 80,000 Sign Petition To Have Street Outside Trump Tower Named After Obama",
    "label": 0
  },
  {
    "title": "McCabe: My firing is part of effort to undermine Mueller probe",
    "label": 0
  },
  {
    "title": "Synagogue Shooting Is As Anti-American As It Gets",
    "label": 1
  },
  {
    "title": "Lawyers: White Students Should Be Able To Sue Cal Poly For Racial Discrimination",
    "label": 1
  },
  {
    "title": "Michael Bloomberg Suspends Presidential Campaign",
    "label": 1
  },
  {
    "title": "Trump Jr. mocks Biden for saying he plans to cure cancer as president: 'Why the hell didn't you do that' before?",
    "label": 1
  },
  {
    "title": "Does it?",
    "label": 1
  },
  {
    "title": "Candace Owens Powerful Migrant Detention Center Rant Showing lavish conditions",
    "label": 1
  },
  {
    "title": "Nancy Pelosi has been telling DREAMer stories for 4 hours. And she’s still talking",
    "label": 0
  },
  {
    "title": "Where is Obama while his party descends into socialism?",
    "label": 1
  },
  {
    "title": "Trump cancels trips to Colorado, Nevada as coronavirus spreads",
    "label": 1
  },
  {
    "title": "Transgenders dominate girls in athletics, violating the civil rights of Connecticut female athletes. Department of Education Office for Civil Rights investigating. Where is the Feminist outcry?",
    "label": 1
  },
  {
    "title": "FLASHBACK: Hillary Predicted Trump's Tax Plan Would Destroy 3.5 Million Jobs",
    "label": 1
  },
  {
    "title": "Trump bans American-born man from reentering US who testified against him in Russia investigation.",
    "label": 0
  },
  {
    "title": "Thanks again, Obama.",
    "label": 0
  },
  {
    "title": "President Trump impeached for abuse of power, obstruction of Congress",
    "label": 0
  },
  {
    "title": "Heckler: 'Excuse me, Mr. Biden! Excuse me, Mr. Biden -- how much money did you make in Ukraine with your son?' Joe Biden: 'I released 21 years of my tax returns. Your guy hasn't released one. What's he hiding?'",
    "label": 0
  },
  {
    "title": "Photo of H.W. Bush overlooking the casket of his recently passed wife",
    "label": 1
  },
  {
    "title": "“Yes, Michael Cohen was Trump's personal lawyer, but more recently he was Deputy Finance Chair of the Republican National Committee. The Deputy Finance Chair of the RNC was just sentenced to 3 years in prison for felonies committed during the 2016 presidential election campaign.”",
    "label": 0
  },
  {
    "title": "Adam Schiff on Twitter: 'A quick update on our national security leadership: Defense Secretary: Vacant. DHS Secretary: Vacant. UN Ambassador: Vacant. FEMA Director: Vacant. Secret Service Director: Vacant. ICE Director: Vacant. DHS Deputy: Vacant. President: Present, but unaccounted for.'",
    "label": 0
  },
  {
    "title": "US budget deficit hits record $234 billion in February, national debt",
    "label": 1
  },
  {
    "title": "Lindsey Graham, Ted Cruz Announce New Legislation Allowing Victims of Violence to Sue Sanctuary Cities",
    "label": 1
  },
  {
    "title": "Jeff Sessions targeting marijuana, not opioids? That's crazy.",
    "label": 0
  },
  {
    "title": "Brian Klaas on Twitter: '51% of self-identifying Republicans now believe that the press—a foundational pillar of democracy—is, as Trump called it, “the enemy of the people.” Others who used that authoritarian phrase: Mao, Stalin, Chavez.'",
    "label": 0
  },
  {
    "title": "Democrats are Doomed: Two Polls Show Support for Trump Among African Americans at 34%",
    "label": 1
  },
  {
    "title": "I am not sure about the rest of you, but to me the jury is in.",
    "label": 0
  },
  {
    "title": "Unimpressed",
    "label": 1
  },
  {
    "title": "You decide, Alabama.",
    "label": 0
  },
  {
    "title": "Neil deGrasse Tyson on Twitter: 'In case you were wondering, one-third (95 out of 289) of all American Nobel Prizes in the Sciences have been earned by Immigrants to the United States.'",
    "label": 0
  },
  {
    "title": "Trump Won Because Of Lower Democratic Turnout. No Matter Who Wins The Nomination... Vote!",
    "label": 0
  },
  {
    "title": "“I don’t want to make abortion illegal, I want to make it unthinkable.” - Frank Stephens",
    "label": 1
  },
  {
    "title": "Public Banned From Seeing School Shooting Case Involving Transgender Anti-Trump Culprit",
    "label": 1
  },
  {
    "title": "Sen. Murphy (D): Soleimani was an enemy of the United States. That’s not a question. The question is this - as reports suggest, did America just assassinate, without any congressional authorization, the second most powerful person in Iran, knowingly setting off a potential massive regional war?",
    "label": 0
  },
  {
    "title": "It’s Really Not AOC, Amazon Or The Green New Deal; It’s Democrats And Their Media",
    "label": 1
  },
  {
    "title": "Charlie Daniels: America, It’s Time to Cool Down - 'Just because people have different opinions about the problems our nation faces, and the means and the leaders we need to solve them, doesn’t mean that we can’t get along with each other.'",
    "label": 1
  },
  {
    "title": "Cruz, Cassidy Introduce Resolution To Take Action Against Antifa",
    "label": 1
  },
  {
    "title": "Who’s Going To Pay For Elizabeth Warren’s $43 Trillion Agenda?",
    "label": 1
  },
  {
    "title": "Trump has been president for over three years. Blaming Obama for a shortage in the N95 mask stockpile is like someone discovering their fridge is empty and then trying to blame it on the person who previously owned the home.",
    "label": 0
  },
  {
    "title": "Trump writes laughably false op-ed about Medicare for All: In a paranoid rant, Trump warns Americans that Democrats want to take away health care. Here's the truth.",
    "label": 0
  },
  {
    "title": "Today on Senator McCain's funeral,only one living president is not invited : Donald Trump. Till this day he didn't apologize to McCain's family or the POWs for trashing all those members in uniform who were captured and tortured by our enemies.",
    "label": 0
  },
  {
    "title": "Republican Fox & Friends pundit, overcome with emotion, says he can’t defend Trump anymore - 'He has failed us.'",
    "label": 0
  },
  {
    "title": "‘F-ck Trump’ Chants Interrupt Fox News World Cup Broadcast from Bar in France",
    "label": 0
  },
  {
    "title": "GoNadler with his impeachin pants on.",
    "label": 1
  },
  {
    "title": "George Takei: 'Trump touted the economy as a reason to re-elect him. Now that there are economic storm clouds, he blames the media for stirring fears of recession. When jobs get scarcer, he’ll blame immigrants. He’ll take credit but never responsibility, because he is a coward and a phony.'",
    "label": 0
  },
  {
    "title": "one of the toughest Anti-Sanctuary Cities law in the nation signed by Florida governor deSantis. Happy birthday mr. president.",
    "label": 1
  },
  {
    "title": "Sen. McConnell fled KY tarmac in an SUV to avoid constituents, but found them outside his home too",
    "label": 0
  },
  {
    "title": "Trump Learned His Lesson: thanks to the obsequious Republican Senate, he can do anything he wants and get away with it",
    "label": 0
  },
  {
    "title": "Americans have had it with vulgar, hateful speech — and blame Trump: Ironically, Republicans and Democrats alike insist “it is very important for elected officials to be honest and ethical (91%).” Republicans, it seems, are in deep denial about the president they fervently support.",
    "label": 0
  },
  {
    "title": "Haha had a good laugh at this.",
    "label": 1
  },
  {
    "title": "Authoritarianism has come to America.",
    "label": 0
  },
  {
    "title": "Trump Falsely Says Times Made Up Source in Report on Korea Summit Meeting: The source was a White House official who held a briefing in the White House briefing room attended by about 50 reporters. the rules of the briefing required the official be referred to as a “senior White House official.”",
    "label": 0
  },
  {
    "title": "CNN at its finest ladies and gentlemen",
    "label": 1
  },
  {
    "title": "While progressive Americans dishonor the stars and stripes, Hong Kong protesters, a world away, wave the American flag.",
    "label": 1
  },
  {
    "title": "Republican ‘pro-life’ congressman slept with patients and paid for their abortions: ‘God has forgiven me’",
    "label": 0
  },
  {
    "title": "No one prevents a witness who can exonerate them from testifying.",
    "label": 0
  },
  {
    "title": "Liar, Liar, Pants On Fire: Trump Says He’s ‘Always’ Taken The Coronavirus Pandemic Seriously. He Hasn't.",
    "label": 0
  },
  {
    "title": "Abandon Facebook as fast as you can",
    "label": 1
  },
  {
    "title": "Thanks for voting for failure Michigan.",
    "label": 1
  },
  {
    "title": "Why can’t you just be normal",
    "label": 1
  },
  {
    "title": "Conservatives Shocked To Discover That Milo Yiannopoulos Is A Terrible Human Being",
    "label": 0
  },
  {
    "title": "Jimmy Carter: U.S. Is an ‘Oligarchy With Unlimited Political Bribery’ – Rolling Stone",
    "label": 0
  },
  {
    "title": "Just One Final Thought",
    "label": 1
  },
  {
    "title": "Trump has gained support among black voters since 2016",
    "label": 1
  },
  {
    "title": "Chicago Mayor Forced To Defend Getting A Haircut In Violation Of Her Own Stay-At-Home Order",
    "label": 1
  },
  {
    "title": "Trump Kept His Promise: America's Courts Are Turning Conservative",
    "label": 1
  },
  {
    "title": "Census confirms: 63 percent of ‘non-citizens’ on welfare, 4.6 million households",
    "label": 1
  },
  {
    "title": "Trump is blaming Democrats for separating migrant families at the border. That is a LIE. He and his administration are enforcing his OWN policy.",
    "label": 0
  },
  {
    "title": "Bill Gates 'thrilled' by legislative boost for nuclear: ''I'm thrilled that senators from both sides of the aisle have come together to support advanced nuclear. This is exactly the kind of leadership our country needs to both solve the climate challenge and reassert our leadership in..'",
    "label": 1
  },
  {
    "title": "California Democrats Outraged As In-N-Out Burger Donates To GOP",
    "label": 1
  },
  {
    "title": "The rigging continues – DNC terrified that Tulsi Gabbard would do to Biden what she did to Kamala Harris in the Detroit debate.",
    "label": 1
  },
  {
    "title": "Trump’s golfing binge is delaying White House duties - Every single American should be able to agree Trump broke at least one promise he made before his 2016 presidential election victory: no golfing.",
    "label": 0
  },
  {
    "title": "LIVE Updates: Mueller contradicts Trump, says report did not exonerate him",
    "label": 0
  },
  {
    "title": "Joe Walsh on Twitter: 'I don't want to hear any Trump supporter or any @FoxNews personality ever complain in the future about a Democrat President going soft on some brutal dictator. After your cheers today, no one will listen to you.'",
    "label": 0
  },
  {
    "title": "Ben Shapiro Goes Whole Day Without Tweeting About Ocasio-Cortez",
    "label": 1
  },
  {
    "title": "Love this",
    "label": 1
  },
  {
    "title": "Joe Biden on Twitter: I don't care who you're supporting, attacks like this against a man who could be the first Jewish President are disgusting and beyond the pale. Hatred and bigotry have no place in America — and it's up to all of us to root out these evils wherever they're found.",
    "label": 0
  },
  {
    "title": "The Nobel Committee just revealed that Trump’s nomination for the Nobel Peace Prize was forged: Investigators have been cooperating with the F.B.I since last fall, which seems to imply that the forgeries were created and sent from the United States.",
    "label": 0
  },
  {
    "title": "Betsy DeVos will cancel $150 million in student debt after being sued for delays: The Department of Education said that it would wipe away student debt for 15,000 borrowers, implementing an Obama-era rule that Secretary Betsy DeVos has fought to block for more than a year.",
    "label": 0
  },
  {
    "title": "I feel so bad for Donald Trump. He is an amazing leader and never gets the respect he deserves. It’s so sad. I’m so proud with how calm and contained he has been throughout his whole presidency and especially now during this global crisis. Thank you for being our leader!",
    "label": 1
  },
  {
    "title": "Warren drops out of the race. Men are to blame—MSNBC explains",
    "label": 1
  },
  {
    "title": "Trump’s lies need to be exposed in real time: Obama did not have a family separation policy. Trump’s claim that “Obama did it first” is both morally vapid and completely wrong. If Trump and his teammates are not stopped dead in their tracks, the media become a platform for deceiving voters.",
    "label": 0
  },
  {
    "title": "Trump: James Clapper said I have no Russia connections. Clapper: No I didn’t.",
    "label": 0
  },
  {
    "title": "Trump said investigating his finances would be a 'red line.' New York prosecutors are about to cross it.",
    "label": 0
  },
  {
    "title": "She's Serious....",
    "label": 1
  },
  {
    "title": "Trump barred a top health expert from speaking freely about the coronavirus. It's one of many ways the administration has muzzled scientists.",
    "label": 0
  },
  {
    "title": "Bias on full display: Google categorizes ‘Unplanned’ movie as ‘propaganda’",
    "label": 1
  },
  {
    "title": "Benghazi vs Mueller",
    "label": 0
  },
  {
    "title": "Trump Won’t Stop His Abuses of Power; The president is violating his oath of office in plain sight. Congress can’t accept that.",
    "label": 0
  },
  {
    "title": "Karl Marx was a Pretty Bad Person",
    "label": 1
  },
  {
    "title": "Still your Prez...",
    "label": 1
  },
  {
    "title": "We owe an apology to the rest of the world.",
    "label": 0
  },
  {
    "title": "Tulsi Gabbard calls out Biden and Sanders after the DNC locks her out of the debate",
    "label": 1
  },
  {
    "title": "That’s a funny way of saying “Man Gets Fired From Disney for Tweeting About Raping Children.”",
    "label": 1
  },
  {
    "title": "Easy",
    "label": 1
  },
  {
    "title": "Coronavirus shows Donald Trump was right all this time about China",
    "label": 1
  },
  {
    "title": "Here's what Ivanka Trump still doesn't get about her email problems: The truth here is that Ivanka Trump is guilty of the same entitlement mentality that her father and his surrogates accused Clinton of.",
    "label": 0
  },
  {
    "title": "Sign The Petition To Make AOC Debate Shaprio",
    "label": 1
  },
  {
    "title": "An Alabama judge allows a teenager to sue an abortion clinic over the unauthorized termination of his child.",
    "label": 1
  },
  {
    "title": "The Hillary Clinton emails story comes to an end: One of the worst media screw-ups in history, and nobody seems to have learned anything. The email story shows how double standards can develop and then produce shockingly unfair coverage in ways that absolutely affect the outcome of the race.",
    "label": 0
  },
  {
    "title": "Where do Republicans find these people?",
    "label": 0
  },
  {
    "title": "Donald Trump Is a 'Russian Asset' Owned by the Mafia, Author Claims in New Book",
    "label": 0
  },
  {
    "title": "Quick! Shut That Door! [OC for all the women who have been silenced]",
    "label": 0
  },
  {
    "title": "MSNBC Gets Caught Using 2011 Border Patrol Video to Trash Donald Trump",
    "label": 1
  },
  {
    "title": "STEP OFF, CORN POP!",
    "label": 1
  },
  {
    "title": "Republicans, the Time Has Come: America is better than Donald Trump. The president of the United States is betraying his oath of office in the most fundamental way, by using the presidency for personal gain at the country’s expense.",
    "label": 0
  },
  {
    "title": "Who Paid?",
    "label": 0
  },
  {
    "title": "Caroline Orr: 'Per @CNN, Rudy Giuliani is now making the very specific claim that it's 'not a crime' if the campaign received hacked emails from WikiLeaks. ... which is exactly what I'd expect him to say if he knows it's about to be revealed that the campaign received hacked emails from WL.'",
    "label": 0
  },
  {
    "title": "This is a picture of NRA President Wayne Lapierre with a confessed Russian Spy",
    "label": 0
  },
  {
    "title": "BREAKING: Feds Investigating Lawmakers’ Stock Transactions Prior To Market Crash, Report Says",
    "label": 1
  },
  {
    "title": "The epitome of class and leadership.",
    "label": 0
  },
  {
    "title": "Bloomberg will pay staff to support whoever becomes Democratic nominee",
    "label": 0
  },
  {
    "title": "The US is losing its world superpower status due to its failure to lead on the Covid-19 crisis – and this time, it might not recover",
    "label": 0
  },
  {
    "title": "Merrick Garland Says He Enjoys a Nice Lemonade Now and Again",
    "label": 0
  },
  {
    "title": "Thought you guys might get a kick out of this: “Those are the numbers? Really? aRe YoU sUrE?!”",
    "label": 1
  },
  {
    "title": "Hypocrisy Hits Home: Trump’s Allies Suddenly Care About Decorum And Unity After Pelosi Tears Up SOTU Speech",
    "label": 0
  },
  {
    "title": "If Smollett really wanted to be a victim of a hate crime",
    "label": 1
  },
  {
    "title": "Chances are",
    "label": 1
  },
  {
    "title": "NY Times newest editorial board member doesn't seem to like 'Dumba** F***ing White People'",
    "label": 1
  },
  {
    "title": "The two parties are NOT the same.",
    "label": 0
  },
  {
    "title": "Relax & Take Notes.",
    "label": 0
  },
  {
    "title": "The ADHD Overdiagnosis Epidemic Is a Schooling Problem, Not a Child One",
    "label": 1
  },
  {
    "title": "I want to live...",
    "label": 1
  },
  {
    "title": "Greyhound to Stop Allowing Border Patrol Agents on Its Buses Without Warrants",
    "label": 0
  },
  {
    "title": "The president said that it is ok to not give federal workers raises because they are mostly democrats. This has to be illegal somehow.",
    "label": 0
  },
  {
    "title": "Adam Schiff: 'Did the President obstruct justice? Yes. Was it worse than Watergate? Yes. This break in was by a hostile foreign adversary. This president welcomed their help. This president lied about it and sided with that power over his own agencies. Don’t believe it? Read the report.'",
    "label": 0
  },
  {
    "title": "#MyPresident trends for Barack Obama after his viral message on El Paso and Dayton shootings: 'This is what a real leader sounds like'",
    "label": 0
  },
  {
    "title": "No President facing criminal indictment for violation of Federal laws, potentially including treason, should be allowed to nominate a Supreme Court Justice",
    "label": 0
  },
  {
    "title": "Women's March Releases Statement Slamming Trump's SCOTUS Nominee Without Replacing Placeholder Text",
    "label": 1
  },
  {
    "title": "NY Defense Attorney: 'For context on Manafort’s 47 months in prison, my client yesterday was offered 36-72 months in prison for stealing $100 worth of quarters from a residential laundry room.'",
    "label": 0
  },
  {
    "title": "Why did the far-left media attack the MAGA kids so viciously? Because they know teenagers are increasingly rebelling against SJW culture. And as usual, Progressives try to demonize any group they see as an ideological threat.",
    "label": 1
  },
  {
    "title": "Why is it easier to blame 150,000,000 Americans being 'lazy' rather than 400 Americans being greedy.",
    "label": 0
  },
  {
    "title": "Turns Out California Democrats Used Illegals For Ballot Harvesting",
    "label": 1
  },
  {
    "title": "No jail time for Portland Antifa Leader who pleads guilty to raping an underage boy in his 2nd conviction (repeat offender)",
    "label": 1
  },
  {
    "title": "How exactly are Foxx and Smollet not in prison yet?",
    "label": 1
  },
  {
    "title": "Turns Out Hannity Has a Secret Real Estate Empire, With Ties to Trump Admin",
    "label": 0
  },
  {
    "title": "United States Led Entire World In Reducing CO2 Emissions In 2019",
    "label": 1
  },
  {
    "title": "What a turn of events this has been.",
    "label": 0
  },
  {
    "title": "AL Democrats Tweet Picture of Jeff Sessions with Lev Parnas: 'How Bout That'",
    "label": 0
  },
  {
    "title": "Trump supporters pelted by eggs, punches can sue San Jose cops after attack, court says",
    "label": 1
  },
  {
    "title": "The Virginia Senate passed a bill that would eliminate the Confederate Lee-Jackson Day as a state holiday in favor of making Election Day a state holiday",
    "label": 0
  },
  {
    "title": "Elderly pro-life man kicked, threatened at California Planned Parenthood",
    "label": 1
  },
  {
    "title": "Say it again, for those in the back",
    "label": 0
  },
  {
    "title": "Asha Rangappa on Twitter: 'I'm so tired. Of Muslims being killed in mosques. Of Jews being killed in synagogues. Of Sikhs being killed in temples. Of Christians being killed in church. Mostly, though, I'm ashamed that America no longer has the moral leadership to unequivocally condemn these acts.'",
    "label": 0
  },
  {
    "title": "10% of Trump 2016 voters might not vote for him in 2020 — The persuadable Trump voter could swing the election in November.",
    "label": 0
  },
  {
    "title": "A message for “Journalists”",
    "label": 1
  },
  {
    "title": "Walk Away",
    "label": 1
  },
  {
    "title": "Mitch McConnell in 2018: Democrats have a strategy of “delay, obstruct and resist.” McConnell in 2016: 'One of my proudest moments was when I looked at Barack Obama in the eye and said, ‘Mr. President, you will not fill this Supreme Court vacancy.'",
    "label": 0
  },
  {
    "title": "Alabama GOP calls to expel Rep. Ilhan Omar from Congress - American Politics",
    "label": 1
  },
  {
    "title": "AOC urges illegal immigrants to fill out 2020 census",
    "label": 1
  },
  {
    "title": "Florida governor claims election fraud, orders law enforcement investigation",
    "label": 1
  },
  {
    "title": "PUBLIC SAFETY OVER POLITICS! Governor Roy Cooper",
    "label": 1
  },
  {
    "title": "Boyan >>>",
    "label": 1
  },
  {
    "title": "So it would seem",
    "label": 1
  },
  {
    "title": "Triggered",
    "label": 1
  },
  {
    "title": "U.S. Senator: GOP Is Turning Into Russia’s ‘Most Important Global Asset’",
    "label": 0
  },
  {
    "title": "Beto O'Rourke Goes Full Socialist, Says He Will 'Break Apart' American Wealth",
    "label": 1
  },
  {
    "title": "sums it up",
    "label": 1
  },
  {
    "title": "Speaker at Moore event says he accidentally went with Moore to a brothel with child prostitutes: 'There were certainly pretty girls. And they were girls. They were young. Some were very young.'",
    "label": 0
  },
  {
    "title": "Trump downplays worst-case coronavirus scenarios: 'I don't believe you need 40,000 or 30,000 ventilators'",
    "label": 0
  },
  {
    "title": "Iran's Foreign Minister Threatens to Expose Western Diplomats Who Took Bribes to Create the Iran Nuclear Deal",
    "label": 1
  },
  {
    "title": "Second-quarter GDP jumps 4.1% for best pace in nearly four years",
    "label": 1
  },
  {
    "title": "Trump impeachment far more popular with women than men",
    "label": 0
  },
  {
    "title": "IRS says average refund up 1.3 percent",
    "label": 1
  },
  {
    "title": "New Mexico governor signs law requiring background checks for almost all firearm sales",
    "label": 0
  },
  {
    "title": "Andy Ngo’s Lawyer Vows to Sue Antifa ‘into Oblivion’",
    "label": 1
  },
  {
    "title": "Clown World",
    "label": 1
  },
  {
    "title": "Let the system work...as long as it works for Democrats.",
    "label": 1
  },
  {
    "title": "Trump’s Disapproval Hits Record High Amid Government Shutdown",
    "label": 0
  },
  {
    "title": "MIT forms research center to improve lives of those with Down syndrome",
    "label": 1
  },
  {
    "title": "Democrats paid for a wall ... in Jordan",
    "label": 1
  },
  {
    "title": "Join The Battle For Net Neutrality! Don't Let The FCC Destroy The Internet!",
    "label": 0
  },
  {
    "title": "If the Republican Party Is Dying, Why Are Their Governors So Popular?",
    "label": 1
  },
  {
    "title": "Rep. Joe Kennedy III: 'Last week HouseDemocrats funded intel agencies, strengthened electoral security, gave over 30 million workers a raise & rejected racism. Meanwhile Senate GOP blocked a vote to get 9/11 first responders medical care. Tell me again which party gets to claim mantle of patriotism'",
    "label": 0
  },
  {
    "title": "Tom Nichols: 'The Russians attacked the election. The Trump campaign, right up to the top, thought that was awesome. They greeted it with 'how can we work this' instead of 'call the FBI.' They lied, and lied, and lied some more. Amazing that the media got *any* of it right faced with that.'",
    "label": 0
  },
  {
    "title": "James Comey on Twitter: 'Thought experiment: Make a list of all the public figures in this country and around the world the current president has criticized. Ask yourself: “Why is Putin missing from the list?” No responsible American should ever stop asking, “Why?”'",
    "label": 0
  },
  {
    "title": "Poll: Majority of Democrats Want Their Party to Become Less Liberal",
    "label": 1
  },
  {
    "title": "Why arw we still talking about what the whistleblower said was on the phone call when we have the ACTUAL TRANSCRIPT OF THE PHONE CALL!!!",
    "label": 1
  },
  {
    "title": "Tom Nichols on Twitter: 'Schiff’s five minutes and Mueller’s answers would have been enough for Republicans to impeach and convict any other president before sundown today.'",
    "label": 0
  },
  {
    "title": "Texas Democrats won 47% of votes in congressional races. Should they have more than 13 of 36 seats? ­Even after Democrats flipped two districts, toppling GOP veterans in Dallas and Houston, Republicans will control 23 of the state’s 36 seats. It’s the definition of gerrymandering.",
    "label": 0
  },
  {
    "title": "A photo that will go down in history",
    "label": 0
  },
  {
    "title": "Trump’s Unsecured iPhones Make Clinton’s Basement Server Look Like Fort Knox",
    "label": 0
  },
  {
    "title": "Only 2 Iraqi translators who worked with U.S. troops got U.S. visas last year: Thousands of translators in Iraq face danger as they wait to gain entry to the U.S.",
    "label": 0
  },
  {
    "title": "GOP Lawmaker Breaks Ranks On Russia Report: 'We've Lost All Credibility'",
    "label": 0
  },
  {
    "title": "Seeing the results come in last night with my liberal friends.",
    "label": 1
  },
  {
    "title": "Jon Favreau on Twitter: 'The crowd at Trump’s rally chanting “send her back” after the President viciously and dishonestly attacked Ilhan Omar is one of the most chilling and horrifying things I’ve ever seen in politics.'",
    "label": 0
  },
  {
    "title": "They can’t get rid of him",
    "label": 1
  },
  {
    "title": "Hillary Clinton: Only about 1% of abortions happen later in pregnancy—almost always because a woman’s health or life is at risk, or the pregnancy is no longer viable. Lying about this is dangerous, and a slap in the face to families who face heartbreaking situations.",
    "label": 0
  },
  {
    "title": "House Republicans pull health care bill",
    "label": 0
  },
  {
    "title": "Stephen Miller",
    "label": 0
  },
  {
    "title": "Sen. Jeff Merkley on Twitter: You are being sued over your Fake Emergency because the only crisis at the border is the humanitarian one YOU and your administration created when they tore children away from their parents. You’re not getting your racist and pointless Wall.",
    "label": 0
  },
  {
    "title": "Americans rank Barack Obama as best president of their lifetimes: Poll",
    "label": 0
  },
  {
    "title": "Only 30 Days Out.",
    "label": 0
  },
  {
    "title": "CNN's Chris Cuomo: Trump actually did what he's accusing Biden of",
    "label": 0
  },
  {
    "title": "Bill Barr Is the Most Dangerous Man in America -- The banality of the AG’s droning Hill testimony hides its evil purpose: to protect the president, not the rule of law.",
    "label": 0
  },
  {
    "title": "Tom Cotton: Anyone who casts 'Wuhan Virus' as xenophobic is a 'politically correct fool'",
    "label": 1
  },
  {
    "title": "Bill and Hillary kick off their paid speaking tour in CANADA but rows of seats remain EMPTY",
    "label": 1
  },
  {
    "title": "Amy McGrath says she will take on Mitch McConnell in 2020 US Senate race",
    "label": 0
  },
  {
    "title": "Rep. Ilhan Omar calls for 90 percent tax on the rich",
    "label": 1
  },
  {
    "title": "Maxine Waters unleashes over Trump COVID-19 response: 'Stop congratulating yourself! You're a failure'",
    "label": 0
  },
  {
    "title": "Great First Families of Christmas Past.",
    "label": 0
  },
  {
    "title": "US intelligence agents were reportedly warned not to tell Trump findings that contradict his public comments",
    "label": 0
  },
  {
    "title": "If Trump really attempted to ruin CNN, he deserves to be impeached: The difficulty of covering the Trump administration is that the scandals are so numerous and frequent that it is nearly impossible to focus on one before being overtaken by another.",
    "label": 0
  },
  {
    "title": "Coming Soon To A Theatre Near You",
    "label": 1
  },
  {
    "title": "The best evidence of obstruction of justice: Trump is telling witnesses to obstruct an impeachment investigation. The president has no authority to tell a witness not to show up. The president has no absolute immunity to prevent ex-aides from testifying. That is what he did according to Lewandowski.",
    "label": 0
  },
  {
    "title": "Attention Texas Democrats -- Today Is Primary Day -- Your Vote Is Critically Important!",
    "label": 0
  },
  {
    "title": "North Korea agrees to ‘complete denuclearization of the Korean Peninsula' after Trump-Kim summit",
    "label": 1
  },
  {
    "title": "Kanye West Declares He's Seen the Conservative Light",
    "label": 1
  },
  {
    "title": "Ryan Goodman on Twitter: 'The United States government is treating innocent immigrant children worse than the most basic standards required by international humanitarian law for enemy prisoners of war.'",
    "label": 0
  },
  {
    "title": "You don’t hand matches to an arsonist, and you don’t give power to an angry left-wing mob. Democrats have become too EXTREME and TOO DANGEROUS to govern. Republicans believe in the rule of law - not the rule of the mob. VOTE REPUBLICAN!",
    "label": 1
  },
  {
    "title": "When celebrities and politicians lecture about climate change",
    "label": 1
  },
  {
    "title": "On this day in history, February 28 1854, the Republican Party was born in Ripon, WI in response to the Kansas-Nebraska Act and the spread of slavery.",
    "label": 1
  },
  {
    "title": "TYRANNY or FREEDOM...I thought belonged here. Obvious, but we seem to have a population intent on manufacturing outrage.",
    "label": 1
  },
  {
    "title": "New allegations surface against Brett Kavanaugh from Yale student who says he thrust his genitals in her face",
    "label": 0
  },
  {
    "title": "Forty percent of Ilhan Omar's campaign spending went to alleged boyfriend's firm",
    "label": 1
  },
  {
    "title": "Pelosi and Schumer Block $1.6 Trillion Emergency Economic Bill – DOW Futures Collapse…",
    "label": 1
  },
  {
    "title": "Media bias",
    "label": 1
  },
  {
    "title": "Here’s why",
    "label": 1
  },
  {
    "title": "Explained",
    "label": 1
  },
  {
    "title": "HE DID IT AGAIN! Trump Takes Out Top Iranian Revolutionary Guards' Commander in Iraq - General Siamand Mashhadani Killed in US Strike",
    "label": 1
  },
  {
    "title": "Trump Budget to Propose 'Savage' Cuts to Medicare, Medicaid, & Social Security While Hiking Pentagon & Wall Funds - 'This budget is Trump's pledge that as long as he stays in office, slashing Social Security, Medicaid, & whatever's left of SNAP will remain a White House priority.'",
    "label": 0
  },
  {
    "title": "Adam Schiff: 'Trump finally submitted a budget (a month late). Let's take a look, shall we? $8 billion for a wall Congress rejected. $840 billion in cuts to Medicare. Trillion dollar deficits for the next four years. You know what, Mr. President, keep your budget. We’ll take it from here.'",
    "label": 0
  },
  {
    "title": "Remember when people like Sarah Palin shit their pants when Obama traveled on the taxpayer's dime? Trump is about to 'bankrupt' the U.S. Secret Service. Where are those complaints now?",
    "label": 0
  },
  {
    "title": "El Paso congresswoman says Trump 'not welcome' in the city after mass shooting: 'Words have consequences. The president has made my community and my people the enemy,' said Escobar. 'He has told the country that we are people to be feared, people to be hated.'",
    "label": 0
  },
  {
    "title": "Trump Named Man of the Year by ISIS",
    "label": 0
  },
  {
    "title": "New laws will only hurt law-abiding bomb owners.",
    "label": 0
  },
  {
    "title": "Ilhan Omar Claims White Men ‘Cause Most Of The Deaths’ In America. She's Wrong. Here Are The Facts.",
    "label": 1
  },
  {
    "title": "Chris Wallace Shuts Down GOP Argument on Impeachment: ‘It Was a Lot More Than a Phone Call. It Was a Coordinated Campaign.’",
    "label": 0
  },
  {
    "title": "Donald Trump’s Response to John McCain’s Death Reminds Us Just How Petty He Is: Donald Trump is a small, petty man. He is a liar and a crook. And his legal problems are mounting. Each one of these statements has been true since January 20, 2017, when Trump became the President of the United States.",
    "label": 0
  },
  {
    "title": "Maybe screwing all of those Ron Paul supporters was really friggin stupid?",
    "label": 1
  },
  {
    "title": "Colbert: 'So the wall is a metaphor for Trump's manhood? No wonder he's having a problem erecting it'",
    "label": 0
  },
  {
    "title": "It doesn’t really help that New York can now have abortions up until birth. Disgusting",
    "label": 1
  },
  {
    "title": "Hillary Clinton: World champs—again!! To the amazing women of the #USWNT: Thank you for playing like girls. 🇺🇸",
    "label": 0
  },
  {
    "title": "Oklahoma teachers are running for office as Democrats, fighting to raise taxes on oil companies to fund schools",
    "label": 0
  },
  {
    "title": "Ocasio-Cortez lied about illegals drinking from toilets in Detention centers",
    "label": 1
  },
  {
    "title": "Accurate",
    "label": 1
  },
  {
    "title": "The American Media Destroyed Themselves over the Mueller Investigation",
    "label": 1
  },
  {
    "title": "Barack Obama was an awesome president — and Democrats shouldn't forget that",
    "label": 0
  },
  {
    "title": "In the interest of bipartisanship",
    "label": 1
  },
  {
    "title": "Sorry, kid. Penis compensation is too important to our country.",
    "label": 0
  },
  {
    "title": "GoFundMe for Supreme Court nominee Brett Kavanaugh raises more than $500,000",
    "label": 1
  },
  {
    "title": "Obama Said Publicly Shaming People On Twitter Is 'Not Activism'",
    "label": 0
  },
  {
    "title": "The wealthiest man in the world was born to a high school teenage mother",
    "label": 1
  },
  {
    "title": "GOP strategist admits he colluded with Russian hackers to hurt Hillary Clinton, Democrats",
    "label": 0
  },
  {
    "title": "Time for the US to declare independence from China",
    "label": 1
  },
  {
    "title": "Vote for civility. Vote for prosperity. Vote for jobs not mobs. Vote Republican.",
    "label": 1
  },
  {
    "title": "New Mexico city of Roswell is being labeled a ‘sanctuary city’ for preborn",
    "label": 1
  },
  {
    "title": "Sorry, all out of collusion",
    "label": 1
  },
  {
    "title": "Alabama lawmakers introduce bill that would essentially ban all abortions",
    "label": 1
  },
  {
    "title": "Antifa attacks the elderly in Portland",
    "label": 1
  },
  {
    "title": "Trump Confirms Illegal Immigrants Will Be ‘Given to Sanctuary Cities and States’",
    "label": 1
  },
  {
    "title": "Arrested ANTIFA members (Sundays 'Anti-Marxism rally')",
    "label": 1
  },
  {
    "title": "D-Day Invasion",
    "label": 1
  },
  {
    "title": "Parnas says he has turned over tape of Trump calling for diplomat's firing",
    "label": 0
  },
  {
    "title": "Washington state nonprofit files lawsuit saying Fox News misled viewers about coronavirus",
    "label": 0
  },
  {
    "title": "Trump Isn’t the One Dividing Us by Race He hardly mentions it, while his adversaries are obsessed with ‘whiteness’ and ‘white privilege.’",
    "label": 1
  },
  {
    "title": "How long before Trump supporters realize that you don’t surround yourself with dirty guys unless you’re dirty yourself? -Stephen King",
    "label": 0
  },
  {
    "title": "No, Trump Is Not Losing ‘3 To 5 Billion’ Dollars From Presidency: His income isn’t anywhere near $3 billion. And his net worth has not dropped by $3 billion since he went into politics—let alone $5 billion, which is more than he’s ever been worth.",
    "label": 0
  },
  {
    "title": "Tucker Carlson: Nobody Hates Diversity More Than Rich Liberals",
    "label": 1
  },
  {
    "title": "Antifa should take a lesson.",
    "label": 1
  },
  {
    "title": "They nail it perfectly",
    "label": 1
  },
  {
    "title": "Democrat John Bell wins Virginia State Senate race in Loudoun, Prince William counties; The projected win is now likely to deliver Democrats control of the Virginia State Senate, a crucial development as Democrats hope to shift the balance of power.",
    "label": 0
  },
  {
    "title": "Tim Wise: Just a reminder that if you think Hillary would have been worse than this shit, you are a moron to whom no one should listen, about anything...ever again.",
    "label": 0
  },
  {
    "title": "Pastor praises Trump as ‘pro-black’ at prison reform event",
    "label": 1
  },
  {
    "title": "A breakdown of the USA vs Iran situation that you will not see in the media..",
    "label": 1
  },
  {
    "title": "Lindsey Graham on Twitter: 'If we nominate Trump, we will get destroyed.......and we will deserve it.'",
    "label": 0
  },
  {
    "title": "So much easier to watch this way!",
    "label": 1
  },
  {
    "title": "Logical to ask Immigrants to Show they can support themselves if coming to live here. Every other country I have considered for a second home requires something similar. Fair and Reasonable DHS move? In my opinion, yes!",
    "label": 1
  },
  {
    "title": "Admit it: Trump is unfit to serve",
    "label": 0
  },
  {
    "title": "Trump tampered with witnesses. These Senate Republicans voted to oust Bill Clinton for doing just that",
    "label": 0
  },
  {
    "title": "liberal logic",
    "label": 1
  },
  {
    "title": "Fox News Had Stormy Daniels Story Before 2016 Election but Killed it Because Murdoch Wanted Trump to Win: “Good reporting, kiddo. But Rupert [Murdoch] wants Donald Trump to win. So just let it go.”",
    "label": 0
  },
  {
    "title": "Fake News as always",
    "label": 1
  },
  {
    "title": "If you watch Trump this week he looks dejected, as if he is thinking how this could happen to him. He doesn't care about any of us. Not even his base. He is no leader. He should just resign if he knows he can't cope.",
    "label": 0
  },
  {
    "title": "Head of think tank funded by Google resigns after wishing coronavirus would kill Trump",
    "label": 1
  },
  {
    "title": "Remember the Puerto Rico incident where they said Pres. Trump refused to send help? The public just discovered the warehouse the government was using to hide the 'never-received' supplies",
    "label": 1
  },
  {
    "title": "Donald Trump's talk of 'preserving our heritage' is 'sick' and reminiscent of Hitler, says former Obama official",
    "label": 0
  },
  {
    "title": "When an orange baboon tries to embarrass you on camera but you flip it on him and make him meltdown on national television.",
    "label": 0
  },
  {
    "title": "Donald Trump's unhinged press conference proved he is the most unfit person ever to be US president",
    "label": 0
  },
  {
    "title": "Silly but I found this hilarious",
    "label": 1
  },
  {
    "title": "Trump, GOP challenge efforts to make voting easier amid coronavirus pandemic",
    "label": 0
  },
  {
    "title": "Medical Examiner states Jeffrey Epstein’s injuries consistent with homicide, not suicide",
    "label": 1
  },
  {
    "title": "CNN Siding With China Just Because They Hate Trump",
    "label": 1
  },
  {
    "title": "President of Finland records a video saying he likes the company of reindeer over being with Donald Trump",
    "label": 0
  },
  {
    "title": "GOOD GUY WITH A GUN: Gunman Shot Dead by Concealed Carry Permit Holder at Walmart in Washington",
    "label": 1
  },
  {
    "title": "My First time voting red... 😎",
    "label": 1
  },
  {
    "title": "Giuliani associate wants to testify that Nunes aides hid Ukraine meetings on Biden dirt from Schiff",
    "label": 0
  },
  {
    "title": "Chris Hayes on Twitter: 'First time illegal entry into the United States is a misdemeanor. Lying on or omitting materially relevant information from your SF86 (as Jared Kushner did multiple times by his own admission) is a felony. Guess which one's getting prosecuted?'",
    "label": 0
  },
  {
    "title": "Dr. Lance Dodes on Trump: A 'predator' who 'would be in prison' if he hadn't been born rich",
    "label": 0
  },
  {
    "title": "“Nothing was your own except the few cubic centimeters inside your skull. ”",
    "label": 0
  },
  {
    "title": "Bob Woodward’s book sold almost as many copies in one week as Donald Trump’s ‘Art of the Deal’ has in 30 years",
    "label": 0
  },
  {
    "title": "Missed it again",
    "label": 1
  },
  {
    "title": "Kamala Harris: Fifty days ago I attended a Homeland Security committee meeting about the coronavirus—and no current Trump administration public health officials bothered to show up. Now more than 5,000 Americans are dead. Their failure to swiftly act cost lives.",
    "label": 0
  },
  {
    "title": "Trump is facing bipartisan backlash for his handling of the coronavirus' spread in the US as the CDC warns 'this might be bad'",
    "label": 0
  },
  {
    "title": "Hours before Trump fired Comey, grand jury subpoenas issued in FBI's Russia investigation",
    "label": 0
  },
  {
    "title": "ICE Deports Over Quarter of a Million Illegals, 5.5K Gang Members in 2019",
    "label": 1
  },
  {
    "title": "Adam Schiff on Twitter: 'When McConnell deprived President Obama of a vote on Garland, it was a nuclear option. The rest is fallout.'",
    "label": 0
  },
  {
    "title": "Will Ocasio-Cortez apologize to 'mini AOC' for her supporter's death threats?",
    "label": 1
  },
  {
    "title": "New data shows that White Democrats oppose charter schools - but their Black and Hispanic peers favor them",
    "label": 1
  },
  {
    "title": "Sanders Clarifies His Gulags Will Be Democratic Gulags",
    "label": 1
  },
  {
    "title": "Majority of Americans disapprove of Trump’s handling of Iran, feel less safe after strike: Poll",
    "label": 0
  },
  {
    "title": "Republicans call for House Ethics Committee to investigate Rep. Joaquin Castro tweet",
    "label": 1
  },
  {
    "title": "CNN Spends Five Days On Thanos Meme While Ignoring Afghan Papers",
    "label": 1
  },
  {
    "title": "The logic of democrats",
    "label": 1
  },
  {
    "title": "The GOP Is Sweating Bullets Over Beto O’Rourke",
    "label": 0
  },
  {
    "title": "Why On Earth Should Anyone Believe China’s Coronavirus Statistics?",
    "label": 1
  },
  {
    "title": "Democrats Lie About Coronavirus To Attack Trump. Their Policies Could Make Fighting Pandemics More Difficult.",
    "label": 1
  },
  {
    "title": "White House claimed Trump had a day full of meetings, but the truth emerges with a swamp selfie: One problem for POTUS and his staff. The Newsmax CEO tweeted a photo and it became clear Trump was not in high-level meetings, he was playing golf.",
    "label": 0
  },
  {
    "title": "Democrats don't realize most Americans want visa overstays deported",
    "label": 1
  },
  {
    "title": "Canadian deported despite having served for US military: A Canadian captain who fought alongside American troops in Afghanistan, and who is married to a former officer in the US air force, was dumped at the Canadian border as Trump’s zero tolerance policies continue to break apart military families.",
    "label": 0
  },
  {
    "title": "President Trump promised a fast vaccine; this is the fastest vaccine creation in human history. Human trials begin today.",
    "label": 1
  },
  {
    "title": "Donald Trump is Not 'Unwitting Agent' to Russia, 'Knows Exactly What He is Doing' Says House Intelligence Democrat",
    "label": 0
  },
  {
    "title": "After Doug Jones’ Upset Win In Alabama, Democrats Target Ted Cruz",
    "label": 0
  },
  {
    "title": "Claire McCaskill on Twitter: 'When 600 agents were making a show of arresting 680 undocumented immigrants working at Mississippi processing plants, did anyone bother to arrest the employers? Or did they leave them undisturbed in the back room counting their money?'",
    "label": 0
  },
  {
    "title": "Found this on Twitter of some guy saying how great Marxism is, then someone else just posted this.",
    "label": 1
  },
  {
    "title": "Pelosi Demands Fair Senate Trial, Won’t Appoint Impeachment Managers Yet",
    "label": 0
  },
  {
    "title": "Exclusive: Google Insider Turns Over 950 Pages Of Docs And Laptop To DOJ",
    "label": 1
  },
  {
    "title": "My Pillow CEO Donates $1 Million To Help Fund New Pro-Life Film",
    "label": 1
  },
  {
    "title": "CNN Is Wrong, America Does Not Want To Give Up Its Guns",
    "label": 1
  },
  {
    "title": "Top Democratic committee lawyers to consider subpoenaing Trump’s Russian translator from Putin meeting",
    "label": 0
  },
  {
    "title": "They Know Trump Did It. They Just Don’t Care.",
    "label": 0
  },
  {
    "title": "WHO officials praise US leaders on coronavirus pandemic response: Trump is doing 'all he can'",
    "label": 1
  },
  {
    "title": "Supreme Court rules government-maintained cross doesn't violate Constitution",
    "label": 1
  },
  {
    "title": "CNN’s Jim Acosta Responds to Sarah Sanders’ Statement on Suspending His Credentials: ‘This Is a Lie’",
    "label": 0
  },
  {
    "title": "Now I know why I liked Nickelodeon so much as a kid.",
    "label": 0
  },
  {
    "title": "Ike on the corporate tax rate.",
    "label": 0
  },
  {
    "title": "Judge Allows Lev Parnas to Share Evidence with Congress That Could Corroborate Claims About Devin Nunes",
    "label": 0
  },
  {
    "title": "I hope this is clear enough. If it's not, I'll keep trying. The government awarding the G7 contract to Trump is not more of the same corruption. It's not even the same but grander. It is different in nature. Trump is reaching into the Treasury and taking your money for himself.",
    "label": 0
  },
  {
    "title": "New Marist shock poll: 75% of New Yorkers reject late-term abortion",
    "label": 1
  },
  {
    "title": "Iowa set to redirect over $200k in sex ed funds away from Planned Parenthood",
    "label": 1
  },
  {
    "title": "Parkland dad uncovers how district enabled deranged student-turned-shooter",
    "label": 1
  },
  {
    "title": "Democrats view socialism more favorably than capitalism, Gallup says",
    "label": 1
  },
  {
    "title": "Sandy Hook shooting: Father of murdered boy wins defamation suit against conspiracy theorists",
    "label": 0
  },
  {
    "title": "The Democrats’ 2020 Campaign Theme Is 'You Americans Are Terrible'",
    "label": 1
  },
  {
    "title": "Man it’s hard being a conservative on Reddit",
    "label": 1
  },
  {
    "title": "Sacha Baron Cohen: Facebook would have let Hitler buy ads for 'final solution'",
    "label": 0
  },
  {
    "title": "Finally, President Trump Moves to Gain Control of the White House Personnel System and His Administration",
    "label": 1
  },
  {
    "title": "McCabe: 'I was fired because I opened a case against the president'",
    "label": 0
  },
  {
    "title": "White House May Have Broken Federal Law by Doctoring Trump-Putin Video",
    "label": 0
  },
  {
    "title": "Trump Overrules State Wishes As He Signs Order Diverting Water To California Farmers",
    "label": 1
  },
  {
    "title": "BREAKING: Senator Mitt Romney said publicly that he will vote to hear testimony from Trump's former National Security Advisor John Bolton.",
    "label": 0
  },
  {
    "title": "Trump Reportedly Denied He Called Apple CEO ‘Tim Apple’ Despite the Fact It’s All on Tape",
    "label": 0
  },
  {
    "title": "The Forrest Trump Presidency: “It’s like Forrest Gump won the presidency,” said a Republican congressman. “But it’s an evil, really stupid Forrest Gump. He can’t help himself. He’s just an idiot who thinks he’s winning when people are bitching about him.”",
    "label": 0
  },
  {
    "title": "In their first 100 days, socialist Democrats have shown they are unable to lead",
    "label": 1
  },
  {
    "title": "GoFundMe",
    "label": 0
  },
  {
    "title": "Democrats are too dangerous to govern",
    "label": 0
  },
  {
    "title": "Explosive report indicates that Donald Trump's loans from Deutsche Bank were backed by Russia",
    "label": 0
  },
  {
    "title": "Howard Dean on Twitter: 'Dozens of kids have been murdered in schools and Trump is in a snit about transgendered people defending us. He is pathetic and small.'",
    "label": 0
  },
  {
    "title": "No, Trump Rallies Didn't Increase Hate Crimes by 226 Percent",
    "label": 1
  },
  {
    "title": "Anti-Trump conservative group, led by George Conway and Rick Wilson, endorses Joe Biden",
    "label": 0
  },
  {
    "title": "They never stood a chance",
    "label": 1
  },
  {
    "title": "Robert Mueller Will Indict a Lot of People in the Next 60 Days: ‘They Will Be Quite Familiar to the Average American,’ Says Former CIA Director",
    "label": 0
  },
  {
    "title": "I honestly think if you are conservative or republican you should leave Reddit behind.",
    "label": 1
  },
  {
    "title": "POOF HE’S GONE! MSNBC and ABC crop out Louis Farrakhan from Aretha Franklin funeral photo",
    "label": 1
  },
  {
    "title": "Black Americans are coming home to the GOP",
    "label": 1
  },
  {
    "title": "Americans are happier in states that spend more on libraries, parks and highways",
    "label": 0
  },
  {
    "title": "A Federal Court Just Ruled That Thousands of Eligible Voters in Georgia Must Be Allowed to Vote",
    "label": 0
  },
  {
    "title": "Happy Halloween!",
    "label": 1
  },
  {
    "title": "Ohio mayor who left Dem Party to back Trump goes down in humiliating electoral defeat",
    "label": 0
  },
  {
    "title": "Dan Crenshaw: I am not one to make hyperbolic statements. But what Senate Democrats have done is truly awful. This bill was negotiated in good faith. Been monitoring its progress all week. It can save our economy. And they killed it. Out of spite and bitterness. Hold Dems accountable.",
    "label": 1
  },
  {
    "title": "Biden / Obama 2020!",
    "label": 0
  },
  {
    "title": "Trump Is Falling Almost 1 Million Jobs Short Vs. Obama: The underlying economy is weaker than perceived. If the economy continues on this path it could enter a recession when few are forecasting one with one reliable indicator foreshadowing a downturn in the next 6 to 18 months.",
    "label": 0
  },
  {
    "title": "'If you ain't first, you're last.'",
    "label": 0
  },
  {
    "title": "But the left is so tolerant.",
    "label": 1
  },
  {
    "title": "New Survey Shows Young People Are Staying Liberal, Conservatives Are Dying Off",
    "label": 0
  },
  {
    "title": "Mark Hamill: 'I get a real sense of satisfaction that due to your Russian-backed election, you haven't had a single moment to enjoy your 'victory'. Not a day goes by w/out your paranoid panic over being exposed as the illegitimate fraud you are.' – Donald J. Trump: “@FoxNews Poll numbers plummet..”",
    "label": 0
  },
  {
    "title": "Something to Ponder",
    "label": 1
  },
  {
    "title": "The Enemy in the White House: Trump's latest lies are an open attack on the German government and the European Union. This U.S. president was never a partner. He is an aggressive opponent and should be treated as such.",
    "label": 0
  },
  {
    "title": "Calling Trump a 'Racist' -- Now a 2020 Dem Talking Point? | RealClearPolitics",
    "label": 1
  },
  {
    "title": "Ocasio-Cortez: Hurricane Maria response shows Puerto Ricans are 'treated like second-class citizens'",
    "label": 0
  },
  {
    "title": "Indict Hillary Clinton For Breaking Eight Federal Laws",
    "label": 1
  },
  {
    "title": "Open your eyes",
    "label": 0
  },
  {
    "title": "Ted Cruz Did A 15 Minute Interview With CNN - They Aired None Of It, Then Attacked Him For Not Coming On-Air",
    "label": 1
  },
  {
    "title": "Campaign to draft Democratic challenger to McConnell starts raising funds.",
    "label": 0
  },
  {
    "title": "Petition to rename street outside Trump Tower 'President Barack H. Obama Avenue' has over 125,000 signatures",
    "label": 0
  },
  {
    "title": "It’s Elizabeth Warren, people. She’s the Democrat nominee. Stay focused.",
    "label": 1
  },
  {
    "title": "Massachusetts judge who hid illegal alien from ICE faces 20 years in prison",
    "label": 1
  },
  {
    "title": "Elizabeth Warren, Kamala Harris accused of breaking fundraising rules over Kavanaugh vote",
    "label": 1
  },
  {
    "title": "It’s a party",
    "label": 1
  },
  {
    "title": "The only scenario where Nathan Phillips and the Covington school kids should be in the same room ever again is if it's in a courtroom",
    "label": 1
  },
  {
    "title": "Majority of House Democrats now support impeachment inquiry",
    "label": 0
  },
  {
    "title": "Sen. Chuck Schumer on Twitter: It was President Trump who single-handedly took away DACA and TPS protections in the first place—offering some protections back in exchange for the wall is not a compromise but more hostage taking.",
    "label": 0
  },
  {
    "title": "BREAKING: Israel Bans Ilhan Omar and Rashida Tlaib From Entering the Country Over BDS Support",
    "label": 1
  },
  {
    "title": "Liberals, no one is coming for your abortions! We just want common sense abortion control.",
    "label": 1
  },
  {
    "title": "Charles Blow tells CNN: ‘N-word tape’ would probably make Trump’s depraved fans love him more",
    "label": 0
  },
  {
    "title": "Aaaand Trump wins the South Carolina debate",
    "label": 1
  },
  {
    "title": "Kamala Harris on Twitter: 'Remember that this president is an unindicted co-conspirator in a felony criminal investigation and should not have the ability to appoint someone to a lifetime position on the Supreme Court. Kavanaugh's hearing should be delayed until the investigation is resolved.'",
    "label": 0
  },
  {
    "title": "Jewish leaders outraged by Trump saying Jews disloyal if they vote for Democrats",
    "label": 0
  },
  {
    "title": "Imagine if Trump was President during the Iran Hostage crisis...",
    "label": 0
  },
  {
    "title": "The future of the internet",
    "label": 1
  },
  {
    "title": "Bernie Trying To Decide Which House To Quarantine Himself In",
    "label": 1
  },
  {
    "title": "Donald Trump called asbestos poisoning a mob-led conspiracy, now his EPA won’t evaluate asbestos already in homes: The EPA will not consider the health risks of asbestos already in the environment Scott Pruitt quietly announced. Nearly 15,000 Americans die each year from asbestos-related diseases",
    "label": 0
  },
  {
    "title": "If guns were as dangerous as a woman’s uterus, maybe Congress would do something.",
    "label": 0
  },
  {
    "title": "Hickenlooper booed at California Dem convention for saying socialism isn't the answer",
    "label": 1
  },
  {
    "title": "GOP to retain Senate majority",
    "label": 1
  },
  {
    "title": "Treason of the Hour: Trump offered to stay quiet on Hong Kong protests if China went after Biden.",
    "label": 0
  },
  {
    "title": "Why communism/socialism doesnt work.",
    "label": 1
  },
  {
    "title": "When you hear about Melania using hyperbole how Barron has been violated. Remember here she is smiling with an orphaned baby whose parents were shot as a direct result of her husband's demagoguery",
    "label": 0
  },
  {
    "title": "5 facts gun control advocates hate",
    "label": 1
  },
  {
    "title": "Trump Admin Deploying Border Patrol to 10 Sanctuary Cities to Assist ICE",
    "label": 1
  },
  {
    "title": "Ironic that as McCain is fighting his toughest battle, it is the conservatives who are smearing his name.",
    "label": 0
  },
  {
    "title": "British PM Boris Johnson wants to replace Iran's nuclear deal with a 'Trump deal.'",
    "label": 1
  },
  {
    "title": "Barack Obama: Not everybody can stay home, and we owe a big debt of gratitude to health professionals, transit and airport workers, first responders, and everyone keeping our communities going. Leaders have to step up to support people whose lives and livelihoods take a hit in the weeks ahead.",
    "label": 0
  },
  {
    "title": "A woman Trump assaulted is running for office as a progressive Democrat in Ohio, and is now open to donations",
    "label": 0
  },
  {
    "title": "Not real",
    "label": 1
  },
  {
    "title": "It do be like that!",
    "label": 1
  },
  {
    "title": "BREAKING: Barr-Durham Investigation Is Now Officially a Criminal Investigation",
    "label": 1
  },
  {
    "title": "Woman Cancels Abortion Appointment After Learning Baby Has Heartbeat",
    "label": 1
  },
  {
    "title": "“I think of Communism when I think of Bernie.' 🔥🔥🔥",
    "label": 1
  },
  {
    "title": "Reasons to vote for a Democrat",
    "label": 1
  },
  {
    "title": "Actual footage of Bernie Sanders, after supporting a $15 minimum wage, when his staffers demanded $15/hour.",
    "label": 1
  },
  {
    "title": "Guests at Trump National Golf Club disco party get coronavirus",
    "label": 0
  },
  {
    "title": "Florida Airport Shut Down Over 'Suspicious Package' That Ended Up Being Provisional Ballots!",
    "label": 1
  },
  {
    "title": "Bernie Sanders Crowd Chants 'Lock Him Up' As Ilhan Omar Speaks, Media Oddly No Longer Concerned",
    "label": 1
  },
  {
    "title": "Not sure if all of you have seen this, it is horrible. Post-birth abortion?!?!?!? What the fuck has the world come to?!!?",
    "label": 1
  },
  {
    "title": "Some genius decided to use these CNN reporter's green coats as green screens",
    "label": 1
  },
  {
    "title": "These attacks on Thatcher are fascinating",
    "label": 1
  },
  {
    "title": "Speaking Truth To Democratics",
    "label": 1
  },
  {
    "title": "“I Am Disgusted”: Behind the Scenes of Trump’s Increasingly Scrutinized $107 Million Inauguration: Taped conversations reveal concerns with how money was being spent, the general chaos of the process, the involvement of the Trump family, and the people in charge, namely Rick Gates and Tom Barrack.",
    "label": 0
  },
  {
    "title": "John Cleese on Twitter: 'I see Trump is worried that his son might have to go and fight in Montenegro But surely he would have inherited bone spurs, wouldn't he ?'",
    "label": 0
  },
  {
    "title": "Attorney General William Barr's actions are 'remarkably not normal,' says legal historian",
    "label": 0
  },
  {
    "title": "Why 'Taxing the Rich' Always Ends Up Landing on the Middle Class Instead",
    "label": 1
  },
  {
    "title": "Is anyone else tired of going through Reddit and seeing that every post about US politics, is made to bash Trump?",
    "label": 1
  },
  {
    "title": "‘Impeachable’ and ‘illegal’ aren’t interchangeable -- In a groundbreaking announcement, the House Judiciary Committee opened a far-reaching investigation into President Trump and his associates. The scope of the investigation is enormous: Obstruction of Justice. Public Corruption. Abuses of Power.",
    "label": 0
  },
  {
    "title": "President Trump’s blaming the Democrats for Cabinet delays that are normal — and his own fault.",
    "label": 0
  },
  {
    "title": "We got em",
    "label": 1
  },
  {
    "title": "My Dad’s TV tonight!!!",
    "label": 1
  },
  {
    "title": "Daaaaaaam",
    "label": 1
  },
  {
    "title": "Coronavirus Response Shows Trump Isn’t a Dictator",
    "label": 1
  },
  {
    "title": "Republican donors who helped Trump lawyer Rudy Giuliani in Ukraine 'arrested over campaign finance violations'",
    "label": 0
  },
  {
    "title": "John Kerry Accuses GOP of ‘Supporting a Cover-Up’ for Trump on Ukraine Controversy: ‘Deeply Disturbing",
    "label": 0
  },
  {
    "title": "Mitch McConnell Leads the Pack in Race to Climb the Farthest Up Trump's Ass.",
    "label": 0
  },
  {
    "title": "Texas Republicans Are Lying About Voter Fraud to Justify a Massive, Racist Voter Purge.",
    "label": 0
  },
  {
    "title": "New FEC filings show Elon Musk is one of the biggest donors to Republicans",
    "label": 1
  },
  {
    "title": "Hillary Clinton: In the last 24 hours, the administration has announced: - They will seek the power to detain migrant children indefinitely - They won’t provide flu shots to families in detention Six children have already died, three in part from the flu. This is a recipe for more tragedy.",
    "label": 0
  },
  {
    "title": "So I looked up the definition of 'Brainwashed Idiot'.....",
    "label": 1
  },
  {
    "title": "The New York Times just doesn't report. They manipulate.",
    "label": 1
  },
  {
    "title": "Calif. Gov. Newsom Commutes Sentences of Two Child Killers, Nine Other Convicted Murderers",
    "label": 1
  },
  {
    "title": "Carson on Baltimore Controversy: ‘When You Hold People Responsible, They Don’t Like It, They Call You a Racist’",
    "label": 1
  },
  {
    "title": "Face it: The economy under Trump is great",
    "label": 1
  },
  {
    "title": "From one Democrat to another, PLEASE do your part in ensuring we don’t get four more years of Trump",
    "label": 0
  },
  {
    "title": "#Duh",
    "label": 0
  },
  {
    "title": "Never in my 12 years in the Navy did we ever pull back when civilians were being slaughtered. What we always did, before a coward became Pres, was to have them point us to where the bad guys are while they head to the rear - so we can KICK SOME ASS. WTMF?",
    "label": 0
  },
  {
    "title": "Jonathan Van Ness: 'What kind of piece of shit speaks ill of a veteran war hero 7 months after his death? All while saying he’s not at fault for the rise in white terrorism as he defends Carlson & Pirro who are blatantly racist and Islamophobic. You are as vile as you are orange @realDonaldTrump'",
    "label": 0
  },
  {
    "title": "But but but they had a permit.",
    "label": 0
  },
  {
    "title": "Sanders, AOC and other socialists are wrong – Socialism is a cause of poverty, not the cure",
    "label": 1
  },
  {
    "title": "Poll: Americans Don't Trust What They're Hearing From Trump On Coronavirus",
    "label": 0
  },
  {
    "title": "Hillary Clinton: Richard Nixon once made this argument: 'When the president does it, that means that it is not illegal.' He was forced to resign in disgrace. In America, no one is above the law.",
    "label": 0
  },
  {
    "title": "Border wall gofundme donations nearing 11 million dollars",
    "label": 1
  },
  {
    "title": "WaPo Calls for End to Live Broadcasts of Trump's Daily Chinese Virus Briefings as Approval Ratings Soar",
    "label": 1
  },
  {
    "title": "McConnell Says GOP Doesn’t Have Votes to Block Impeachment Witnesses",
    "label": 0
  },
  {
    "title": "The Swamp",
    "label": 1
  },
  {
    "title": "Golf Kept Trump From Focusing On COVID-19, Not Impeachment",
    "label": 0
  },
  {
    "title": "Hillary Clinton: Like I said: A puppet.",
    "label": 0
  },
  {
    "title": "Mark Zuckerberg Tells Employees Elizabeth Warren’s Presidency Would “Suck”",
    "label": 1
  },
  {
    "title": "ShickenChit.",
    "label": 0
  },
  {
    "title": "Leaked Video: Google Admits to Importing 10K Foreign Workers to Take U.S. Jobs",
    "label": 1
  },
  {
    "title": "Joe Biden bragging about firing prosecutor...",
    "label": 1
  },
  {
    "title": "Head of birth organization canned for saying only women give birth",
    "label": 1
  },
  {
    "title": "They can be beaten.",
    "label": 0
  },
  {
    "title": "Muslim Brotherhood Labeled Terrorists: Call the Enemy by its Name",
    "label": 1
  },
  {
    "title": "Charles M. Blow on Twitter: 'Let this sink in: There are tanks in the nation’s capital and concentration camps at its border. The drift to toward the unimaginable is unmistakable.'",
    "label": 0
  },
  {
    "title": "Equality means women lie too: Kavanaugh accuser fabricated fake rape “to get attention.”",
    "label": 1
  },
  {
    "title": "“It Looks Bad. It Smells Bad. It Is Bad”: Democrats Are Digging into Kushner’s Cozy Relationship with M.B.S.",
    "label": 0
  },
  {
    "title": "This is Bernie. This is Nancy. This is Mitch.",
    "label": 0
  },
  {
    "title": "Biker Woman Pulls Out Gun and Shoots Road-Raging Man Dead After He Beat Her Almost Unconscious",
    "label": 1
  },
  {
    "title": "Mitch McConnell thinks it was a “mistake” that voters did not elect accused child molester Roy Moore: It is worth noting that McConnell is likely to blame for Moore winning the GOP Senate nomination in Alabama",
    "label": 0
  },
  {
    "title": "Media Uninterested in First Korean Woman in Congress... Because She's Republican",
    "label": 1
  },
  {
    "title": "Posted an article about a girl being removed from class for wearing a Romney shirt. Teacher likened it to wearing a KKK shirt. r/news rejects the post for being 'political'",
    "label": 1
  },
  {
    "title": "CNN should have their press credentials revoked. They have become World Weekly News 2.0",
    "label": 1
  },
  {
    "title": "New poll shows Trump is the only U.S. president to never reach 50% approval: A Monmouth poll puts Trump's approval rating at 41 percent, making him the only U.S. leader to never hit 50% approval. The same survey shows 59% say he should not be re-elected.",
    "label": 0
  },
  {
    "title": "The U.S. Will Finally Designate the Muslim Brotherhood a Terrorist Group on Trump's Watch",
    "label": 1
  },
  {
    "title": "Brandon Tatum: You made the choice in the bedroom, not the clinic!",
    "label": 1
  },
  {
    "title": "Poll: Barack Obama Was the Greatest President of Our Lifetime",
    "label": 0
  },
  {
    "title": "President Trump says he’s reducing Central American aid over migrants",
    "label": 1
  },
  {
    "title": "Adam Schiff should be forced to take oath before every hearing",
    "label": 1
  },
  {
    "title": "Hmmmm",
    "label": 1
  },
  {
    "title": "Hillary Clinton Admits Europe Needs To End Mass Immigration... Thanks Capt.Obvious",
    "label": 1
  },
  {
    "title": "Trump approval at 51%, winning millennials, trusted more than Democrats on economy",
    "label": 1
  },
  {
    "title": "Study suggests Coronavirus cases could have been reduced by 95% had China responded to the outbreak 3 weeks earlier",
    "label": 1
  },
  {
    "title": "Poll: Majority of Americans now disapprove of federal coronavirus efforts, Trump's handling of crisis",
    "label": 0
  },
  {
    "title": "Man who tweeted 'Covfefe' and 'Hamburders' questions Joe Biden's mental ability",
    "label": 0
  },
  {
    "title": "Jim Acosta caught on Hot Mic admitting to intentionally disrupting Trump-Kim Summit because he felt left out",
    "label": 1
  },
  {
    "title": "Chris Hayes: Trump Is ‘First and Foremost a Fox News Viewer’ Who Has Brought ‘Delusional Madness’ to WH",
    "label": 0
  },
  {
    "title": "So much hate.",
    "label": 1
  },
  {
    "title": "Joe Biden Promises to 'Cure Cancer' if Elected President",
    "label": 1
  },
  {
    "title": "Sacramento Newspaper Slams Kamala Harris for Denying Knowledge of Harassment Lawsuit Against Top Aide",
    "label": 1
  },
  {
    "title": "AOC tweets 'But his WhatsApp' at Kushner news. Hillary Clinton responds, 'Tell me about it'",
    "label": 0
  },
  {
    "title": "Korean War to be declared officially over after 65 years, following historic summit between North and South",
    "label": 1
  },
  {
    "title": "Department of Homeland Security.",
    "label": 0
  },
  {
    "title": "Washington Post Calls for Trump to Fight Anti-Semitism a Week After They Trashed Him for Fighting Anti-Semtisim",
    "label": 1
  },
  {
    "title": "Adam Schiff: 'If the President wanted to know what happened, which was self-reported by the NSA, he could ask. Instead he watches TV and tweets nonsense, as if he’s a Fox pundit, and not head of the Executive Branch. Another day. Another false claim. Wake up, GOP. Silence is complicity.'",
    "label": 0
  },
  {
    "title": "Democrats Wrote to Ukraine in May 2018, Demanding It Investigate Trump",
    "label": 1
  },
  {
    "title": "Shameful.",
    "label": 0
  },
  {
    "title": "The impeachment process is not about undoing the results of 2016. It’s about protecting the integrity of 2020.",
    "label": 0
  },
  {
    "title": "Half of active-duty service members are unhappy with Trump, new Military Times poll shows",
    "label": 0
  },
  {
    "title": "Republicans are uncomfortable defending Trump? Good. They should be. -- They made a bet that they could get through four years with their own reputations intact. His reckoning is theirs. It was inevitable, and they deserve to pay every ounce of the price.",
    "label": 0
  },
  {
    "title": "Joe Biden on Twitter: Donald Trump is the most corrupt president in modern American history.",
    "label": 0
  },
  {
    "title": "We all know its true",
    "label": 1
  },
  {
    "title": "Did They Forget CNN was Caught Feeding Hillary Debate Questions? Is That Also an Inappropriate Relationship?",
    "label": 1
  },
  {
    "title": "3 branches of government",
    "label": 0
  },
  {
    "title": "Trump Administration Considering Opening Obamacare Enrollment Amid Pandemic - As the administration backs a court fight to kill the Affordable Care Act, officials suddenly realize Americans need health insurance now.",
    "label": 0
  },
  {
    "title": "The Knives Are Out for Steve Bannon: Wall Street Journal Slams Trump Adviser in Scalding Editorial. Joe Scarborough has called him 'the most villainous historical figure this side of Stalin or Hitler.'",
    "label": 0
  },
  {
    "title": "Angry Baltimore Resident Says 'Trump Is NOT Racist- Cummings Has Done Nothing For Us'",
    "label": 1
  },
  {
    "title": "Home Depot Co-Founder Bernie Marcus Vows to Donate Most of His Billions to Charity, and Help Re-Elect Trump",
    "label": 1
  },
  {
    "title": "Barbara Bush Blamed Trump For Heart Attack, Said She’s No Longer Republican",
    "label": 0
  },
  {
    "title": "Republican voters don't see racism, sexism, climate change or gun violence as big problems in the U.S.",
    "label": 0
  },
  {
    "title": "Remember when the left cheered for shitting on choice?",
    "label": 1
  },
  {
    "title": "Hillary Clinton: Seriously, you asked Russia to hack me on national television.",
    "label": 0
  },
  {
    "title": "Joaquin Castro Is Begging For Lunatics To Attack Trump Supporters In His District",
    "label": 1
  },
  {
    "title": "Muslims Are Safer In The United States Than In Muslim Countries -",
    "label": 1
  },
  {
    "title": "Barack Obama: We owe a profound debt of gratitude to all our health professionals and everybody who’ll be on the front lines of this pandemic for a long while. They’re giving everything. May we all model our own behavior on their selflessness and sacrifice as we help each other through this.",
    "label": 0
  },
  {
    "title": "Impeachment trial should remove any lingering doubt: Republicans are beyond redemption",
    "label": 0
  },
  {
    "title": "Msnbc once again promoting nutty conspiracy theories about Trump. Claim he is sending subliminal “white supremacist” brain waves to followers. In other news, Malcolm Nance is crazy.",
    "label": 1
  },
  {
    "title": "Supreme Court Rules: Trump Can Use Military Funds for Border Wall construction",
    "label": 1
  },
  {
    "title": "Pray for Trump",
    "label": 0
  },
  {
    "title": "Fox News' Shep Smith and Andrew Napolitano now see proof of 'collusion' between Trump's team and Russia",
    "label": 0
  },
  {
    "title": "Donald Trump’s Plan to Replace Obamacare Does Not Exist",
    "label": 0
  },
  {
    "title": "Liberal Women's March founded by people who think 'Jewish people bore a special collective responsibility as exploiters of black and brown people'. WHO KNEW THERE WERE ANTISEMETIC LIBERALS? 🤦🏻‍♂️",
    "label": 1
  },
  {
    "title": "What could go wrong",
    "label": 1
  },
  {
    "title": "Roy Moore Banned From Mall After Locals Were Troubled by His Interactions with Teen Girls",
    "label": 0
  },
  {
    "title": "Feels very appropriate.",
    "label": 0
  },
  {
    "title": "Please stop running for President. Please help us win back the Senate.",
    "label": 0
  },
  {
    "title": "Logic...",
    "label": 1
  },
  {
    "title": "Trump didn’t drain the swamp. Supporters are starting to notice. -- Trump’s presidency is government by a team of smash-and-grab thieves, intent on gaining as much money and advantage as they can while they retain access to the levers of power",
    "label": 0
  },
  {
    "title": "60 percent of Americans approve of Trump’s handling of coronavirus: Gallup poll",
    "label": 1
  },
  {
    "title": "A political cartoon: GOP strategy - distract their voters",
    "label": 0
  },
  {
    "title": "Obama’s track record is not impressive at all.",
    "label": 0
  },
  {
    "title": "Mass Shootings Aren't Becoming More Common–and Evidence Contradicts Stereotypes about the Shooters",
    "label": 1
  },
  {
    "title": "Allen West: US Increasingly Moving Away from Rule of Law, Toward Mob Rule",
    "label": 1
  },
  {
    "title": "White Nationalists KICKED OUT of Louisville Rally by TRUMP SUPPORTERS and PROUD BOYS (VIDEO)",
    "label": 1
  },
  {
    "title": "Iranian Protesters, Upset With Being Dismissed by Pelosi, Launch Hashtag #NancyPelosiFakeNews",
    "label": 1
  },
  {
    "title": "We’re all saying it now",
    "label": 0
  },
  {
    "title": "Massachusetts Republican beats trans driver’s license bill by forcing votes on all 73 genders",
    "label": 1
  },
  {
    "title": "Lieu thanks Trump for visiting Michigan: Your ‘toxic rallies’ energize Dems.",
    "label": 0
  },
  {
    "title": "COVID Confirms It: Dems Don’t Understand Economics",
    "label": 1
  },
  {
    "title": "Trump rages over poll numbers and coverage of his racism after ratings plummet",
    "label": 0
  },
  {
    "title": "Adam Schiff: 'It happened again. Trump insulted the press, egging on the frenzied crowd, and someone took it as license to assault a cameraman. Journalists take risks to cover the news every day. They shouldn't have to risk their safety to cover the President of the United States of America.'",
    "label": 0
  },
  {
    "title": "White House admits in court filing that it hasn’t found any voter fraud in 2016 election - 'This is awkward'",
    "label": 0
  },
  {
    "title": "Republican Party official quits in disgust over Trump's impeachment trial, says local GOP Is 'propaganda shill' for president",
    "label": 0
  },
  {
    "title": "Signs of the Times",
    "label": 1
  },
  {
    "title": "Planned parenthood to spend 45 million on Democrats. In other words they are going to spend the money they get from taxpayers to influence the election in a partisan manner. (How is this legal?)",
    "label": 1
  },
  {
    "title": "Scholars Poll Ranks Donald Trump As 'Worst President Of All-Time'",
    "label": 0
  },
  {
    "title": "''Very liberal' students are nearly four times more likely than moderate and conservative students to favor prohibiting some types of speech.'",
    "label": 1
  },
  {
    "title": "Kavanaugh accused of more unwanted sexual contact by former classmate: report",
    "label": 0
  },
  {
    "title": "This is glorious",
    "label": 1
  },
  {
    "title": "Obama 'Crashes' Chicago Food Bank To Help Out For Thanksgiving; President Donald Trump, meanwhile, flew to his private Mar-a-Lago resort in Palm Beach, Florida.",
    "label": 0
  },
  {
    "title": "Amy Klobuchar: Here's your Friday reminder that if the GA Secretary of State hadn’t been allowed to hold back 53,000 voter registrations, Stacey Abrams would be the Governor of Georgia right now. We have to stop the discrimination at the ballot box and restore the Voting Rights Act!",
    "label": 0
  },
  {
    "title": "Mike Pence, who enabled an HIV outbreak in Indiana, will lead US coronavirus response",
    "label": 0
  },
  {
    "title": "Federal Law Says 'Go Back To Where You Came From' Counts As Discrimination",
    "label": 0
  },
  {
    "title": "POLL: Trump Gets 7-Point Swing After Impeachment Inquiry, Dominates With Independents",
    "label": 1
  },
  {
    "title": "‘THIS IS AMERICA’: Deafening Cheers Break Out For Trump At National Championship Game",
    "label": 1
  },
  {
    "title": "Shock Fox News Poll: 56 Percent of Americans Blame Trump Rhetoric for Mass Shootings",
    "label": 0
  },
  {
    "title": "Mitch McConnell is the problem.",
    "label": 0
  },
  {
    "title": "The new NRA badge of shame. I designed this to be shared.",
    "label": 0
  },
  {
    "title": "Chuck Schumer on Twitter: 'Are we executing Putin’s diplomatic and national security strategy or AMERICA’s diplomatic and national security strategy? After the last few days, it’s hard to tell.'",
    "label": 0
  },
  {
    "title": "Elizabeth Warren just introduced a bill that would defund Trump’s border wall and direct the money toward the coronavirus response in the U.S.",
    "label": 0
  },
  {
    "title": "Britain's Labour Party Got Woke—And Now It's Broke",
    "label": 1
  },
  {
    "title": "Bitch",
    "label": 1
  },
  {
    "title": "Nolte: NBC News Hid Information that Would've Helped Clear Kavanaugh",
    "label": 1
  },
  {
    "title": "Hmmm... and they call Republicans fascist..",
    "label": 1
  },
  {
    "title": "Southfield city clerk charged with 6 felonies tied to November 2018 election",
    "label": 1
  },
  {
    "title": "I never saw this news on r/Politics and I browse it everyday",
    "label": 1
  },
  {
    "title": "Trump campaign and RNC raise more than $100 million during impeachment",
    "label": 1
  },
  {
    "title": "Trump’s Unexpected Jobs Boom Leaves Dems Incoherent",
    "label": 1
  },
  {
    "title": "New Mexico governor orders withdrawal of National Guard border troops, citing no 'national security crisis'",
    "label": 0
  },
  {
    "title": "Donald Trump’s deputy chief of staff was working to arrange Vladimir Putin meeting during campaign: report - Yet another person with ties to the Trump campaign can be considered part of the Russia investigation",
    "label": 0
  },
  {
    "title": "NOAA staff warned in Sept. 1 directive against contradicting Trump: “This is the first time I’ve felt pressure from above to not say what truly is the forecast.” “It makes me speechless that the leadership would put [Trump’s] feelings and ego ahead of putting out weather information accurately.”",
    "label": 0
  },
  {
    "title": "Thirty-seven years after leaving office, Jimmy Carter, 93, still bypasses the wealth and perks that flow so freely to other former presidents. White evangelicals hate this Christian who lives like Jesus and follow a lying pervert as he demolishes American democracy.",
    "label": 0
  },
  {
    "title": "Uncensored Truth",
    "label": 1
  },
  {
    "title": "Bloomberg should buy fox news not run for president",
    "label": 0
  },
  {
    "title": "Ted Cruz & Beto O'Rourke debate tonight at 6 p.m. Central - U.S. Sen. Ted Cruz, R-Texas & Democratic opponent Beto O'Rourke will hold their 1st debate tonight at Southern Methodist University in Dallas.",
    "label": 0
  },
  {
    "title": "Republican users flooding social media with fake Democrat memes supporting Voter ID laws.",
    "label": 0
  },
  {
    "title": "Nancy Pelosi: The President must immediately use the powers of the Defense Production Act to mass produce and coordinate distribution of critical medical supplies & personal protective equipment. There is not a day to lose. #FamiliesFirst",
    "label": 0
  },
  {
    "title": "Texas Senate passes bill to protect infants born alive during abortion",
    "label": 1
  },
  {
    "title": "Brian O'Sullivan on Twitter: 'Call me crazy, but... If Trump tried to use the Ukraine to get to Biden, maybe, just maybe, he did the same fucking thing with Hillary and Russia.'",
    "label": 0
  },
  {
    "title": "Ilhan Omar: I’m ‘Outraged’ Trump Killed Iranian Terrorist Who Killed Hundreds Of Americans",
    "label": 1
  },
  {
    "title": "Federal judge blocks Kentucky's new 'fetal heartbeart' abortion law",
    "label": 0
  },
  {
    "title": "I laughed so hard while watching this😂",
    "label": 1
  },
  {
    "title": "Justice: Antifa Thug Who Busted a Man's Head Open Gets Nearly 6 Years in Prison",
    "label": 1
  },
  {
    "title": "Got to see Beto speak yesterday morning in Amarillo! Incredible!",
    "label": 0
  },
  {
    "title": "High School student denied spot in the National Honors Society because of his support for President Trump -- 'Character Flaw'",
    "label": 1
  },
  {
    "title": "Trump mocks Senator Feinstein following reports an alleged Chinese spy worked for her -- 5 years ago, the FBI informed her that her driver might be a spy for China, and she fired him. Meanwhile, 40% of Trump's original foreign policy advisors are suspected of spying for Russia. Literally 40%.",
    "label": 0
  },
  {
    "title": "The Dayton Shooter Was a Satanist, Leftist-Socialist, and Bernie/Warren Fan, Supported Antifa",
    "label": 1
  },
  {
    "title": "The Republican-Fox News plot to have Mueller fired is gathering steam",
    "label": 0
  },
  {
    "title": "'We Are Not Mindless NPCs,' Chant Nation's Liberals In Perfect Unison",
    "label": 1
  },
  {
    "title": "NOTHING MATTERS: CNN hires Florida Dem who is under investigation for violating ethics laws",
    "label": 1
  },
  {
    "title": "Yale professor warns time running out for Americans to stop Trump dictatorship.",
    "label": 0
  },
  {
    "title": "Joe Biden on Twitter: Let me be very clear: No one is expendable. No matter your age, race, gender, religion, ethnicity, sexual orientation, or disability. No life is worth losing to add one more point to the Dow.",
    "label": 0
  },
  {
    "title": "Ukrainian to US prosecutors: Why don't you want our evidence on Democrats?",
    "label": 1
  },
  {
    "title": "George H. W. Bush Receives Huge Ovation Before Super Bowl Coin Toss",
    "label": 1
  },
  {
    "title": "GOP Accused of 'Greatest Cover-Up Since Watergate' as Senate Set to End First Witness-Less Impeachment Trial in US History",
    "label": 0
  },
  {
    "title": "What Diane Feinstein really is like.",
    "label": 1
  },
  {
    "title": "Barr and Ted Cruz laugh at Democrats absurd grandstanding",
    "label": 1
  },
  {
    "title": "Time for a Tax on Billionaire Wealth Dynasties",
    "label": 0
  },
  {
    "title": "The Florida man who raised over $22 million on GoFundMe in the “We The People Will Build the Wall” campaign diverted the money to pay for a ‘million dollar’ yacht and high-flying lifestyle",
    "label": 0
  },
  {
    "title": "Happy thanksgiving everyone! But let us remember a true hero of what the Democratic Party stands for today. R.I.P, President John Fitzgerald Kennedy.",
    "label": 0
  },
  {
    "title": "GOP Senator Puts Nancy Pelosi on Notice; No Articles by Monday, He Will Introduce Measure to Dismiss",
    "label": 1
  },
  {
    "title": "Donald Trump is losing Cabinet officials at a record rate",
    "label": 0
  },
  {
    "title": "Trump Howls That Bolton's Quid Pro Quo Allegation Isn’t True. But Parnas' Lawyer Says He Has More Video And Audio",
    "label": 0
  },
  {
    "title": "Elizabeth Warren confronted by Iowa dad over student loan plan, saying people paying for tuition would get 'screwed'",
    "label": 1
  },
  {
    "title": "Mitch McConnell faces backlash for ‘urgent’ coronavirus tweet during 3-day recess",
    "label": 0
  },
  {
    "title": "Kushner family business under investigation by Maryland AG for jailing tenants to collect debts",
    "label": 0
  },
  {
    "title": "New door-to-door survey finds AOC disliked, distrusted, unwanted in her own district",
    "label": 1
  },
  {
    "title": "Nope.",
    "label": 1
  },
  {
    "title": "Nancy Pelosi: 'Mexico said NO. Voters said NO. Congress – armed with the exclusive constitutional power of the purse – said NO. Trump is trashing our Constitution by abusing his executive power with #FakeTrumpEmergency. This is a naked power grab that “didn’t need” to happen. It won’t work.'",
    "label": 0
  },
  {
    "title": "Happy president’s day y’all. Here’s to four more. Sorry for the quality I didn’t had a good phone back in 2016.",
    "label": 1
  },
  {
    "title": "NADA.",
    "label": 0
  },
  {
    "title": "Babylon Bee war with snopes in full effect. They are winning.",
    "label": 1
  },
  {
    "title": "Like a Boss",
    "label": 0
  },
  {
    "title": "Wisconsin Democratic governor says he'll veto Republican bills aimed at restricting abortion",
    "label": 0
  },
  {
    "title": "The Real Story of Unemployment over the Last Decade.",
    "label": 0
  },
  {
    "title": "Trump was like a 'predator' toward teens at parties in ‘80s and ‘90s, says BBC report",
    "label": 0
  },
  {
    "title": "Trump Rejects Expanded Background Check Gun Control, Calls for Mental Health Reform",
    "label": 1
  },
  {
    "title": "It's Dead, Jim...",
    "label": 1
  },
  {
    "title": "Minnesota Democratic Ilhan Omar is facing backlash after describing the September 11, 2001 terror attacks as “some people did something.”",
    "label": 1
  },
  {
    "title": "'Reagan took the deficit from $70 billion to $175 billion. Bush 41 took it to $300 billion. Clinton got it to zero. Bush 43 took it from zero to $1.2 trillion. Obama halved it to $600 billion. Trump’s got it back to a trillion.' — Tweets on Tuesday, July 23rd, 2019 in a tweet",
    "label": 0
  },
  {
    "title": "Don't compromise.",
    "label": 0
  },
  {
    "title": "Terror suspect caught sneaking into U.S. roils immigration debate",
    "label": 1
  },
  {
    "title": "McConnell Received $3.5M In Campaign Donations From Russian Oligarch-Linked Firm",
    "label": 0
  },
  {
    "title": "'Trump's base is small town/rural people over the age of 65, the exact demographic that is most at risk of dying from COVID-19.' An article about how Trump voters will be the hardest hit by the coronavirus and why might this might be the scandal that stops his re-election.",
    "label": 0
  },
  {
    "title": "‘Worst start of any Presidency in history’: Dan Rather says Trump is a disaster without precedent, as he has faced both significant legal and legislative defeats, and has also been dogged by constant scandals and controversies.",
    "label": 0
  },
  {
    "title": "The Far-Left Lost an 'Unlosable' National Election in Australia Last Night and It's Glorious",
    "label": 1
  },
  {
    "title": "Oh boy. When Ben hits he hits hard",
    "label": 1
  },
  {
    "title": "Cheri Jacobus: 'You marked rental applications with a 'C' for 'colored' to deny them apartments. DoJ sued you for racial discrimination twice. You settled twice. You refused to denounce the KKK. You tweeted fake black crime stats from a white supremacist site. SIT DOWN!' - Donald J. Trump: 'Afri...'",
    "label": 0
  },
  {
    "title": "American Disasters.",
    "label": 0
  },
  {
    "title": "Stop Comparing Political Rivals to Nazis",
    "label": 1
  },
  {
    "title": "President Trump Approval Rating Hits Record High in New Poll",
    "label": 1
  },
  {
    "title": "Russia! Racist! Recession!",
    "label": 1
  },
  {
    "title": "Obama pens note to inmate he granted clemency who made dean's list: 'I'm so proud of you'",
    "label": 0
  },
  {
    "title": "David Frum: 'If Trump now reopens Govt, he visibly surrenders to Pelosi. If Trump keeps Govt closed, he bleeds support faster. Workers miss next paycheck, air travel delays, govt services fail, and economy stalls. Trump built the trap and walked into it. Pelosi just locked it behind him.'",
    "label": 0
  },
  {
    "title": "Maryland Republican Gov. Larry Hogan used a focus group of 110 women who “despise” President Trump to try and gauge female voters in the heavily Democratic state — and his plan succeeded",
    "label": 1
  },
  {
    "title": "Trump Will Require All EPA Science to Be Screened by Political Staffers - Reminder: This is the guy who thinks climate change is a Chinese hoax.",
    "label": 0
  },
  {
    "title": "Who should the Oscar go to?",
    "label": 1
  },
  {
    "title": "Trump apparently didn't read Mattis' resignation letter until cable news made a big deal of it",
    "label": 0
  },
  {
    "title": "MSNBC to Air Obama’s 2004 Convention Speech During Trump’s Address to Nation",
    "label": 0
  },
  {
    "title": "Dems Worried If Impeachment Fails They'll Have To Nominate Electable Candidate",
    "label": 1
  },
  {
    "title": "Bernie HQ in Lowell, MA is requiring everyone who simply walks into their office to sign an NDA.",
    "label": 1
  },
  {
    "title": "Michelle Obama: Hillary Clinton was better than Donald Trump",
    "label": 0
  },
  {
    "title": "Trump’s El Paso Photo Is Obscene -- The president’s callousness has reached a new low: smiling, flashing a thumbs-up next to an orphaned infant. It is one of the most twisted things I have seen in a long time.",
    "label": 0
  },
  {
    "title": "Adam Schiff: 'The Constitution grants Congress the power of the purse, and the President is now attempting to take that power to himself. If the GOP fails to stand up to Trump's unconstitutional act, we will have moved dangerously from a separation of powers, to a mere separation of parties.'",
    "label": 0
  },
  {
    "title": "Wall of racists",
    "label": 0
  },
  {
    "title": "How about some career politician tax returns 🤔",
    "label": 1
  },
  {
    "title": "Stephen Miller is no outlier. White supremacy rules the Republican party",
    "label": 0
  },
  {
    "title": "He’s back",
    "label": 1
  },
  {
    "title": "‘Everything Is Connected’: Ukrainian Gas Company’s CEO Willing to Testify Against Rudy Giuliani",
    "label": 0
  },
  {
    "title": "After watching my wife come home from a shift at the hospital, I can't imagine any healthcare workers voting for Trump. Those who are living through the healthcare part of this know what I am talking about.",
    "label": 0
  },
  {
    "title": "Trump bars California from setting stricter fuel standards",
    "label": 1
  },
  {
    "title": "McConnell Challenger Amy McGrath (D) Raises Record $2.5 Million on First Day of ‘Ditch Mitch’ Campaign",
    "label": 0
  },
  {
    "title": "Fed study: Trump tariffs backfired, caused job losses and higher prices",
    "label": 0
  },
  {
    "title": "Black Professor Calls Trump ‘First Black President’; CNN Contributor Responds: ‘Uncle Toms’",
    "label": 1
  },
  {
    "title": "Jon Cooper on Twitter: 'A question for Trump voters ONLY: How can you continue to support someone who just admitted to a court that he looted nearly $3 million from a charity that was supposed to help veterans?'",
    "label": 0
  },
  {
    "title": "As a rabbi, I agree with AOC: Trump is running concentration camps",
    "label": 0
  },
  {
    "title": "Real political humor.",
    "label": 1
  },
  {
    "title": "Next level TDS",
    "label": 1
  },
  {
    "title": "I voted for Trump",
    "label": 0
  },
  {
    "title": "This Memorial Day, let's not forget the original Antifa.",
    "label": 0
  },
  {
    "title": "The Trump Administration's 'Orwellian Unholy Trinity.'",
    "label": 0
  },
  {
    "title": "George Bush, 41st President, Dies at 94",
    "label": 1
  },
  {
    "title": "Dunkin Donuts Refuses to Get Woke: ‘We Are Not Starbucks’",
    "label": 1
  },
  {
    "title": "Orange Standards.",
    "label": 0
  },
  {
    "title": "By taking decisive action against Soleimani, Trump showed that Iran’s power is an illusion generated by D.C.’s willingness to look the other way",
    "label": 1
  },
  {
    "title": "Trump was not 'democratically elected' - he lost by 2.9 million votes. He was 'constitutionally elected,' by an 18th century constitutional design that includes a ban on foreign bribes to the president and that offers impeachment and removal as a remedy for bribe-seeking",
    "label": 0
  },
  {
    "title": "Safety nets are for people who *can't*, not people who *won't*.",
    "label": 1
  },
  {
    "title": "Lindsey Graham to take DNA test to find Native American roots: 'I think I can beat' Elizabeth Warren",
    "label": 1
  },
  {
    "title": "I'm running for Senate as a Republican. My Democrat parents are so furious they're backing my opponent",
    "label": 1
  },
  {
    "title": "Ted Cruz Rips Democrats For Using Coronavirus Bill To Push Liberal Agenda",
    "label": 1
  },
  {
    "title": "Why Mueller didn’t indict Donald Trump Jr. is a 'mystery' given 'montage of evidence against him': Democratic senator",
    "label": 0
  },
  {
    "title": "Everyone Else...",
    "label": 1
  },
  {
    "title": "And just like that... I have a new favorite quote",
    "label": 0
  },
  {
    "title": "Christopher Wylie 🏳️‍🌈: 'Whatever this report says, here’s what I know: when I was at Cambridge Analytica, the company hired known Russian agents, had data researchers in St Petersburg, tested US voter opinion on Putin’s leadership, and hired hackers from Russia - all while Bannon was in charge.'",
    "label": 0
  },
  {
    "title": "As pro-abortion lawmakers walk out, Alabama House votes to ban nearly all abortions",
    "label": 1
  },
  {
    "title": "Time for a Fact Check.",
    "label": 0
  },
  {
    "title": "Rick Wilson: 'Parse this for a moment, Americans. The President *knows* the Russians interfered in our election on his behalf. He consistently, endlessly lies to his base about this fact. He and his allies obstruct justice to prevent investigation into this interference. It's the t-word.'",
    "label": 0
  },
  {
    "title": "Hillary Clinton: Yesterday was the court-ordered deadline for the administration to reunite families it has separated at the border, but more than 700 children are not yet back with their parents. Let’s keep making our voices heard until every single family is reunited.",
    "label": 0
  },
  {
    "title": "Why Obama got a Nobel Peace Prize for nothing — and Trump never will for anything",
    "label": 1
  },
  {
    "title": "TIL the creators of South Park are republican",
    "label": 1
  },
  {
    "title": "Lindsey Graham Is the Saddest Story in Washington: His fight for Brett Kavanaugh completed his transformation into Donald Trump’s slobbering manservant.",
    "label": 0
  },
  {
    "title": "Kyle Griffin on Twitter: 'Eric Swalwell on CNN: '[Putin] shouldn't be in our country. Frankly, he attacked our country. Most Americans, when they have their home broken into, they upgrade their security system. They don't invite the burglar for dinner.''",
    "label": 0
  },
  {
    "title": "UPDATE: Abortion activist pleads guilty to assaulting pro-life student",
    "label": 1
  },
  {
    "title": "Don’t Be Naive: Avoiding Calling Trump Supporters Racist Won’t Convince Them to Vote for Democrats",
    "label": 0
  },
  {
    "title": "THIS",
    "label": 1
  },
  {
    "title": "‘Serving under Trump is embarrassing’: Fifth Republican congressman retires in just two weeks as GOP fears more exits.",
    "label": 0
  },
  {
    "title": "Trump illegally asked Russia to help him win in 2016. He shouldn't get away with it. -- Trump's public request for Russian help in finding Hillary Clinton’s emails was a violation of US law. There are ways to hold him accountable.",
    "label": 0
  },
  {
    "title": "Giuliani associate Parnas threatens to release photo every time Trump denies knowing him",
    "label": 0
  },
  {
    "title": "Anyone else annoyed with the “Impeach Donald Trump” YouTube ads?",
    "label": 1
  },
  {
    "title": "“Never again means close the camps”: Jews protest ICE across the country.",
    "label": 0
  },
  {
    "title": "Joe Biden Tells Bizarre Story About How He Once Faced Down A Gang Leader Named “Corn Pop” (VIDEO)",
    "label": 1
  },
  {
    "title": "Trump signs executive order pushing work requirements for welfare recipients",
    "label": 1
  },
  {
    "title": "Men are more disadvantaged than women in the UK, US and most of Europe, scientists claim",
    "label": 1
  },
  {
    "title": "Poll: 60 percent say Trump bears responsibility for shutdown",
    "label": 0
  },
  {
    "title": "Good Ol AntiFA !!!...LeftWing AssHoles ... Harassing Seniors ...",
    "label": 1
  },
  {
    "title": "imagine that",
    "label": 1
  },
  {
    "title": "Man Accused Of Doxxing GOP Senators Allegedly Threatened To Also Dox Their Children",
    "label": 1
  },
  {
    "title": "The FBI Find an Islamic Terrorist Training Camp in Alabama. If It's There, It's Everywhere. What's the Answer?",
    "label": 1
  },
  {
    "title": "Matthew Miller on Twitter: 'If Trump was running his charity as a sprawling, multi-year criminal enterprise, perhaps that’s a small clue about how he ran his business, his campaign, and now the country.'",
    "label": 0
  },
  {
    "title": "Happy Birthday to “The Nature Boy”, fellow Republican and Great American, Ric Flair!! Whooo!",
    "label": 1
  },
  {
    "title": "True fact",
    "label": 1
  },
  {
    "title": "Dan Bishop Wins in North Carolina",
    "label": 1
  },
  {
    "title": "Doctor Fired for Refusing to Do Abortions Wins Major Court Case",
    "label": 1
  },
  {
    "title": "Keeping things in perspective.",
    "label": 0
  },
  {
    "title": "Lindsey Graham promises investigation into whether Mueller investigation was created to spy on Trump",
    "label": 1
  },
  {
    "title": "Democrats Funded a 287 Mile Wall in Jordan - LAST YEAR! But Won't Fund Border Wall in US!",
    "label": 1
  },
  {
    "title": "Paul Krugman on Twitter: 'If there's one thing that is absolutely clear after the past 2 years on health care, it is that Rs have no alternative to the ACA, and never will. Their plan is for people to get sick, go bankrupt, and die.'",
    "label": 0
  },
  {
    "title": "Jennifer Rubin on Twitter: 'Dems should pound this: Trump says he is above the law. Period. Do voters want to buy into that or not?'",
    "label": 0
  },
  {
    "title": "How I feel as a young 1/2 black 1/2 white man every time a Democrat assumes I’ll go along with their idea just because I’m not white. #LiberalLogic #WalkAway #DrainTheSwamp #MAGA",
    "label": 1
  },
  {
    "title": "Media That Once Accused 47 Republicans of Violating the Logan Act Now Says John Kerry Is In the Clear",
    "label": 1
  },
  {
    "title": "Lindsey Graham promises 'full scale' probe into Democrats' handling of Ford-Kavanaugh allegation",
    "label": 1
  },
  {
    "title": "The last time CO2 emissions were this high the Arctic had palm trees: 'It's terrifying'",
    "label": 0
  },
  {
    "title": "Majority of Americans now say they approve of Trump's handling of coronavirus: poll",
    "label": 1
  },
  {
    "title": "Left or right, Trump-haters need to admit that he may well win again",
    "label": 1
  },
  {
    "title": "Japan set to pay its manufacturers to leave China",
    "label": 1
  },
  {
    "title": "Only Hutt I see is the Orange Jabba.",
    "label": 0
  },
  {
    "title": "Scott Walker ordered to hold special elections he was afraid Republicans would lose",
    "label": 0
  },
  {
    "title": "A Reminder...",
    "label": 1
  },
  {
    "title": "Airports To Now Have Breast-Feeding Rooms Thanks To President Trump",
    "label": 1
  },
  {
    "title": "She simply doesn’t care about you.",
    "label": 1
  },
  {
    "title": "Mitch McConnell: 'I'm not sure what leverage there is in refraining from sending us something we do not want'",
    "label": 1
  },
  {
    "title": "LA Sheriff’s Attempt to Shut Down Gun Stores Fails — Firearms Businesses Now Deemed ‘Essential’",
    "label": 1
  },
  {
    "title": "The impeachment trial proved Republicans will hold onto power no matter what. I worked in US intelligence and I'm worried The only way Trump and his associates can prevent themselves from going to jail in 2021 is to remain in power, no matter the actual results of the election",
    "label": 0
  },
  {
    "title": "The Saudi's can fight and pay for their own war",
    "label": 1
  },
  {
    "title": "Joe Walsh on Twitter: 'There's one aspect of the Russia investigation that even the most strident Trump supporters can't explain and can't defend: All the lying. All the lying. Damn near everyone on Team Trump has been caught lying, over and over, about Russia. Why?'",
    "label": 0
  },
  {
    "title": "Finally, US hospitals will have to post their prices online",
    "label": 1
  },
  {
    "title": "World leaders should pay attention to the ongoing crackdown and recent arrests of pro-democracy activists in Hong Kong.",
    "label": 1
  },
  {
    "title": "Newly Declassified Documents Show Hillary's Server Was Compromised, Emails Forwarded to Chinese Email Account",
    "label": 1
  },
  {
    "title": "CNN now the 'hate Trump' network, ex-contributors say: Network 'openly despises conservatives'",
    "label": 1
  },
  {
    "title": "Putin Almost Done Redacting Mueller Report",
    "label": 0
  },
  {
    "title": "CNN panel aghast at Trump's angry 3 a.m. tweet: 'He was elected to be president -- not a mental patient'",
    "label": 0
  },
  {
    "title": "Pinterest Caught Listing Top Pro-Life Website as Porn to Censor Its Content",
    "label": 1
  },
  {
    "title": "More People need to be aware of what‘s currently happening in South Africa",
    "label": 1
  },
  {
    "title": "Chris Hayes: 'The alleged wannabe mass murderer in the Coast Guard googled 'civil war if Trump impeached.' Where could he possibly get such an insane idea? Oh' - Media Matters: 'Frequent Fox News guest tells Laura Ingraham 'we are in a civil war' suggests everyone buy guns to prepare for 'total war'",
    "label": 0
  },
  {
    "title": "US Senator John McCain dies aged 81",
    "label": 1
  },
  {
    "title": "Fox News co-founder Rupert Murdoch's New Zealand network pulled off the air over coverage of Nazi terrorist attacks.",
    "label": 0
  },
  {
    "title": "Beto O'Rourke says 'nothing more American' than to stand up or take a knee for your rights",
    "label": 0
  },
  {
    "title": "Report says American companies are leaving China en masse — and the coronavirus is speeding up that change",
    "label": 1
  },
  {
    "title": "Massacre of Christians not news worthy",
    "label": 1
  },
  {
    "title": "House Democrat calls on McConnell to recuse himself from impeachment trial",
    "label": 0
  },
  {
    "title": "Russian spam accounts are still a big problem for Reddit; At least 89 subs have been targeted by Russian propaganda.",
    "label": 0
  },
  {
    "title": "Donald Trump skips Elijah Cummings funeral and Capitol memorial service: A copy of the president's schedule released to the press this morning shows that Trump had nothing planned until 11:40 a.m.",
    "label": 0
  },
  {
    "title": "How Much Has the Government Spent at Trump’s Properties? It Won’t Say. - “He’s paying our money to himself,” the Washington Post’s David Fahrenthold told “Trump, Inc.” “There must be so much more we haven’t seen.”",
    "label": 0
  },
  {
    "title": "Somali Refugees and ISIS Supporters Arrested This Week Joined a Gym So They Could Do Beheadings",
    "label": 1
  },
  {
    "title": "Mitch McConnell Rails Against 'Moscow Mitch' Nickname. What Better Way To Assure It Will Continue To Be Used",
    "label": 0
  },
  {
    "title": "Ronald Klain on Twitter: Facts: The Obama administration tested 1 million people for H1N1 in the first month after the first US diagnosed case. The first US coronavirus case was 50+ days ago. And we haven't event tested 10,000 people yet.",
    "label": 0
  },
  {
    "title": "Democrats unveil new strategy for attracting more white women voters",
    "label": 1
  },
  {
    "title": "Makes u think what Republican job is..",
    "label": 0
  },
  {
    "title": "Remember",
    "label": 1
  },
  {
    "title": "Mueller's report: A profile of a president willing to sell out his country — It's hard to come to any conclusion other than Donald Trump should be impeached and removed from office",
    "label": 0
  },
  {
    "title": "New York Attorney General Launches Investigation Into the National Rifle Association",
    "label": 0
  },
  {
    "title": "Hillary Clinton: Like clockwork, where Democrats win, Republicans seek to put new restrictions on voting. We have to be vigilant in the fight to protect and expand voting rights, law by law and state by state.",
    "label": 0
  },
  {
    "title": "Nancy Pelosi caught on camera practicing ripping Trump's speech. Her office denies allegations that she planned to tear up Trump's State of the Union.",
    "label": 1
  },
  {
    "title": "V.O.T.E.",
    "label": 0
  },
  {
    "title": "Hillary Clinton: They're from America, and you're right about one thing: Currently their government is a complete and total catastrophe.",
    "label": 0
  },
  {
    "title": "Michael McFaul on Twitter: 'Hey my old boss @BarackObama ! Just saw you have 84 million followers! Tens of millions more than @realDonaldTrump! Use it. We need you.'",
    "label": 0
  },
  {
    "title": "For An Organization That Receives Over $500 Million Annually From The Government This Seems Unethical If Not Illegal",
    "label": 1
  },
  {
    "title": "This video triggered me",
    "label": 1
  },
  {
    "title": "Trump Checks In With His Boss",
    "label": 0
  },
  {
    "title": "Look who signed my Eagle Scout card. Respect the man so much that I named my Reagan",
    "label": 1
  },
  {
    "title": "GOP strategist admits: House Dems look 'like America & our future' but House Republicans look 'like Board meeting of 1950s corporation... basic law of politics: be for the future not past.'",
    "label": 0
  },
  {
    "title": "Newly emerged photo shows Ben Carson with key employee of sanctioned Russian oligarch: A photo emerges showing the HUD secretary with Alexey Komov, the main link between U.S. Christian fundamentalists and sanctioned Russians.",
    "label": 0
  },
  {
    "title": "Reminder: Russian trolls are active on reddit to create division between Biden and Bernie, like 2016.",
    "label": 0
  },
  {
    "title": "Arkansas, Utah both pass legislation banning abortion after 18 weeks",
    "label": 1
  },
  {
    "title": "Still whining about the popular vote...",
    "label": 1
  },
  {
    "title": "Gen Z here voting in the midterm because fuck the GOP",
    "label": 0
  },
  {
    "title": "Ruth Bader Ginsburg says she is cancer free",
    "label": 0
  },
  {
    "title": "Rep. Joe Kennedy III: It’s time to legalize marijuana at the federal level",
    "label": 0
  },
  {
    "title": "MSNBC’s Maddow, Hayes Torch Senators for Leaving Trial, Falling Asleep: If You Can’t Sit There for Eight Hours, ‘Resign Tomorrow’",
    "label": 0
  },
  {
    "title": "Andrew Weinstein on Twitter: 'It only took leading Democrats a few hours to call for Ralph Northam’s resignation. Steve King has been in Congress for sixteen years and most Republicans still haven’t said a word.'",
    "label": 0
  },
  {
    "title": "Trump's Trail of Tears joke isn't his first about a Native American massacre. Last month it was Wounded Knee. He's doing it repeatedly, and intentionally. It's sad and outrageous that we have this racist goon in the highest office. And it's sad and outrageous that the Republican party supports it.",
    "label": 0
  },
  {
    "title": "New Alabama State Amendment Recognizes Rights Of Preborn Children",
    "label": 1
  },
  {
    "title": "Donald Trump's presidency is disintegrating as he faces his worst 30 days since taking office",
    "label": 0
  },
  {
    "title": "Trump is handling COVID-19 very well",
    "label": 1
  },
  {
    "title": "Joe Walsh on Twitter: 'Reports say that in private Congressional Republicans are “struggling” with & “alarmed” by the President’s “SEND HER BACK” rally cry. Poor babies. Who gives a damn if they’re struggling in PRIVATE? If they don’t have the balls to PUBLICLY condemn this racism, the hell with em'",
    "label": 0
  },
  {
    "title": "Trump accused of another quid pro quo, this time with New York; 'He's holding New York state hostage to try to stop investigations into his prior tax fraud,' tweeted Rep. Val Demings.",
    "label": 0
  },
  {
    "title": "CNN caught in the act Creating the narrative against Trump! Bias confirmed in their own words.",
    "label": 1
  },
  {
    "title": "I'm a U.S. Marine, and this isn't the freedom of speech I served to protect: Mr. President free speech is not about you uttering every senseless, debilitating, dehumanizing, inciting thought or word out of your mouth.",
    "label": 0
  },
  {
    "title": "Tom Nichols: 'This makes zero sense. Let me simplify all this verbiage: if you are a loyal American and the emissaries of a hostile foreign power come to you offering dirt on a presidential campaign, you call the FBI. Full stop. Anything else is rationalization.' -- The Federalist: 'Facts Of The...'",
    "label": 0
  },
  {
    "title": "'This Is a Huge Deal': Majority of House Democrats Have Signed on to Medicare for All",
    "label": 0
  },
  {
    "title": "Kaitlan Collins on Twitter: 'With President Trump seated before him, French President Macron says, 'Patriotism is the exact opposite of nationalism. Nationalism is a betrayal of patriotism. By saying 'our interests first'...we erase what a nation hold dearest...its moral values.''",
    "label": 0
  },
  {
    "title": "James Comey: 'Small lies matter, even about yearbooks. From the standard jury instruction: “If a witness is shown knowingly to have testified falsely about any material matter, you have a right to distrust such witness' other testimony and you may reject all the testimony of that witness ...”'",
    "label": 0
  },
  {
    "title": "President Trump Is Challenging California’s Sanctuary Law In The Supreme Court",
    "label": 1
  },
  {
    "title": "'Grim Reaper' Mitch McConnell Admits There Are 395 House Bills Sitting in the Senate: 'We're Not Going to Pass Those'",
    "label": 0
  },
  {
    "title": "Poll: 73 percent of Republican students have withheld political views in class for fear their grades would suffer | The College Fix",
    "label": 1
  },
  {
    "title": "Denizcan Grimes on Twitter: 'Republican Chuck Grassley, with a net worth of $3.3 million, has applied for Trump’s Farmer bailout. Grassley pushed for this bailout. He's already accepted over $400,000 in farming subsidies. These people are the worst.'",
    "label": 0
  },
  {
    "title": "The situation summed up.",
    "label": 0
  },
  {
    "title": "Sally Yates on Twitter: '“She’s not my type.” Our country’s president defends against an allegation of sexual assault by essentially saying that his accuser is not attractive enough for him to rape. Let that sink in. President Trump, you’re not America’s type.'",
    "label": 0
  },
  {
    "title": "Democrat Congresswoman Secretly Sending Staff To Mexico To Coach Migrants How To Beat System, Report Says",
    "label": 1
  },
  {
    "title": "House Dems vs House GOP: Diversity on Display",
    "label": 0
  },
  {
    "title": "Donald Trump has 'stoked a cold civil war,' former McCain adviser says: “His rallies brim with menace and he has labeled journalists as enemies of the people. That someone would seek to kill their political enemies is not aberrational but rather inevitable consequence of Trump’s incitement.”",
    "label": 0
  },
  {
    "title": "Brian Klaas: 'I want Paul Ryan and Mitch McConnell on record responding to a question about whether they support Trump retweeting a Sandy Hook “truther” who claimed that surviving 6 & 7 year-olds from a mass slaughter were “child actors.” I want them to have to answer that question on camera.'",
    "label": 0
  },
  {
    "title": "'Mueller did not exonerate' Trump, 'Democrats will call on AG William Barr' to testify, says House Judiciary chair",
    "label": 0
  },
  {
    "title": "Trump pardons Dinesh D'Souza",
    "label": 1
  },
  {
    "title": "Store owner defense property with ar15",
    "label": 1
  },
  {
    "title": "Trump 'likely obstructed justice' in Comey firing, could be impeached, Brookings Institute says",
    "label": 0
  },
  {
    "title": "Pewdiepie crossover",
    "label": 1
  },
  {
    "title": "Thanks to Mueller, Maddow lays out, in devastating detail, how Trump and his admin were compromised by Russia. Don't let the run time (26 mins) scare you off - it's worth every second.",
    "label": 0
  },
  {
    "title": "Americans overwhelmingly want Congress to defy Trump and override his veto of the border wall emergency declaration",
    "label": 0
  },
  {
    "title": "2 scoops",
    "label": 1
  },
  {
    "title": "Journalist Travels to Ilhan Omar's Homeland to Prove Somalia is Beautiful, Debunk 'Stereotypes' - Gets Killed by Islamic Terrorists",
    "label": 1
  },
  {
    "title": "It’s everything they have ever wanted!",
    "label": 1
  },
  {
    "title": "Republican Matt Gaetz's challenger, a retired US Navy commander, says rep is using 'cold war' tactics to stay in power",
    "label": 0
  },
  {
    "title": "Yep, better get used to it...",
    "label": 1
  },
  {
    "title": "Wait... something that's happened a week and a half ago with video proof is alleged?",
    "label": 1
  },
  {
    "title": "William Barr Must Resign - There is no way for him to credibly continue to run the Department of Justice.",
    "label": 0
  },
  {
    "title": "WATCH: Ilhan Omar refuses to answer reporter asking if she condemns antifa firebomb attack",
    "label": 1
  },
  {
    "title": "Study: 96% of Biologists Agree Life Begins at Fertilization",
    "label": 1
  },
  {
    "title": "Vote against all Republicans. Every single one.",
    "label": 0
  },
  {
    "title": "Adam Schiff on Twitter: 'What Trump said then: Mexico will pay for the wall. I promise. I am proud to shutdown the government for border security. I will be the one to shut it down. What he says now: Taxpayers must pay for the wall. The Democrats own the shutdown. Promise made. Promises broken.'",
    "label": 0
  },
  {
    "title": "It would be very embarrassing if the mugshot of Donald Trump's Campaign Chairman made it to the front page and triggered Trump supporters, please don't let that happen.",
    "label": 0
  },
  {
    "title": "Trump’s biographer says his Twitter flailing isn’t a grand distraction scheme because he’s not smart enough for that",
    "label": 0
  },
  {
    "title": "11.3 million illegal immigrants killed no one yesterday. Just sayin.",
    "label": 0
  },
  {
    "title": "American Nightmare",
    "label": 0
  },
  {
    "title": "Lmao",
    "label": 1
  },
  {
    "title": "AOC: For men who are allegedly so “proud” of being straight, they seem to show real incompetence at attracting women to their event. Seems more like a “I-Struggle-With-Masculinity” parade to me. 🤷🏽‍♀️ Hope they grow enough over the next year to support / join LGBTQ fam next #Pride! 🏳️‍🌈",
    "label": 0
  },
  {
    "title": "Millionaire Republican Sen. Chuck Grassley Applying For Trump's Farm Bailout Funds",
    "label": 0
  },
  {
    "title": "VOTE!",
    "label": 0
  },
  {
    "title": "9 Black Employees Are Now Suing Fox News For Racial Harassment",
    "label": 0
  },
  {
    "title": "Colbert on Pat Robertson's 'bottom line' view of Khashoggi's murder.",
    "label": 0
  },
  {
    "title": "A trend emerges. He can finally take credit for something.",
    "label": 0
  },
  {
    "title": "Demands for Resignations as More GOP Senators Accused of 'Smash & Grab' Stock Dumps Ahead of Coronavirus Crash - 'They didn't mobilize to help families, or prep response. They dumped stock.'",
    "label": 0
  },
  {
    "title": "James Comey to Lawmakers: ‘No Serious Person’ Thinks There’s a Case Against Clinton Over Emails",
    "label": 0
  },
  {
    "title": "George Conway: 'You’re not “presidential” at all, period. You’re mentally unwell. You engage in bizarre, irrational, self-defeating behavior, which prompts criticism of you, which triggers more bizarre, irrational, self-defeating behavior. You would have been fired from any other job by now.''Do...'",
    "label": 0
  },
  {
    "title": "A GoFundMe For the Xenophobic Lawyer Whose Meltdown Went Viral Sends a Mariachi Band and Taco Truck to His Office",
    "label": 0
  },
  {
    "title": "Columbine survivor introduces bill to expand concealed-carry in schools",
    "label": 1
  },
  {
    "title": "Kermit is always so sarcastic.",
    "label": 0
  },
  {
    "title": "In 2018, Trump fired the entire US pandemic response team. These were the experts with decades of experience dealing with precisely the kind of situation we are in today. Trump did not replace them. He eliminated the positions.",
    "label": 0
  },
  {
    "title": "James O’Keefe's Project Veritas tried to dupe The Washington Post with a fake Roy Moore story; The Washington Post turned the tables on O'Keefe's group and exposed their fraud",
    "label": 0
  },
  {
    "title": "Bill de Blasio: Trump ‘Will Not Be Welcome Back in New York City’ After Presidency",
    "label": 0
  },
  {
    "title": "Sarah Sanders has a knack for lying: In the wake of pipe bombs sent to CNN and the murder of Jamal Khashoggi, she regurgitates the Stalinist accusation that harsh coverage or insufficiently glowing coverage takes reporters out of the body politic, putting them in the same camp as foreign enemies.",
    "label": 0
  },
  {
    "title": "Derek Cressman on Twitter: 'Still waiting for the explanation from the Republican Party as to why they put Michael Cohen in charge of their finances. ..,'",
    "label": 0
  },
  {
    "title": "Trump: Texas shooting result of 'mental health problem,' not US gun laws...which raises the question, why was a man with mental health problems allowed to purchase an assault rifle?",
    "label": 0
  },
  {
    "title": "BREAKING: Covington Kids Going To The White House",
    "label": 1
  },
  {
    "title": "Trump Thinks Foreign Films Shouldn't Win Oscars. That Makes Parasite's Win Even Sweeter",
    "label": 0
  },
  {
    "title": "Did anyone else see that coming? Lol",
    "label": 1
  },
  {
    "title": "Trump Already Had His Parade. It Was In Charlottesville.",
    "label": 0
  },
  {
    "title": "Madeleine Albright: Trump is 'the most undemocratic president in modern American history'",
    "label": 0
  },
  {
    "title": "Democrats' Deafening Silence on Biden Allegations As the Left is Confronted with Their Own 'Believe Women' Standard",
    "label": 1
  },
  {
    "title": "Democrats Are Using Ilhan Omar As An Excuse To Chill Speech",
    "label": 1
  },
  {
    "title": "Covering a puddle",
    "label": 0
  },
  {
    "title": "Made a friend on the road in Boston this morning.",
    "label": 0
  },
  {
    "title": "Arizona Republican Congressman's SIX Siblings Endorse His Opponent In Brutal Ads",
    "label": 0
  },
  {
    "title": "A great weight loss method.",
    "label": 0
  },
  {
    "title": "I applaud the mother for turning in her 17-year-old son, who planned to shoot up his school. He will hopefully receive mental health treatment instead of life in prison and causing the loss of innocent lives.",
    "label": 1
  },
  {
    "title": "Revoke Ilhan Omar's Marriage Fraud Immunity Card",
    "label": 1
  },
  {
    "title": "Similar to when every time there is a mass shooting, they want to make it even easier for the deranged to get guns.",
    "label": 0
  },
  {
    "title": "Jussie Smollett Offered Job At CNN After Fabricating News Story Out Of Thin Air",
    "label": 1
  },
  {
    "title": "Adam Schiff On Impeachment: Evidence Against Trump ‘Already Overwhelming’",
    "label": 0
  },
  {
    "title": "Gay Republicans deserve to be acknowledged.",
    "label": 1
  },
  {
    "title": "Sen. Josh Hawley introducing legislation to censure Senate Minority Leader Chuck Schumer for threatening two Supreme Court justices",
    "label": 1
  },
  {
    "title": "Conservative Icon George Will: Young Voters Now Consider GOP 'The Dumb Party'",
    "label": 0
  },
  {
    "title": "Zoinks",
    "label": 1
  },
  {
    "title": "Tim Allen's 'Last Man Standing' Revived at Fox Year After ABC Canceled It",
    "label": 1
  },
  {
    "title": "William Barr’s stunt has backfired: Barr has spun away his credibility and will be accused (rightly) of overstepping his bounds, adopting a partisan tone and hiding critical information about Trump from the public.",
    "label": 0
  },
  {
    "title": "‘Unplanned’ actress fires back at movie industry for threatening Georgia",
    "label": 1
  },
  {
    "title": "‘Totally dishonest’: Trump asserts only he can be trusted over opponents and ‘fake news’ -- “When Donald Trump is starting to raise the specter of trying to fiddle with search engines and saying that they are rigged — this raises alarm bells in me as a scholar of authoritarianism.”",
    "label": 0
  },
  {
    "title": "BREAKING: Pro-life House members plan to force vote on born-alive abortion survivors",
    "label": 1
  },
  {
    "title": "Grocery License. By eleven year old, Nate",
    "label": 0
  },
  {
    "title": "Pete Buttigieg: I used work in a SCIF, as a military officer. The importance of keeping it secure (i.e. from cell phone signals) was drilled into us so deeply that I’d have bad dreams about accidentally leaving my phone in the pocket of my uniform. This behavior is an embarrassment.",
    "label": 0
  },
  {
    "title": "r/politics is garbage",
    "label": 1
  },
  {
    "title": "Navy SEAL Eddie Gallagher found not guilty of killing ISIS fighter in Iraq",
    "label": 1
  },
  {
    "title": "Nearly 6 Million People Have Gotten Off Government Food Stamps Since Trump Took Office.",
    "label": 1
  },
  {
    "title": "The left is accusing Zina Bash, a Mexican-American Jewish woman, of being a white supremacist.",
    "label": 1
  },
  {
    "title": "Teachers Urge Government To Reopen Schools Before Students Learn To Think For Themselves",
    "label": 1
  },
  {
    "title": "Only 8% of college Democrats are proud to be American as opposed to 75% of Republicans.",
    "label": 1
  },
  {
    "title": "“In my 34 years, I have never seen such hate towards law enforcement that you want to abolish rather than do YOUR job & legislate!”",
    "label": 1
  },
  {
    "title": "CNN Fact-Checker Couldn’t Keep Up With Donald Trump’s Rally Lies; Trump was lying “faster than I can type,” tweeted Daniel Dale.",
    "label": 0
  },
  {
    "title": "Challenge to the media: for every interview with a billionaire who would pay more in taxes under a Democrat, interview a family who would lose food stamps if Trump’s proposals go through.",
    "label": 0
  },
  {
    "title": "I, for One, Am Displeased About Having to Pay for Trump’s New $16 Billion Farmer Bailout",
    "label": 0
  },
  {
    "title": "#trumpresign",
    "label": 0
  },
  {
    "title": "Trump 'deserves some credit' for foreign policy successes, ex-Clinton aide admits",
    "label": 1
  },
  {
    "title": "Old friends catching up",
    "label": 1
  },
  {
    "title": "Trump Deserves the Nobel Peace Prize, Says South Korean President",
    "label": 1
  },
  {
    "title": "Truth",
    "label": 1
  },
  {
    "title": "Parkland Students Don’t Speak for Me or My Generation",
    "label": 1
  },
  {
    "title": "Why aren’t CNN reporters asking every single Republican if they think Jim Jordan should resign? That’s what they did with Democrats about Al Franken for 2 weeks straight",
    "label": 0
  },
  {
    "title": "BLOOOOOOMMBEEERRRRG!!!!",
    "label": 0
  },
  {
    "title": "BREAKING: GOP Congressman Francis Rooney announces support for impeachment inquiry, citing Mulvaney’s disastrous press conference: “I want to get the facts and do the right thing. Because I’ll be looking at my children a lot longer than I’m looking at anybody in this building.”",
    "label": 0
  },
  {
    "title": "Mitch McConnell 'aided and abetted' Russia's attack on our election, says Mueller-biographer Garrett Graff",
    "label": 0
  },
  {
    "title": "WATCH: Tucker Carlson Tells Dutch Historian To “Go Fu*k Yourself” – Meltdown Interview Leaked",
    "label": 0
  },
  {
    "title": "Remember how he ridiculed Obama? Trump's travel bill now exceeds $100 million.",
    "label": 0
  },
  {
    "title": "He also attacked law enforcement over a case on air without disclosing the suspect was his lawyer.",
    "label": 0
  },
  {
    "title": "Trump is the world’s worst cheat at golf, players and celebs say: “Trump’s caddy came up to me and said, ‘You know that shot you hit on the par 5?’” Mike Tirico says. “‘It was about 10 feet from the hole. Trump threw it in the bunker. I watched him do it.’”",
    "label": 0
  },
  {
    "title": "Clara Jeffery on Twitter: 'Those 5,000 troops sitting on the border waiting for a few hundred bedraggled migrants to show up a month from now could be digging fire lines and helping to evacuate people and livestock from California instead.'",
    "label": 0
  },
  {
    "title": "I love how liberals suddenly care human rights in North Korea the minute President Trump starts to make progress; but doing a deal with a country that throws gays off of buildings is totally ok.",
    "label": 1
  },
  {
    "title": "Hillary Clinton: There's ample evidence that Republicans in office have pursued gerrymandered maps to shut out people of color from our political process. I'm disappointed but not surprised about today's anti-democratic decision.",
    "label": 0
  },
  {
    "title": "NEVER FORGET: A year ago, CNN tracked down and threatened to dox creator of Trump wrestling gif",
    "label": 1
  },
  {
    "title": "Alabama Republican voters' dilemma",
    "label": 0
  },
  {
    "title": "Only a matter of time before the social media mob comes for you - 'The truth is that these high school students were harassed, mocked, and threatened leading up to the confrontation with Philips, who chose to get in their faces and pound his drum.'",
    "label": 1
  },
  {
    "title": "90% of Dems, 69% of all U.S. adults 'very' or 'fairly' worried about climate change",
    "label": 0
  },
  {
    "title": "Chris Hayes on Twitter: 'It takes an extremely strenuous effort of pretending to be stupid to not see that *obviously* Trump knew the Russians were illegally trying to help him and he welcomed that help and encouraged it every chance he got. That's just the clear, public record of known facts.'",
    "label": 0
  },
  {
    "title": "WW2 vet carried to his seat at Trump rally",
    "label": 1
  },
  {
    "title": "It doesn’t GET more rich than this - part of Trump’s SOTU was plagiarized directly from Hillary Clinton:",
    "label": 0
  },
  {
    "title": "Did Andy Ngo get what he deserved? The left blames the victim",
    "label": 1
  },
  {
    "title": "She also didn’t sell out the country.",
    "label": 0
  },
  {
    "title": "Texas board drops Hillary Clinton from mandated history curriculum",
    "label": 1
  },
  {
    "title": "Rust Belt voters on Trump: ‘I’d vote for him again in a heartbeat’",
    "label": 1
  },
  {
    "title": "I’m republican but afraid to come out as one",
    "label": 1
  },
  {
    "title": "Trump bristled when asked about promoting hydroxychloroquine. Then he cut Fauci off. I think this just about says it all about this administration and Trump, he only cares about two things, 1. Himself and 2. Himself.",
    "label": 0
  },
  {
    "title": "Rachel Fine on Twitter: 'Hey, everyone who silver-lininged the trump presidency with a 'hey, but how about that 401k?', how ya feeling today? Were the caged kids still worth it? Just curious.'",
    "label": 0
  },
  {
    "title": "We Welcome Justice Brett Kavanaugh To The Supreme Court",
    "label": 1
  },
  {
    "title": "Ilhan Omar files for divorce with husband she is cheating on. (Time to spill the beans, hubby, on her marital fraud with bro)",
    "label": 1
  },
  {
    "title": "Title",
    "label": 1
  },
  {
    "title": "John Oliver Rages Over Trump’s ‘Pathological’ El Paso Visit: ‘Struggles to Do the Bare Minimum of Being a F*cking Person’",
    "label": 0
  },
  {
    "title": "Trump: US to Cut Aid to Guatemala, Honduras, El Salvador",
    "label": 1
  },
  {
    "title": "Stephen King on Twitter: '“Took over the airports.” Just when I think I have explored the outer limits of Donald Trump’s melting intellect, new vistas of stupidity open before me.'",
    "label": 0
  },
  {
    "title": "Barr: 'Resisting A Democratically Elected President' Is Destroying Our Norms And Institutions, Not Trump",
    "label": 1
  },
  {
    "title": "Because of Trump illegals are illegally crossing the Canadian border. Hey Canada you can keep them.",
    "label": 1
  },
  {
    "title": "New York man arrested for threatening to kill two US senators over backing Brett Kavanaugh",
    "label": 1
  },
  {
    "title": "I love my school. 2nd ammendment focused Marksmanship class. We got to go to a shooting range during in school hours.",
    "label": 1
  },
  {
    "title": "New border wall blocks 90% of illegal crossings, up from just 10%",
    "label": 1
  },
  {
    "title": "They do it so well...",
    "label": 1
  },
  {
    "title": "Don’t waste time",
    "label": 1
  },
  {
    "title": "Veterans haven't received GI Bill benefits for months due to ongoing IT issues at VA 'It’s really frustrating the amount of money that Congress has appropriated for veterans, and this is the way VA has rolled it out,” - TN Rep. Paul Roe (R),., House chairman of Veterans Affairs Committee",
    "label": 1
  },
  {
    "title": "Mueller is building a conspiracy case that's likely to ensnare Trump and his family",
    "label": 0
  },
  {
    "title": "Dems win the house!",
    "label": 0
  },
  {
    "title": "We Will Not Forget You",
    "label": 1
  },
  {
    "title": "Thank you President Obama for making unpopular decisions at the time that made our economy what it is now",
    "label": 0
  },
  {
    "title": "AOC riles Dems by refusing to pay party dues, bankrolling colleagues' opponents",
    "label": 1
  },
  {
    "title": "Trump Approval Rating Better than Obama and Reagan at Same Point in their Presidencies",
    "label": 1
  },
  {
    "title": "Rocket launcher, pipe bombs and hundreds of firearms seized in raids on Florida Neo-Nazi gangs",
    "label": 0
  },
  {
    "title": "Made in China: Coronavirus Chaos Could Have Been Avoided -- “If the officials had disclosed information about the epidemic earlier, I think it would have been a lot better. There should be more openness and transparency.”",
    "label": 1
  },
  {
    "title": "Trump loses appeal in New York tax case, must hand over returns",
    "label": 0
  },
  {
    "title": "D'uh! Meet the Press host Chuck Todd admits surprise at how willing Republicans are to spread lies and disinformation on behalf of Trump.",
    "label": 0
  },
  {
    "title": "Facebook denied a request from @JoeBiden's campaign to take down a video ad by President Trump's reelection campaign that falsely accuses the former vice president of corruption for his role in Ukraine policy during the Obama administration.",
    "label": 0
  },
  {
    "title": "When you watch too much CNN",
    "label": 1
  },
  {
    "title": "As a libertarian, thought you guys might get some use out of this on social media",
    "label": 1
  },
  {
    "title": "You know it.",
    "label": 1
  },
  {
    "title": "North Korea frees three US detainees ahead of Trump summit",
    "label": 1
  },
  {
    "title": "BrettKavanaugh.com is Now a Resource for Sexual Assault Survivors",
    "label": 0
  },
  {
    "title": "Who else misses these two bros?",
    "label": 0
  },
  {
    "title": "It would not be polite to ask the President to walk farther than 100 feet without a golf cart.",
    "label": 0
  },
  {
    "title": "Kanye West explains Trump support and says he is bringing his shoe factories to America",
    "label": 1
  },
  {
    "title": "Just Imagine....",
    "label": 1
  },
  {
    "title": "More than 2,000 former DOJ officials call on Attorney General William Barr to resign",
    "label": 0
  },
  {
    "title": "John Kerry Claims the Obama Administration Just Gave Iran 'a Little Bit of Money'",
    "label": 1
  },
  {
    "title": "The Collapse of Democrats' Big Lie",
    "label": 1
  },
  {
    "title": "Mitch McConnell Warns Democrats Not to Investigate Trump. That's the Sweet Sound of GOP Fear",
    "label": 0
  },
  {
    "title": "Peter Daou on Twitter: 'Republicans steal babies, from breastfeeding mothers, retweet Nazis, and support bigots, attack allies, to coddle dictators, slam US law enforcement, to protect Russia... AND THE MAINSTREAM MEDIA SCREAM THAT DEMOCRATS ARE MOVING 'TOO FAR LEFT''",
    "label": 0
  },
  {
    "title": "Just saying",
    "label": 0
  },
  {
    "title": "Thanks to Brett Kavanaugh, Democratic Party is officially F****D !",
    "label": 1
  },
  {
    "title": "Macron wins",
    "label": 0
  },
  {
    "title": "Child rape victim won't forgive Hillary Clinton for defending rapist Child rape victim comes forward for the first time in 40 years to call Hillary Clinton a ‘liar’ who defended her rapist by smearing her, blocking evidence and callously laughing that she knew he was guilty.",
    "label": 1
  },
  {
    "title": "This meme speaks for us all",
    "label": 1
  },
  {
    "title": "Hillary Clinton: Reproductive rights are human rights. Women's freedom to decide whether and when to have children is core to their liberty as human beings. Today, we celebrate the power to decide. #ThxBirthControl",
    "label": 0
  },
  {
    "title": "Jon Cooper on Twitter: 'FUN FACT: No innocent person has ever threatened the life of a whistleblower.'",
    "label": 0
  },
  {
    "title": "Trump Has Spent More Than Three Months This Year At His Properties, Adding to Ethics Concerns - 'Americans, on average, get 15 paid vacation days a year, but use only 12. Trump has taken more than 100.'",
    "label": 0
  },
  {
    "title": "Harry Truman nails the Republican Party perfectly in this 1948 quote. Apparently they haven't changed at all in 70 years.",
    "label": 0
  },
  {
    "title": "Adam Schiff: 'For a President to float the idea of pardons to people who may incriminate him as a way to dissuade them from cooperating only adds to the evidence of potential obstruction of justice. Actions taken with corrupt intent may be illegal, and are certainly corrosive to our democracy.'",
    "label": 0
  },
  {
    "title": "Hispanics Rally to Trump, Boosting His 2020 Chances",
    "label": 1
  },
  {
    "title": "FLASHBACK Jan. 14: WHO Tells Everyone Don’t Worry Because China Says Coronavirus Isn’t Contagious",
    "label": 1
  },
  {
    "title": "Judge temporarily blocks Democratic subpoenas for Trump financial records after appeals court intervenes",
    "label": 1
  },
  {
    "title": "How fake news starts: Trump supporters tie Bernie Sanders to Alexandria shooting using a fake quote",
    "label": 0
  },
  {
    "title": "I'm a Republican immigration lawyer—and Trump is killing my party: On the two-year anniversary of Charlottesville's 'Unite the Right' rally, it is painfully obviously that the reason Trump could not condemn the Neo-Nazis is because their message and his message are the same.",
    "label": 0
  },
  {
    "title": "Trump is still on track to win reelection",
    "label": 1
  },
  {
    "title": "Time Columnist Invents a Trump Quote That Goes Viral, Later Admits It Was Made Up",
    "label": 1
  },
  {
    "title": "Tennessee Defunds Planned Parenthood",
    "label": 1
  },
  {
    "title": "$10 Billion to Central America",
    "label": 1
  },
  {
    "title": "House Republicans announced legislation to permanently lock in last year’s tax cuts, looking to remind voters of the surging economy — and the Republicans’ role in getting it there",
    "label": 1
  },
  {
    "title": "That Was Quick!... Ocasio-Cortez Pulls Her Lunatic Green New Deal Plan from Her Webpage",
    "label": 1
  },
  {
    "title": "Trump supporters registering voters in Florida were targeted by a van trying to drive into them, knocking their canopy tent over. They got out of the way and none were injured.",
    "label": 1
  },
  {
    "title": "Elizabeth Warren Reads Full Mueller Report in Congress, Calls for Impeachment",
    "label": 0
  },
  {
    "title": "My dad painted Trump.",
    "label": 1
  },
  {
    "title": "AOC: Trump Supporters Not Educated Enough to Recognize Their Own Racism | Breitbart",
    "label": 1
  },
  {
    "title": "This is Professor Anthony Pappas. He is the GOP nominee for Congress and is running against Alexandria Ocasio-Cortez. He has taught economics at St. Johns University for close to 40 years and graduated from MIT",
    "label": 1
  },
  {
    "title": "Tulsi Gabbard: ‘I Don’t See Deplorables, I See Fellow Americans’",
    "label": 1
  },
  {
    "title": "This Group Is Trying To Replace The Most Anti-Science Members of Congress With Actual Scientists",
    "label": 0
  },
  {
    "title": "Women soccer is paid less than men's soccer because the audience and revenue generated smaller. Can't believe this is even being discussed",
    "label": 1
  },
  {
    "title": "Matt Gaetz storming a SCIF to shut down an investigation, Matt Whitaker stating abuse of power is not a crime, and Trump’s lawyer arguing he can’t even be investigated for shooting someone really is the perfect encapsulation of the GOP’s current attitude towards the rule of law.",
    "label": 0
  },
  {
    "title": "Mueller didn’t fail. The country did. -- Pontificating about the “optics” of Mueller’s performance, when he confirmed President Trump accepted help from a hostile foreign power and lied about it and he lied when he claimed exoneration, tells me we have become untrustworthy guardians of democracy.",
    "label": 0
  },
  {
    "title": "Cult 45",
    "label": 0
  },
  {
    "title": "Anti-Obama Whistleblower found dead of 'self inflicted gunshot' was recently engaged and possibly getting hired to a new job at DHS. Sounds like someone who would kill himself...",
    "label": 1
  },
  {
    "title": "Mother Thinks Their 6-Year-Old Son is Transgender and Father Does Not Agree",
    "label": 1
  },
  {
    "title": "Support for Trump's wall reaches all-time high: Poll",
    "label": 1
  },
  {
    "title": "Feminists: It’s Wrong To Harass A Woman, Unless She Is A Republican",
    "label": 1
  },
  {
    "title": "Trump Bars U.S. Press, but Not Russia’s, at Meeting With Russian Officials In Oval Office",
    "label": 0
  },
  {
    "title": "Rashida Tlaib on black suspects' murder of Jews in Jersey City: 'White supremacy kills'",
    "label": 1
  },
  {
    "title": "Grab Them By The Irony.",
    "label": 0
  },
  {
    "title": "Starbucks Employees Say ‘Bias’ Training Was Cop Bashing Propaganda",
    "label": 1
  },
  {
    "title": "Poll: More Americans blame the News Media than Trump for dividing country",
    "label": 1
  },
  {
    "title": "We may finally see Trump’s tax returns, and Republicans are panicking: Democrats are planning to utilize a law allowing the House Ways and Means Committee to obtain any American’s tax returns to demand that the IRS turn them over.",
    "label": 0
  },
  {
    "title": "Senator Lindsey Graham is trying to organize a letter of Senate Republicans promising not to convict President Trump under any circumstances. Before the House even completes its inquiry. Senator Graham is pushing Alice-in-Wonderland justice. First the verdict, then the trial.",
    "label": 0
  },
  {
    "title": "I'm afraid poor Rudy may have a case of oldtimers...",
    "label": 0
  },
  {
    "title": "Ocasio-Cortez floats 70 percent tax on the super wealthy to fund Green New Deal",
    "label": 1
  },
  {
    "title": "Black Guns Matter founder says conservatives should reach out to potential allies in inner cities",
    "label": 1
  },
  {
    "title": "Senator Mark Warner (D-VA) has introduced the FIRE act, which would require all campaign officials to report, within 1 week, any contacts with foreign nationals attempting to make campaign donations or otherwise coordinate with the campaign through the proffer of information or services.",
    "label": 0
  },
  {
    "title": "Education reformer left China to escape socialism. He’s running for Congress to stop it in America.",
    "label": 1
  },
  {
    "title": "Daniel Dale on Twitter: 'Trump keeps saying, as he did yesterday, that only '3%' of people released for an asylum hearing actually show up for court. His Justice Department says it was 89% last year, 91% in 2016, 93% in 2015, 94% in 2014.'",
    "label": 0
  },
  {
    "title": "Head of Virginia GOP resigns rather than run 'vicious campaign' for Trump-loving pro-Confederate US senate candidate",
    "label": 0
  },
  {
    "title": "Alex Jones and InfoWars Ordered to Pay $100K in Court Costs for Sandy Hook Case",
    "label": 0
  },
  {
    "title": "Kevin McCarthy says Brett Kavanaugh accusations 'drastically' helped GOP candidates",
    "label": 1
  },
  {
    "title": "US Presidents interacting with their people in times of need",
    "label": 0
  },
  {
    "title": "Need I say more?",
    "label": 1
  },
  {
    "title": "AOC screamed at Border Patrol agents in 'threatening manner' and refused to tour the facility",
    "label": 1
  },
  {
    "title": "Ex-County Official Who Called Michelle Obama an ‘Ape’ Sentenced for Embezzling FEMA Funds.",
    "label": 0
  },
  {
    "title": "r/politics is literally disgusting. they can’t even deal with the truth",
    "label": 1
  },
  {
    "title": "Most Americans incorrectly think gun-murder rates have gotten worse, not better",
    "label": 1
  },
  {
    "title": "Trump skips G7 climate summit",
    "label": 1
  },
  {
    "title": "Socialism, Not Coronavirus Will Sink the American Economy",
    "label": 1
  },
  {
    "title": "President Trump: ''We Want Our Cities to Be Sanctuaries for Americans, Not Safe Havens for Criminals''",
    "label": 1
  },
  {
    "title": ":O",
    "label": 0
  },
  {
    "title": "Joe Biden is reminding everybody that he's a terrible candidate",
    "label": 1
  },
  {
    "title": "Trump voter: If Jesus Christ told me Trump colluded with Russia, I’d check with Trump",
    "label": 0
  },
  {
    "title": "Mueller is snaring more pleas: Look for what Manafort will be admitting to -- “Manafort is effectively admitting to being an instrument of the Kremlin — something that didn’t stop when he was in charge of the Trump campaign.” “This is what collusion looks like.”",
    "label": 0
  },
  {
    "title": "Pro-Trump Miss Michigan who refused to try on hijab stripped of title",
    "label": 1
  },
  {
    "title": "Col. Morris Davis on Twitter: 'No sane and sober Veteran of the United States Armed Forces can condone the dishonorable conduct of the draft-dodging, Russia-enabling @realDonaldTrump ... shame on those who once wore the uniform and now facilitate a piece of trash.'",
    "label": 0
  },
  {
    "title": "Trump Campaign Aides Had Repeated Contacts With Russian Intelligence",
    "label": 0
  },
  {
    "title": "Sean Spicer admits to White House coordination with Fox News on DNC murder conspiracy reports",
    "label": 0
  },
  {
    "title": "Take that Nancy",
    "label": 1
  },
  {
    "title": "CNN disguises leftist politicians as 'mothers, voters and students'",
    "label": 1
  },
  {
    "title": "A Message From Beto....",
    "label": 1
  },
  {
    "title": "Brennan on Kap’s endorsement deal.",
    "label": 0
  },
  {
    "title": "Trump EPA advisor claimed air is 'too clean,' and that pollution is healthy for children's lungs.",
    "label": 0
  },
  {
    "title": "Voting Patterns of 2016 Election MapPorn",
    "label": 1
  },
  {
    "title": "An article in my University paper scrutinized a professor for not respecting “Preferences” with his students. It made the front page.",
    "label": 1
  },
  {
    "title": "Trump administration cancels $8B health care grant for New York: Cuomo",
    "label": 0
  },
  {
    "title": "Pelosi announces House moving forward with articles of impeachment against Trump",
    "label": 0
  },
  {
    "title": "Go Back!",
    "label": 1
  },
  {
    "title": "Then vs Now",
    "label": 0
  },
  {
    "title": "Black Trump Supporter: They Tell Me Not to Wear MAGA Hat – So I Bought the Biggest One I Could Find!",
    "label": 1
  },
  {
    "title": "It's Time to Get Rid of Donald Trump",
    "label": 0
  },
  {
    "title": "Too Old Or Too Left: 2020 Democrats Are Unelectable",
    "label": 1
  },
  {
    "title": "Their God Emperor.",
    "label": 0
  },
  {
    "title": "Ocasio-Cortez's Green New Deal Website Taken Down After Everyone Makes Fun Of Her Stupid Ideas",
    "label": 1
  },
  {
    "title": "Fox News is worried about legal action after misleading viewers about coronavirus",
    "label": 0
  },
  {
    "title": "Evidence Shows Kamala Harris Covered Up Illegal Wiretaps",
    "label": 1
  },
  {
    "title": "Dems ignore Trump’s ultimatums, advance investigations into scandals",
    "label": 0
  },
  {
    "title": "Just registered democrat after years of being republican, enough is enough.",
    "label": 0
  },
  {
    "title": "Transgender Demands Are An Attack On Real Human Rights -- It is not a human right for a grown man with male genitals to shower next to girls at the gym; it is a human right for girls to say ‘no’ to this new brand of rape culture.",
    "label": 1
  },
  {
    "title": "The right-wing sliming of Douglas High students can’t be ignored. It’s too disgusting for that.",
    "label": 0
  },
  {
    "title": "Trump’s behavior in Europe was ‘unpresidented’ — and he isn’t getting any better: Trump’s buffoonery is bad enough at home; it’s especially embarrassing when he is supposed to be representing the entire country overseas. He makes me ashamed to be an American.",
    "label": 0
  },
  {
    "title": "Support for impeachment jumps in new poll",
    "label": 0
  },
  {
    "title": "Biden: “First thing I’d do is repeal those Trump tax cuts”",
    "label": 1
  },
  {
    "title": "Trump Is Selling a Privatization Scam, and Calling It an Infrastructure Plan - Scorning serious proposals, the White House offers a Trump University plan for employment.",
    "label": 0
  },
  {
    "title": "Trump defends Home Depot co-founder after shoppers threaten boycott",
    "label": 1
  },
  {
    "title": "Reddit ousts moderators of top pro-Trump community",
    "label": 1
  },
  {
    "title": "Uncle Joe in action!",
    "label": 1
  },
  {
    "title": "America Is Deeply Divided Because The Left Has Become So Shallow",
    "label": 1
  },
  {
    "title": "Trump now lies up to 9 times a day on average lately",
    "label": 0
  },
  {
    "title": "This is why we have the Second Amendment",
    "label": 1
  },
  {
    "title": "“The side that wants to take the choice away from women and give it to the state, they’re fighting a losing battle. Time is on the side of change.” - Ruth Bader Ginsburg",
    "label": 0
  },
  {
    "title": "Tlaib Calls For $20 Minimum Wage, Promptly Lists Internship At $15",
    "label": 1
  },
  {
    "title": "Stephen King on Twitter: 'Fuck your wall. Split that 5 billion between at-risk children who don’t have lunches and vets who can’t get proper medical and psychological treatment. Fuck your vanity project. Do something good for once.'",
    "label": 0
  },
  {
    "title": "Congressman: We Now Have ‘Credible Evidence’ Trump ‘Committed Very Serious Crimes’",
    "label": 0
  },
  {
    "title": "Trump raises record $24.8 million in one day as he launches reelection bid",
    "label": 1
  },
  {
    "title": "John McCain, 2008 vs 2018",
    "label": 1
  },
  {
    "title": "Hillary Clinton: If you appreciate 40-hour work weeks, safe working conditions, higher wages, weekends, and a day off today—thank the labor movement. #LaborDay",
    "label": 0
  },
  {
    "title": "Supreme Court rules in favor of Trump Administration in Muslim travel ban case",
    "label": 1
  },
  {
    "title": "GOP Women In South Carolina Are 'Embarrassed' By Lindsey Graham And Flocking To Democrats",
    "label": 0
  },
  {
    "title": "Evangelical college students say they don’t want Mike Pence to be their commencement speaker - The vice president is facing backlash from students and alumni who say he doesn't represent their Christian values.",
    "label": 0
  },
  {
    "title": "“Let the Voters Decide” Doesn’t Work if Trump Fires His National Security Staff So Russia Can Help Him Again",
    "label": 0
  },
  {
    "title": "Ted Budd Introduces Bill That Would Allow Victims Of Crimes By Illegal Immigrants To Sue Sanctuary Cities",
    "label": 1
  },
  {
    "title": "Senate can vote to acquit immediately without trial",
    "label": 1
  },
  {
    "title": "Rashida Tlaib Busted Accepting Campaign Donation From Dead Guy",
    "label": 1
  },
  {
    "title": "North Korea Takes Down Anti-American Propaganda Posters",
    "label": 1
  },
  {
    "title": "IRS data show progressive plans require huge middle-class tax hikes",
    "label": 1
  },
  {
    "title": "The Media's Sudden Disinterest in the Denver STEM School Shooting Proves Greater Interests In Agendas than You",
    "label": 1
  },
  {
    "title": "Beto O’ Rourke, the man who said “Hell yes, we’re gonna take your AR-15 and AK-47, has ended his campaign for President, making this the first worthwhile thing he has done for the American people.",
    "label": 1
  },
  {
    "title": "Survey Finds Black Business Ownership in the U.S. Jumped 400% in One Year",
    "label": 1
  },
  {
    "title": "Instead of visiting White House during DC trip, Warriors meet with Barack Obama",
    "label": 0
  },
  {
    "title": "James Comey on Twitter: 'This Republican Congress has proven incapable of fulfilling the Founders’ design that “Ambition must ... counteract ambition.” All who believe in this country’s values must vote for Democrats this fall. Policy differences don’t matter right now. History has its eyes on us.'",
    "label": 0
  },
  {
    "title": "Mercedes Schlapp: Trump has given Hispanic voters a booming economy. Dems shouldn't count on their support",
    "label": 1
  },
  {
    "title": "Abortionists be like",
    "label": 1
  },
  {
    "title": "Someone should've called Saul.",
    "label": 0
  },
  {
    "title": "Joe Scarborough: ‘America’s IQ Dropped About 100 Points’ Because of ‘Extraordinary Stupid’ GOP Defense of Trump",
    "label": 0
  },
  {
    "title": "Election Night 2020 is going to be like Groundhog Day for Democrats",
    "label": 1
  },
  {
    "title": "HILLARY CLINTON CLEARED OF MISHANDLING CLASSIFIED INFORMATION AFTER 3-YEAR PRIVATE EMAIL PROBE, TRUMP SO FAR SILENT",
    "label": 0
  },
  {
    "title": "Hillary Clinton: People are mobilizing across the country today to #StopKavanaugh. Find an event near you",
    "label": 0
  },
  {
    "title": "Trump presidency continues to devalue Trump brand as another NYC building votes to change its name",
    "label": 0
  },
  {
    "title": "Schiff: If senators don't allow witnesses, they are guilty of 'working with the President to obstruct the truth'",
    "label": 0
  },
  {
    "title": "Victims of False Accusations of Rape Need To Be Heard, Too, Especially Kavanaugh!",
    "label": 1
  },
  {
    "title": "Chris Murphy: Pence walkout 'a multi million dollar political stunt paid for by taxpayers'",
    "label": 0
  },
  {
    "title": "Trump’s Budget Cuts Millions Of Dollars From Gun Background Check System - This would “significantly undermine” efforts to keep firearms out of dangerous hands, gun control advocates say.",
    "label": 0
  },
  {
    "title": "Trump complains that Fox News has the “worst polls” after network finds him losing to every Democrat | Trump demands Fox fire its pollster after new numbers show him underwater against the potential Democratic nominee",
    "label": 0
  },
  {
    "title": "AntiFa has been lionized by politicians, the media, and celebrities. But the latest violence in Portland proves law enforcement officials correct: AntiFa is a domestic terror group.",
    "label": 1
  },
  {
    "title": "Hilary Rosen: It is kind of annoying that so many reporters, after talking with @HillaryClinton comment on how nice and funny she is. Like, “oops I helped turn her into a caricature in 2016 but now she’s changed.” She hasn’t changed, you have.",
    "label": 0
  },
  {
    "title": "Student Who Snatched Classmate’s MAGA Hat Facing Battery Charges, Says She Was Only Making Political Statement",
    "label": 1
  },
  {
    "title": "I would rather hear a teenager’s opinion on guns, than Rick Santorum’s views on abortion.",
    "label": 0
  },
  {
    "title": "RECAP: All 3 'Witnesses' Named By Ford And Questioned By FBI Deny Knowledge Of Party",
    "label": 1
  },
  {
    "title": "Thank you, Mr. President.",
    "label": 0
  },
  {
    "title": "David Hogg: You definitely should NOT rt this photo of @RickSantorum with Russian spy @Maria_Butina that Rick wants off the internet",
    "label": 0
  },
  {
    "title": "Why does my school think this is an appropriate question to ask kids?",
    "label": 1
  },
  {
    "title": "The media never cares when Americans are killed by illegal immigrants",
    "label": 1
  },
  {
    "title": "Republican Gerrymandering Has Basically Destroyed Representative Democracy in Wisconsin",
    "label": 0
  },
  {
    "title": "We must",
    "label": 1
  },
  {
    "title": "Limbaugh evacuates South Florida after claiming Hurricane Irma was a liberal hoax",
    "label": 0
  },
  {
    "title": "The GOP Is the Russian Propaganda Party Now",
    "label": 0
  },
  {
    "title": "Don’t think anyone is actually surprised by this.",
    "label": 1
  },
  {
    "title": "McConnell's likely Democratic challenger raises $10.7 million In three months",
    "label": 0
  },
  {
    "title": "Ukrainian to US prosecutors: Why don't you want our evidence on Democrats? | TheHill",
    "label": 1
  },
  {
    "title": "If 97% of doctors say you have a tumor-you probably have a tumor If 97% of tax accountants say you are paying too much in taxes-you probably are If 97% of environmental scientists say that man made global warming is real-It probably is",
    "label": 0
  },
  {
    "title": "Julia Ioffe on Twitter: 'If #Cohen is a liar and his testimony is pointless, why are they so afraid to hear it?'",
    "label": 0
  },
  {
    "title": "Pelosi Wants To Talk Blame for COVID Spread? Here's Video of Her Telling People To Crowd into Streets",
    "label": 1
  },
  {
    "title": "Radical Muslim Who Attempted to Kill Canadian Soldiers 'Not a Terrorist'",
    "label": 1
  },
  {
    "title": ".",
    "label": 0
  },
  {
    "title": "State investigation finds YEARS of Rep. Ilhan Omar Tax Fraud",
    "label": 1
  },
  {
    "title": "Texas Democrats plan multimillion-dollar effort to unseat Republican Sen. John Cornyn",
    "label": 0
  },
  {
    "title": "Why Are Democrats Upset at Illegal Aliens Being Sent to Their Sanctuary Cities?",
    "label": 1
  },
  {
    "title": "Nancy Pelosi: Michael Cohen just admitted he lied to Congress to hide @realDonaldTrump’s financial ties to Russia. Neither Trump nor his cronies are above the law. We must immediately take action to protect Mueller's investigation!",
    "label": 0
  },
  {
    "title": "Man arrested after planning mass shooting, joining isis in anti trump email to news station in Nashville",
    "label": 1
  },
  {
    "title": "Illegal Caravan.",
    "label": 0
  },
  {
    "title": "Supreme Court Allows Trump Admin to Implement 'Public Charge' Test for Immigrants | National Review",
    "label": 1
  },
  {
    "title": "Iran Declines To Sign Colin Kaepernick After Reviewing Workout Video",
    "label": 1
  },
  {
    "title": "Ken Fitzgerald: 'The President is not now, and never has been, in the military, so he's not supposed to salute anyone unless they salute him first. Which he would know if he actually gave a shit about anything other than himself.' -- Kaitlan Collins: 'President Trump and the First Lady came into...'",
    "label": 0
  },
  {
    "title": "Weak Treasonous Rat. Never forget which party elected this traitor, and never let the press whitewash how much he and he's party has betrayed this country",
    "label": 0
  },
  {
    "title": "Ted Lieu: 'Let me ask White House Senior Advisor @IvankaTrump about Trump Tower Moscow. Oh wait, she blocked me, a Member of Congress, because my questions bother her. Let me correct that. She blocked me, a Member of Congress who will be in the majority, because my questions bother her.'",
    "label": 0
  },
  {
    "title": "GOP senators come out and say it: The Trump administration is covering up Khashoggi’s killing",
    "label": 0
  },
  {
    "title": "Hillary Clinton: Please do not take medical advice from a man who looked directly at a solar eclipse.",
    "label": 0
  },
  {
    "title": "Trump revealed highly classified information to Russian foreign minister and ambassador",
    "label": 0
  },
  {
    "title": "Costco Raises Its Starting Minimum Wage to $14 an Hour, Credits Tax Cuts",
    "label": 1
  },
  {
    "title": "Bill Clinton banned assault weapons in 1994, & mass shooting deaths declined by 43%. Republican’s purposely let the bill expire in 2004, and as a result mass shootings increased 239%. I didn't know this until just 10 minutes ago. A little ashamed, a little more angry as well!",
    "label": 0
  },
  {
    "title": "nOt My pReSiDeNt..",
    "label": 1
  },
  {
    "title": "Why is the Media Supporting the Iranian Regime’s Propaganda Campaign?",
    "label": 1
  },
  {
    "title": "Nature Knows...",
    "label": 1
  },
  {
    "title": "The Girl Who Cried Wolf",
    "label": 1
  },
  {
    "title": "White liberals ‘patronize’ minorities while talking – but conservatives don’t, study says",
    "label": 1
  },
  {
    "title": "Obama on Trump: How hard can it be to say 'Nazis are bad'?",
    "label": 0
  },
  {
    "title": "Fox Business host on Trump tariffs: 'We'd be shouting' if Obama did this",
    "label": 0
  },
  {
    "title": "Media had no problem calling it a border 'crisis' in 2014 under Obama",
    "label": 1
  },
  {
    "title": "DNC Members Discuss Changing Rules To Stop Sanders From Getting Nomination At Convention, Report Says",
    "label": 1
  },
  {
    "title": "Judge Kavanaugh Has the Votes, He’ll Get Confirmed Tomorrow by Senate",
    "label": 1
  },
  {
    "title": "Abortion was the number one cause of death worldwide in 2018, with more than 41 million.",
    "label": 1
  },
  {
    "title": "CNN to Trump: You incited this",
    "label": 0
  },
  {
    "title": "MSM trying to stoke a bull market, Kevin O’Leary instead talks about small American businesses",
    "label": 1
  },
  {
    "title": "Trump's Problem: He 'Doesn’t Give One S**t About Public Service'",
    "label": 0
  },
  {
    "title": "Can we at least agree on this?",
    "label": 0
  },
  {
    "title": "Florida Seeks To Ban Sanctuary Cities",
    "label": 1
  },
  {
    "title": "Tom Fitton to Testify on Clinton Foundation",
    "label": 1
  },
  {
    "title": "This is your periodic reminder that every person who told us that there was no functional difference between voting for Hillary or Trump was wrong on the level of the Iraq war and should never be listened to again unless they apologize and explain how they learned their lesson.",
    "label": 0
  },
  {
    "title": "Trump Says It’s a Very Scary Time for Men, Because Women Can Vote Them Out of Office",
    "label": 0
  },
  {
    "title": "Impeachment is the perfect opportunity for Trump and the GOP to lay out all the evidence against Ukraine and Joe Biden",
    "label": 1
  },
  {
    "title": "Tammy Duckworth on Twitter: 'We don't live in a dictatorship or a monarchy. I swore an oath—in the military and in the Senate—to preserve, protect and defend the Constitution of the United States, not to mindlessly cater to the whims of Cadet Bone Spurs and clap when he demands I clap'",
    "label": 0
  },
  {
    "title": "PRAGER: America Is Drowning In The Left's Lies About Trump",
    "label": 1
  },
  {
    "title": "President Trump’s reelection campaign is threatening legal action against television stations in key battleground states if they continue airing an ad cut by the liberal super PAC Priorities USA alleging that the president called the coronavirus a “hoax”",
    "label": 0
  },
  {
    "title": "Texas Lt. Gov. tells Antifa to 'stay out' of El Paso after Walmart shooting",
    "label": 1
  },
  {
    "title": "Federal agents apprehended a Honduran convicted for murder after he illegally entered the country with members of the caravan last Saturday. Days later, a Border Patrol agent was held at gunpoint by an illegal alien in California who had been deported to Mexico at least five times.",
    "label": 1
  },
  {
    "title": "Trump Has Now Made Over 15,000 False or Misleading Claims in Office, Says Washington Post",
    "label": 0
  },
  {
    "title": "Freedom is blind 🇺🇲 Borer Patrol isn't 👀",
    "label": 1
  },
  {
    "title": "New Bolton revelations show Trump’s trial is more corrupt than we thought",
    "label": 0
  },
  {
    "title": "Study: COVID-19 Impacts Men, Women More Than All Other Genders Combined",
    "label": 1
  },
  {
    "title": "When considering borders and a wall, it does seem a little silly to argue over wall funding, when you look back at Iran and a previous POTUS. Just my opinion.",
    "label": 1
  },
  {
    "title": "AOC: 'After I forced myself into a cell w/ women&began speaking to them, one of them described their treatment at the hands of officers as “psychological warfare” - waking them at odd hours for no reason, calling them wh*res, etc. Tell me what about that is due to a “lack of funding?”'",
    "label": 0
  },
  {
    "title": "Picture of Obama’s staff welcoming President Trump on his 1st day at the White House... and here’s the Whistle-Blower aka Eric Ciaramella.",
    "label": 1
  },
  {
    "title": "U.S.’s Biggest Christian Charity Reportedly Channeled $56.1 Million to Purported Hate Groups",
    "label": 0
  },
  {
    "title": "Schiff: I 'hope to hell' I'd impeach Obama if he did the same as Trump — If Obama had done what the current president is accused of, the House Intelligence Committee chairman told ABC's 'This Week,' then 'every one of these Republicans would be voting to impeach him.'",
    "label": 0
  },
  {
    "title": "r/politics",
    "label": 1
  },
  {
    "title": "Let's just say it, shall we? Joe Biden is probably not okay",
    "label": 1
  },
  {
    "title": "That man got murdered in live TV. 400 mil wasted",
    "label": 0
  },
  {
    "title": "Nancy Pelosi says House will vote to limit Trump's war powers on Iran as tensions grow",
    "label": 0
  },
  {
    "title": "Trump to U.N.: America will never surrender our sovereignty to an unelected, unaccountable global bureaucracy",
    "label": 1
  },
  {
    "title": "Adam H. Johnson on Twitter: 'The Senate just passed a $717 billion defense bill and not one op-ed or editorial or talking head on cable news will ask “how will we pay for it”. Funding for bombs, guns, military bases, warships, fighter jets is simply factored in. Like gravity or entropy, it just is.'",
    "label": 0
  },
  {
    "title": "YUGE: U.S. charges Huawei with racketeering ... RICO!!!",
    "label": 1
  },
  {
    "title": "when will they learn",
    "label": 1
  },
  {
    "title": "Byron York: Barr is right, spying on Trump campaign did occur",
    "label": 1
  },
  {
    "title": "The New York Times is reporting President Trump has a financial stake in the French company that makes the brand-name version of hydroxychloroquine.",
    "label": 0
  },
  {
    "title": "Pete Buttigieg: To come of age in the 21st century is to see virtually every major prediction and policy advanced by the Republican Party in your adult lifetime fail before your eyes. Nothing they say actually works in the real world.",
    "label": 0
  },
  {
    "title": "Ted Cruz defeats Beto O'Rourke",
    "label": 1
  },
  {
    "title": "Rep. Steve Scalise: When Eric Holder, other Dems call for violence, that's a direct threat to our democracy",
    "label": 1
  },
  {
    "title": "Fired up! Ready to go!",
    "label": 0
  },
  {
    "title": "Why do we keep calling illegal immigrants 'undocumented' in Mollie Tibbetts murder and other crimes?",
    "label": 1
  },
  {
    "title": "Hillary Clinton: The Trump administration opened a new assault on Americans' health care yesterday by telling a federal appeals court that the entire law should be struck down. It's a sickening attack on people with pre-existing conditions, seniors, and young people.",
    "label": 0
  },
  {
    "title": "Socialism, for Lack of a Better Word, Sucks",
    "label": 1
  },
  {
    "title": "Democrat hypocrites.",
    "label": 1
  },
  {
    "title": "Worth seeing how rude Acosta is in Video compilation of grandstanding and being rude. Unreal!",
    "label": 1
  },
  {
    "title": "Here’s an idea...",
    "label": 0
  },
  {
    "title": "Because... greed?",
    "label": 0
  },
  {
    "title": "Nancy Pelosi: Yet again, I am proud to sign and send to @realDonaldTrump ’s desk bipartisan legislation terminating his fake emergency declaration.",
    "label": 0
  },
  {
    "title": "Impeachment is now a slam dunk: A steady stream of witnesses continue to testify in the inquiry, increasing the volume of evidence of what is already an air-tight case. The urgency of his removal is intensified when he displays an ever-increasing appetite for unconstitutional and illegal conduct.",
    "label": 0
  },
  {
    "title": "Mark Hamill: 'Can the media PLEASE stop citing the 'conclusions' of the Mueller Report when, in fact, we only have a three-and-a-half page interpretation by the biased Mr. Barr, who argued it's impossible for a President to obstruct justice?'",
    "label": 0
  },
  {
    "title": "Investigators Found ‘No Evidence’ to Support Brian Kemp’s Claim That Democrats Tried to Hack Georgia Election",
    "label": 0
  },
  {
    "title": "Remember when...?",
    "label": 1
  },
  {
    "title": "Media Coverage?",
    "label": 1
  },
  {
    "title": "Senate votes 100-0 to release Trump whistleblower complaint",
    "label": 0
  },
  {
    "title": "Beto O’Rourke’s failed far-left presidential campaign makes him unelectable in Texas",
    "label": 1
  },
  {
    "title": "Shocking video of children in Philadelphia Muslim Society: 'We will chop off their heads' for Allah",
    "label": 1
  },
  {
    "title": "This is why I stand with Rand",
    "label": 1
  },
  {
    "title": "Ted Lieu on Twitter: 'I never disclose what happens in internal Steering and Policy Committee discussions. But I make one exception today. We just gave @SpeakerPelosi a standing ovation. Because Nancy Pelosi is a badass. #NoMoreShutdowns'",
    "label": 0
  },
  {
    "title": "9/11 victim’s son blasts Ilhan Omar at Ground Zero memorial service",
    "label": 1
  },
  {
    "title": "Betsy DeVos is unfit to lead the Education Department. It's time for her to resign.",
    "label": 0
  },
  {
    "title": "A required video test (with quizzes) about diversity and inclusion for all students attending Michigan State University.",
    "label": 1
  },
  {
    "title": "Yale Psychiatrist Who Has Repeatedly Called Trump Mentally Unfit Refuses to Diagnose Biden",
    "label": 1
  },
  {
    "title": "Hillary Clinton: As we hold Paris in our thoughts today, let’s also send some love to our neighbors in Louisiana. Three historically black churches have burned in recent weeks, charring buildings and scattering communities. If you can, contribute to rebuilding funds here:",
    "label": 0
  },
  {
    "title": "Disrespect of the flag and anthem.",
    "label": 0
  },
  {
    "title": "The El Paso Shooter Admits he is a Progressive Leftist",
    "label": 1
  },
  {
    "title": "Trump EO to colleges: Protect free speech or lose funding",
    "label": 1
  },
  {
    "title": "Legal experts blast William Barr for acting like 'defense lawyer' for Trump rather than representing American people",
    "label": 0
  },
  {
    "title": "Fox's Shep Smith skewers Trump for taking credit for avoiding war with North Korea: 'Who does he think he's kidding?'",
    "label": 0
  },
  {
    "title": "Demands for Workers-First Stimulus Grow as Senate GOP Fails to Ram Through $500 Billion Corporate 'Slush Fund' - 'No more slush funds or no-strings-attached handouts. Real relief for the American people.'",
    "label": 0
  },
  {
    "title": "Calls for Barr to Be Investigated–and Possibly Impeached–Intensify After Lying to Congress About FBI Spying",
    "label": 0
  },
  {
    "title": "New Poll Shows 10-Point Spike In Support for Impeachment Hearings",
    "label": 0
  },
  {
    "title": "Joe Biden says silence in the face of white supremacy 'is complicity' during fiery speech against Trump",
    "label": 0
  },
  {
    "title": "Newsweek fires reporter who wrote inaccurate story on Trump's Thanksgiving Day plans",
    "label": 1
  },
  {
    "title": "So true",
    "label": 1
  },
  {
    "title": "This is the Democrats hypocrisy to the #metoo",
    "label": 1
  },
  {
    "title": "Anyone not voting this year should never claim to be interested in politics again, and certainly should never ever call themselves Democrat, liberal, progressive, moderate, independent or perhaps even American.",
    "label": 0
  },
  {
    "title": "Words of Wisdom from a Republican.",
    "label": 0
  },
  {
    "title": "Ted Cruz Rips Corporate Media For 'Rooting For Pandemic To Get Worse'",
    "label": 1
  },
  {
    "title": "Some People Did Something. BTW, CAIR was founded in 1994, not after 9/11.",
    "label": 1
  },
  {
    "title": "GOP takes victory lap around Pelosi after passing border wall bill",
    "label": 1
  },
  {
    "title": "UC Berkeley settles landmark free speech lawsuit, will pay $70,000 to conservative group",
    "label": 1
  },
  {
    "title": "When Harvey Weinstein was accused of sexually assaulting women, Republicans demanded that Democrats return funds. - Now the tables have turned.",
    "label": 0
  },
  {
    "title": "Those rich people, with their fancy clothes, shopping in their fancy store, for their fancy food.",
    "label": 1
  },
  {
    "title": "Trump's Chances for Re-Election Are Looking Better and Better | RealClearPolitics",
    "label": 1
  },
  {
    "title": "Illegal immigrant killed 3 after 'sanctuary' release from custody, ICE says",
    "label": 1
  },
  {
    "title": "Nearly 100 abortion workers seek help to leave jobs after seeing ‘Unplanned’",
    "label": 1
  },
  {
    "title": "Every Day, Democrats Remind Us That It Isn't Trump Undermining Democracy",
    "label": 1
  },
  {
    "title": "Job growth smashes expectations for February as unemployment falls back to 3.5%",
    "label": 1
  },
  {
    "title": "It Should Be Illegal To Give Children Transgender Hormones And Surgery",
    "label": 1
  },
  {
    "title": "White supremacist sentenced to life in prison for Charlottesville car attack",
    "label": 0
  },
  {
    "title": "Shock Fox News Poll: 50 Percent of Americans Want Trump Impeached",
    "label": 0
  },
  {
    "title": "Man having an affair with ilhan Omar",
    "label": 1
  },
  {
    "title": "Kamala Harris claims Trump’s tariffs cost $1.4 billion per month. That’s Mostly True.",
    "label": 0
  },
  {
    "title": "Booker defies GOP warning, releases another batch of 'confidential' Kavanaugh docs",
    "label": 0
  },
  {
    "title": "Disgusting!",
    "label": 1
  },
  {
    "title": "Psychoanalyst: Forget Political Correctness, Kids Need Both Parents",
    "label": 1
  },
  {
    "title": "First day of early voting in Nevada! Took my two young boys with me. Blue wave!",
    "label": 0
  },
  {
    "title": "I met a war hero tonight",
    "label": 1
  },
  {
    "title": "Covington High student's legal team sues Washington Post",
    "label": 1
  },
  {
    "title": "A gentle reminder for Democratic voters",
    "label": 0
  },
  {
    "title": "Fact-checking President Trump’s USA Today op-ed on ‘Medicare-for-All’ -- President Trump wrote an opinion article for USA Today regarding proposals to expand Medicare to all Americans in which almost every sentence contained a misleading statement or a falsehood.",
    "label": 0
  },
  {
    "title": "Happy 166th Birthday Everyone!",
    "label": 1
  },
  {
    "title": "Sen Dianne Feinstein: We’ll never help improve living conditions in those countries if we further isolate them, a fact that Trump refuses to acknowledge. Even members of his own administration say economic development in Central America is key to solving this crisis, but still he refuses to listen.",
    "label": 0
  },
  {
    "title": "Hunter Biden is 'biological and legal father' of child with former stripper, judge rules",
    "label": 1
  },
  {
    "title": "‘Morning Joe': Americans ‘Must Vote Democratic’ Because Trump is ‘Greatest Threat to Our Democracy’",
    "label": 0
  },
  {
    "title": "Blackburn: China 'Should Waive Some of Our Debt' -- 'They Have Made a Global Pandemic Worse'",
    "label": 1
  },
  {
    "title": "Republicans Have Added 600,000 More Donors, $10 Million During Impeachment",
    "label": 1
  },
  {
    "title": "Bloomberg: Don't forget I bought you that House majority",
    "label": 1
  },
  {
    "title": "Alex Jones flees to Vimeo, is immediately banned there as well",
    "label": 0
  },
  {
    "title": "Pretty accurate, not gonna lie.",
    "label": 1
  },
  {
    "title": "The media savaged Trump when he claimed Puerto Rico officials were mismanaging disaster aid. But he was right",
    "label": 1
  },
  {
    "title": "I feel like I could’ve posted this at a better time.",
    "label": 1
  },
  {
    "title": "MSNBC Has Apparently Decided to Become an Iranian Propaganda Outlet",
    "label": 1
  },
  {
    "title": "America has never seen a party less caring than 21st-century Republicans",
    "label": 0
  },
  {
    "title": "Texas Concealed-Carry Law Prevented Mass Murder",
    "label": 1
  },
  {
    "title": "A break from the recent socialism advocacy",
    "label": 1
  },
  {
    "title": "Trump: Andrew Cuomo stronger 2020 Democratic presidential nominee than Joe Biden",
    "label": 1
  },
  {
    "title": "Santa Fe Didn't Fit The Left's Narrative, So We All Stopped Talking About It",
    "label": 1
  },
  {
    "title": "California governor signs law to force Trump into releasing tax returns",
    "label": 0
  },
  {
    "title": "Rachel Maddow Beats Sean Hannity, Takes Title As Most-Watched Cable News Host",
    "label": 0
  },
  {
    "title": "A scam of a party says goodbye to its top fraud",
    "label": 0
  },
  {
    "title": "Brett Kavanaugh Offers to Pay for Wall by Recycling His Empties",
    "label": 0
  },
  {
    "title": "How Rep. Katie Porter, at a COVID-19 hearing, may have saved your life - 'The congresswoman had the head of the CDC in front of her & she wouldn’t let up.'",
    "label": 0
  },
  {
    "title": "Ocasio-Cortez's ‘Green New Deal’ Fails In Senate. NO Senators Supported It.",
    "label": 1
  },
  {
    "title": "Chinese Propaganda Video Cites CNN, Democratic Politicians to Push Regime Narrative",
    "label": 1
  },
  {
    "title": "This truck is driving all over Texas in support of Beto O'Rourke, displaying Donald Trump's anti-Ted Cruz tweet",
    "label": 0
  },
  {
    "title": "Liberal Town Fires Whole Fire Department Over One Volunteer Being a Proud Boy",
    "label": 1
  },
  {
    "title": "Fox News' Andrew Napolitano says Bill Barr may have committed felonies: 'He has a problem'",
    "label": 0
  },
  {
    "title": "wayfairwalkout: 'tl;dr - Wayfair sold beds to furnish border camps; 547 employees signed a petition to ask that we cease all business with border camps; CEO said no —>employees are walking out tmrw at 1:30pm. We ask that Wayfair donate all profits made from the sale to RAICES #WayfairWalkout'",
    "label": 0
  },
  {
    "title": "Donald Trump is Lying 30 Times a Day on Average as the Midterms Approach, Fact-Checker Says",
    "label": 0
  },
  {
    "title": "Sign if you agree: All 50 states should include a vote-by-mail option for November's election.",
    "label": 0
  },
  {
    "title": "What Year Is It?!?",
    "label": 0
  },
  {
    "title": "Watergate whistleblower John Dean: 'I still have trouble using the title Mr. President for someone installed by Putin'",
    "label": 0
  },
  {
    "title": "true lmao",
    "label": 0
  },
  {
    "title": "Leary of their intentions.",
    "label": 0
  },
  {
    "title": "Judge: Charlottesville's Confederate statues are war memorials, Can't Be Removed",
    "label": 1
  },
  {
    "title": "Poll: Trump is as strongly disliked now as Nixon was before he resigned -- In fact, it's record breaking how many give Trump a poor rating this early in his presidency.",
    "label": 0
  },
  {
    "title": "The Saddest Part Of 2016",
    "label": 0
  },
  {
    "title": "How unfair!",
    "label": 1
  },
  {
    "title": "Trump Has Created 1.5 Million Fewer Jobs Than Obama",
    "label": 0
  },
  {
    "title": "Top U.S. Marine orders all Confederate symbols be removed from Corps bases",
    "label": 0
  },
  {
    "title": "Meet the Millennial who created his own pro-Trump social media platform to combat censorship",
    "label": 1
  },
  {
    "title": "That didn’t age well",
    "label": 0
  },
  {
    "title": "American Public Approves of Trump's Coronavirus Response",
    "label": 1
  },
  {
    "title": "Joe Rogan: 'I'd rather vote for Trump' than Biden",
    "label": 1
  },
  {
    "title": "One More Week to 'Investigate'",
    "label": 1
  },
  {
    "title": "Hong Kong protestors burn Lebron Jerseys. Great anger at his betrayal.",
    "label": 1
  },
  {
    "title": "Breaking News! #WalkAway",
    "label": 1
  },
  {
    "title": "Hillary Clinton: 'Yes we can.' Robert Maguire: 'Can we all just appreciate for a moment that the older sister of the sitting President of the United States just retired so as to avoid an inquiry into a decades-long tax fraud scheme she participated in *with the President* (who is still in office)'",
    "label": 0
  },
  {
    "title": "Pelosi: House could order new election in North Carolina after allegations of fraud",
    "label": 0
  },
  {
    "title": "Epstein commits “suicide” in jail a day after more Democrats are implicated in his crimes. The Clintons could not be reached for comment.",
    "label": 1
  },
  {
    "title": "Communism will never win",
    "label": 1
  },
  {
    "title": "In the 1990s, Joe Biden said William Barr was 'one of the best' attorneys general",
    "label": 1
  },
  {
    "title": "Disaster At Rally As Biden Smudges Note On Hand Reading, 'You Are Joe Biden And You Are Running For President'",
    "label": 1
  },
  {
    "title": "Kamala Harris is full of sh*t",
    "label": 1
  },
  {
    "title": "Kyle Griffin on Twitter: 'Trump has arrived at Trump National Golf Club in Sterling, VA, according to the pool report. This is Trump's 154th day at a Trump property as president and his 112th day at a Trump golf club as president.'",
    "label": 0
  },
  {
    "title": "A quote for the history books.",
    "label": 0
  },
  {
    "title": "Eighteen states offer in-state tuition for illegals...and legal resident students are NOT happy about that",
    "label": 1
  },
  {
    "title": "Mark Warner on Twitter: 'I think we’ve had enough of the President running the government like one of his businesses.'",
    "label": 0
  },
  {
    "title": "Ted Lieu: 'Dear Attorney General Bill Barr: I see you have a number of interesting investigations happening at @TheJusticeDept. Can you do your witness depositions in public? Can I sit in on your interviews? Of course not. Because investigations are not done in public. #FactsMatter'",
    "label": 0
  },
  {
    "title": "Pentagon concerns mounting about Trump’s proposed parade - The parade could cost anywhere between $3 million to $50 million, the first official said. 'We don't have troops & units sitting around waiting to do a parade,' a defense official directly familiar with initial planning efforts said.",
    "label": 0
  },
  {
    "title": "Kamala Harris on requiring paper ballots in all federal elections: 'Because Russia can't hack a piece of paper'.",
    "label": 0
  },
  {
    "title": "Sen. Marco Rubio: China wants to completely supplant the US – We can't allow it to hold the world hostage",
    "label": 1
  },
  {
    "title": "Up to 10 GOP senators consider breaking with Trump on war powers",
    "label": 0
  },
  {
    "title": "Elaine Cruz on Twitter: 'Saudi govt bought the 45th floor of Trump Tower in 6/2001. If Trump was a patriot he would've booted them out instead of bragging his bldg was the tallest after 9/11. Russians buy Trump properties to give birth for passports. Trump's loyalty isn't to America.'",
    "label": 0
  },
  {
    "title": "New Poll: Trump Is KILLING It",
    "label": 1
  },
  {
    "title": "Trump campaign data operation had stolen Clinton emails 'more than a month' before WikiLeaks: bombshell report",
    "label": 0
  },
  {
    "title": "George Takei on Twitter: 'Donald. Three things: 1) Your wall won't get built. 2) The Mueller Report will be released. 3) Years from now you'll be nothing but an embarrassing asterisk in the history books and people will shake their heads and say, 'Let's never do anything that stupid again.''",
    "label": 0
  },
  {
    "title": "This is Congresswoman Ruth Buffalo, the first Native American Democratic woman elected to the North Dakota legislature, who was sworn in yesterday.",
    "label": 0
  },
  {
    "title": "Just sayin....",
    "label": 1
  },
  {
    "title": "VA State Delegate Announces Plans To File Articles Of Impeachment Against Fairfax",
    "label": 1
  },
  {
    "title": "Proud to be a Liberal!",
    "label": 0
  },
  {
    "title": "Trump Has Spent 278 Years Of Presidential Salary On Taxpayer Funded Golf Trips",
    "label": 0
  },
  {
    "title": "AntiFa Brutally Assault Journalist During Portland Protest",
    "label": 1
  },
  {
    "title": "Trump family unable to unload Washington hotel lease as commercial real estate market collapses due to pandemic: report",
    "label": 0
  },
  {
    "title": "Quietly, another fifty miles of border wall is completed",
    "label": 1
  },
  {
    "title": "Deutsche Bank Turns Over Trump Financial Docs to NY Attorney General",
    "label": 0
  },
  {
    "title": "New Yorkers are fleeing the state in drove due to high taxes. The result is an overabundance of home few can afford",
    "label": 1
  },
  {
    "title": "Norwegian Lawmakers Nominate Trump For Nobel Peace Prize",
    "label": 1
  },
  {
    "title": "Joe Biden: No one should live in fear of being fired, evicted from their home, or denied service in a restaurant just because of their gender identity or who they love. The #EqualityAct is long overdue, and will ensure LGBTQ Americans are treated with the dignity and respect they deserve.",
    "label": 0
  },
  {
    "title": "If CNN Can't Take Punches, They Shouldn't Be Throwing Them",
    "label": 1
  },
  {
    "title": "Trump personally met with Russian ambassador during campaign",
    "label": 0
  },
  {
    "title": "7 days ago, the GOP tried to give government workers their first paychecks of 2019 while keeping the government shutdown. Only 6 Democrats supported it, showing us that they’d rather keep them hostage and use them as leverage.",
    "label": 1
  },
  {
    "title": "My President",
    "label": 1
  },
  {
    "title": "Ilhan Omar described acts of terrorism as a reaction to “our involvement in other people’s affairs...”",
    "label": 1
  },
  {
    "title": "Kids get publicly harassed for wearing a HAT",
    "label": 1
  },
  {
    "title": "21st Century Klansmen",
    "label": 0
  },
  {
    "title": "Cherokee Tribes speak out against Warren's claim of being Native American through DNA testing (resulting in a finding of at most 0.09% Native American), calling her 'Wrong and Inapropriate'",
    "label": 1
  },
  {
    "title": "By Bending the Knee to China, Corporate America Endangers Democracy",
    "label": 1
  },
  {
    "title": "Kavanaugh battle ignites GOP as tide shifts - 3 Senate battles move toward Republican candidate",
    "label": 1
  },
  {
    "title": "“America, Please Stand for Us: We are Dying!” Muslim Persecution of Christians",
    "label": 1
  },
  {
    "title": "Hillary Clinton: Mass shootings are not inevitable. The majority of Americans support common sense gun reform. Though we feel angry, heartbroken, even helpless now, we have the power to elect people who will protect lives, not gun sellers’ profits. Remember these feelings in November, and VOTE.",
    "label": 0
  },
  {
    "title": "Trump has unleashed a roaring economy and that's really bad news for 2020 Democrats",
    "label": 1
  },
  {
    "title": "Wealth concentration returning to levels last seen during the 1920s — The 400 richest Americans now own more than the bottom 150 million",
    "label": 0
  },
  {
    "title": "Trump Said China Called to Restart Trade Talks. Beijing Has No Idea What Call He’s Talking About.",
    "label": 0
  },
  {
    "title": "Trump will deliver a State of the Union address in spite of Nancy Pelosi asking for it to be delayed due to the government shutdown.",
    "label": 1
  },
  {
    "title": "If some evil billionaire genius had become president and was diverting government and military funds into his own pocket, I would be infuriated, but the fact that it is this moronic fucking buffoon doing it is embarrassing on top of infuriating. We should all be ashamed.",
    "label": 0
  },
  {
    "title": "Totally clears the President. Thank you!",
    "label": 0
  },
  {
    "title": "Judd Legum on Twitter: 'Roy Moore denies that he lost the U.S. Senate election, even after Alabama's Republican Secretary of State certified his opponent as the winner. Kind of puts his other denials in perspective.'",
    "label": 0
  },
  {
    "title": "A bill in NY State Senate will require gun license applicants to give social media passwords and 3 years of search history to the police. Giving private information like that to the Government is dangerous. Tell the NY State Senate that you oppose bill S9191.",
    "label": 1
  },
  {
    "title": "Wilbur Ross Lied to Congress About the GOP’s Plot to Rig the Census. This Should Be a National Scandal.",
    "label": 0
  },
  {
    "title": "Liberals Clarify Their Racism Is Actually Democratic Racism",
    "label": 1
  },
  {
    "title": "Senator Kamala Harris Announces Her Bid for President in 2020",
    "label": 0
  },
  {
    "title": "Nation Stunned That There Is Someone in White House Capable of Writing an Editorial",
    "label": 0
  },
  {
    "title": "Trump Didn’t Bribe Ukraine. It’s Actually Worse Than That. — It involved misusing $250 million in aid appropriated by Congress for his benefit—the kind of gross misconduct that easily clears the bar of high crimes and misdemeanors set by the Constitution when impeaching a president.",
    "label": 0
  },
  {
    "title": "Being this stupid should be a crime...",
    "label": 0
  },
  {
    "title": "So is Mike Pompeo going to testify for 11 hours in front of Congress and have all of his communications scrutinized by the entire world over this Embassy siege in Bagdad? Ya know, like Hillary Clinton and Benghazi.",
    "label": 0
  },
  {
    "title": "We need to stay angry about Kavanaugh: The Supreme Court’s legitimacy is in tatters. Conservative forces in the country, led by the Republican Party, have completed a judicial coup, decades in the making.",
    "label": 0
  },
  {
    "title": "Weeping Nazi started off as a “men’s rights activist,” which is no huge surprise - Christopher Cantwell's trajectory from 'men's rights' to white supremacy is sadly typical of the alt-right",
    "label": 0
  },
  {
    "title": "Democratic state legislator wins her fight against the coronavirus; credits hydroxychloroquine and Donald Trump for saving her life",
    "label": 1
  },
  {
    "title": "Pam Keith on Twitter: 'Donald Trump is the ultimate stochastic terrorist. Yes, I said it and I mean it. He CONSTANTLY invites and inspires others to commit violence in HIS name based on HIS value. He sickens me. He is a cancer on this GLOBE, not just this nation. We MUST GET HIM OUT OF THE WH!'",
    "label": 0
  },
  {
    "title": "UN Appoints China to Free Speech Panel, Proves They Are a Trash Organization",
    "label": 1
  },
  {
    "title": "FBI sabotaged Trump’s presidency: Barr",
    "label": 1
  },
  {
    "title": "Barack Obama gets ‘MVP’ chants, standing ovation in Toronto at Game 2 of NBA Finals",
    "label": 0
  },
  {
    "title": "When more safety means less freedom",
    "label": 1
  },
  {
    "title": "Patton Oswalt on Twitter: 'Colin Kaepernick should get off his damn knees during our National Anthem and do something respectful like Tweet and play golf.'",
    "label": 0
  },
  {
    "title": "US GDP grew at 4.1% in the 2nd quarter",
    "label": 1
  },
  {
    "title": "Republicans Projected to Pick up Seventy Seats in Prison",
    "label": 0
  },
  {
    "title": "Someone who would know says Trump is not a Racist, Dems need to stop overusing the term.",
    "label": 1
  },
  {
    "title": "Trump has granted more lobbyist waivers in 4 months than Obama did in 8 years",
    "label": 0
  },
  {
    "title": "Black Pastor: Trump ‘Probably Going to Be… Most Pro-Black President That We’ve Had in Our Lifetime’",
    "label": 1
  },
  {
    "title": "Trump Wants 2020 Showdown: ‘If They Beat Me With The Green New Deal, I Deserve To Lose’",
    "label": 1
  },
  {
    "title": "'HILLARY 2.0': Ocasio-Cortez Speaks To Black Audience In Accent, Gets Accused Of Racism",
    "label": 1
  },
  {
    "title": "Group says each new illegal immigrant costs $82,191, $164B over decade",
    "label": 1
  },
  {
    "title": "New Hampshire Governor Chris Sununu Vetoes Three Gun-Control Bills",
    "label": 1
  },
  {
    "title": "House Democrat Demands Six Years of Trump Tax Returns From IRS",
    "label": 0
  },
  {
    "title": "'This is not Fox.' Joy Reid shuts down Trump adviser who implies Clintons killed someone",
    "label": 0
  },
  {
    "title": "African Immigrant hijacks and torches school bus full of children in Italy",
    "label": 1
  },
  {
    "title": "In Last Minute Ruling, Court Blocks Trump Rules That’d Let Employers Refuse to Cover Birth Control",
    "label": 0
  },
  {
    "title": "As He Exits the House, It's Worth Noting That Paul Ryan Has Failed Spectacularly",
    "label": 0
  },
  {
    "title": "Tucker Carlson is not 'just joking' about rooting for Russia – Fox News host's Russia 'joke' is part of Republicans' move away from democracy and toward racist authoritarian rule",
    "label": 0
  },
  {
    "title": "Gettin bum punched",
    "label": 1
  },
  {
    "title": "Michael McFaul: 'Trump & his proxes have ridiculed General Mattis, General McMaster, General Kelly, and now Lt. Colonel Vindman, all decorated soldiers who willingly and dutifully signed up to work for him. I never want to hear again about Trump's alleged support for our soldiers and veterans.'",
    "label": 0
  },
  {
    "title": "The Promise.",
    "label": 0
  },
  {
    "title": "Trump Warns That Florida Recount Could Set Dangerous Precedent of Person with Most Votes Winning",
    "label": 0
  },
  {
    "title": "Corrupt Andrew Cuomo passes new gun laws. Time to move out of New York.",
    "label": 1
  },
  {
    "title": "He will stop at nothing.",
    "label": 0
  },
  {
    "title": "Disabled Veterans Can Say Adios To Student Loan Debt Thanks To Trump Executive Order",
    "label": 1
  },
  {
    "title": "House report shows Republicans are not ignoring Trump's cover-up, they're actively participating",
    "label": 0
  },
  {
    "title": "Dems prepare to force Trump to reveal private talks with Putin",
    "label": 0
  },
  {
    "title": "I want everyone to take a good hard look at this and realize that our president is doing everything he can to destroy free press.",
    "label": 0
  },
  {
    "title": "William Barr Is Turning U.S. Into Dictatorship, Says Ex-Labor Secretary",
    "label": 0
  },
  {
    "title": "Chance the Rapper: 'Black People Don't Have to Be Democrats'",
    "label": 1
  },
  {
    "title": "Trump admits 'you'd never have a Republican elected in this country again' if it was easier to vote",
    "label": 0
  },
  {
    "title": "Peddling Communism",
    "label": 1
  },
  {
    "title": "LBJ on the GOP",
    "label": 0
  },
  {
    "title": "Andy Beshear (D), candidate for Kentucky governor, gives his victory speech",
    "label": 0
  },
  {
    "title": "Chief Spreading Bull of the Lieawathas",
    "label": 1
  },
  {
    "title": "Bernie: ‘A Lot Of People In The Country Would Be Delighted To Pay More In Taxes’. Anybody here volunteering?",
    "label": 1
  },
  {
    "title": "Veteran takes a knee as POTUS motorcade passes.",
    "label": 0
  },
  {
    "title": "Bill and Hillary Clinton order pizza for White Plains Hospital staff",
    "label": 0
  },
  {
    "title": "“Not my president” until it’s time to receive federal aid",
    "label": 1
  },
  {
    "title": "50 years ago VS Now",
    "label": 1
  },
  {
    "title": "VICTORY: Court rules that Ohio can defund Planned Parenthood",
    "label": 1
  },
  {
    "title": "Brian Klaas: 'It's getting worse with Trump every day. In a 24 hour period, he shared a doctored video of Pelosi, called to execute political opponents, and authorized his toady AG to investigate political rivals. Call your Representatives. Urge them to impeach. And start volunteering for 2020'",
    "label": 0
  },
  {
    "title": "Brian Klaas: 'The President is openly attempting to go after the owner of a private business because that person also owns a newspaper that accurately reports unflattering stories about the White House. This is literally what Erdogan & Putin did. Republicans in Congress are enabling this too.'",
    "label": 0
  },
  {
    "title": "Protesters at ICE facility in Aurora deface the American flag and raise the mexican flag",
    "label": 1
  },
  {
    "title": "/r/Republican Has Been Hijacked By Liberals",
    "label": 1
  },
  {
    "title": "My son has this assignment that makes me want to reach out to the teacher to WTF him. Making kids think that one party can only work with their own party is not only wrong, but very much not ok.",
    "label": 1
  },
  {
    "title": "They Want Trump’s Liquor License Yanked—and They Just Might Win: Seven District of Columbia residents noticed that D.C. law says you have to be ‘of good character’ to have a liquor license. They want Trump’s taken away. And they might succeed.",
    "label": 0
  },
  {
    "title": "Kavanaugh accusation reignites #MeToo ahead of midterm elections – and a new 'Year of the Woman' could be really bad news for Republicans",
    "label": 0
  },
  {
    "title": "Bill Barr Interview: 'We’re not dealing with just mistakes and sloppiness. There’s something far more troubling here.'",
    "label": 1
  },
  {
    "title": "Elizabeth Warren Confirms Her Medicare for All Plan Will Cover Illegals",
    "label": 1
  },
  {
    "title": "Accurate",
    "label": 0
  },
  {
    "title": "Republican Strategist Rick Wilson shares some truth",
    "label": 0
  },
  {
    "title": "GOP rightly blocked Nancy Pelosi’s mail-in-balloting nonsense",
    "label": 1
  },
  {
    "title": "‘Anyone but Trump’: The Texas evangelicals who plan to vote Democrat",
    "label": 0
  },
  {
    "title": "Hillary Clinton: I couldn't think of a better Person of the Year than @GretaThunberg. I am grateful for all she's done to raise awareness of the climate crisis and her willingness to tell hard, motivating truths. As she said today: 'Change is coming, whether you like it or not.' #gutsywomen",
    "label": 0
  },
  {
    "title": "Gofundme for Trumps border wall",
    "label": 1
  },
  {
    "title": "McConnell: As long as I'm Senate leader, Democrats' 'socialist schemes' won't become law",
    "label": 1
  },
  {
    "title": "Trump Met With Boos, ‘Lock Him Up’ Chants At Nats Game",
    "label": 0
  },
  {
    "title": "Interesting new proposal for the border wall.",
    "label": 1
  },
  {
    "title": "The Democratic Party is making an irreversible left turn",
    "label": 1
  },
  {
    "title": "The Democrat Economic Curve.",
    "label": 0
  },
  {
    "title": "Senator Doug Jones: The shutdown should have never happened. What the President signed yesterday was the same thing the Senate passed unanimously in December. 35 days later we are back to square 1. Mr. President you want people to have good faith dialog, but good faith is a two way street.",
    "label": 0
  },
  {
    "title": "Stormy Daniels' Attorney Michael Avenatti Arrested for Felony Domestic Violence",
    "label": 1
  },
  {
    "title": "BREAKING: Ohio defunds Planned Parenthood and abortion industry",
    "label": 1
  },
  {
    "title": "Police official accidentally debunks Trump’s MS-13 rant with a single stat: The president would have you believe Long Island is a war zone. It isn't. Suffolk County police commissioner noted that there hasn’t been an MS-13-linked homicide in more than a year.",
    "label": 0
  },
  {
    "title": "CNN Poll: 6 in 10 say Trump does not deserve a second term",
    "label": 0
  },
  {
    "title": "Hillary Clinton: In one week, we have the chance to flip 17 governorships from red to blue. Here are four incredible candidates who deserve your support:",
    "label": 0
  },
  {
    "title": "BREAKING: Trump Launches Massive All Out Military Offensive On Drug Cartels",
    "label": 1
  },
  {
    "title": "Not only is the new fake accusation against Kavanaugh not remembered by the victim, but the Blasey Ford lie is refuted by her friend who was supposedly at the event, according to new book. Leland Keyser relates how they pressured her to lie on behalf of Ford and threatened to smear her.",
    "label": 1
  },
  {
    "title": "The President does wear a diaper.",
    "label": 0
  },
  {
    "title": "Patty Murray: WA has long had vote-by-mail and is seeing high voter turnout during the current crisis—that’s why Congress must pass the #VoteByMail bill I co-sponsored with @RonWyden and @SenAmyKlobuchar. In this uncertain time, more states should follow WA's lead.",
    "label": 0
  },
  {
    "title": "School refuses American Flag themed game on claims of racism.",
    "label": 1
  },
  {
    "title": "Accurate",
    "label": 1
  },
  {
    "title": "Chick-fil-A Rocketing to Third Largest Food Chain Despite Leftist Efforts to Stop It",
    "label": 1
  },
  {
    "title": "Family blasts right-wing media for spreading ‘fake’ news story about slain DNC staffer as Russia scandal deepens",
    "label": 0
  },
  {
    "title": "Gotta love libtards",
    "label": 1
  },
  {
    "title": "Trump overheard saying 'get me out of here' as he suddenly walks off stage at G20 summit",
    "label": 0
  },
  {
    "title": "Congress Schedules Hearing To Discuss Ending Marijuana Prohibition",
    "label": 0
  },
  {
    "title": "More kids have died in ICE custody than from vaping, former Republican Party chairman says as Trump plans e-cigarettes ban",
    "label": 0
  },
  {
    "title": "Ocasio-Cortez, Sanders Silent On Venezuela Allegedly Attacking Protesters",
    "label": 1
  },
  {
    "title": "Scott Walker narrowly loses Wisconsin governor's race – and he can't ask for a recount because of a law he put in place",
    "label": 0
  },
  {
    "title": "Legal Experts: Rep. Matt Gaetz Appears to Have Violated the Law with Cohen Twitter Threat",
    "label": 0
  },
  {
    "title": "Rep. Ilhan Omar blasts GOP over poster linking her with the 9/11 attacks",
    "label": 0
  },
  {
    "title": "Rand Paul’s mini-filibuster annoyed his fellow Republicans, but they all deserved it",
    "label": 1
  },
  {
    "title": "Mark Warner on Twitter: 'Every member of Congress, Republican and Democrat, needs to speak up in defense of the Special Counsel. Now.'",
    "label": 0
  },
  {
    "title": "Hillary Clinton: The Trump administration was told in January that coronavirus was likely to become a pandemic. They refused to act for fear of spooking the markets, losing weeks of time to prepare that we won’t get back.",
    "label": 0
  },
  {
    "title": "Susan Collins Is Now Trailing Her Democratic Challenger in New Poll",
    "label": 0
  },
  {
    "title": "Mitch McConnell’s New Legacy: Impeachment Trial Rigger For Donald Trump",
    "label": 0
  },
  {
    "title": "Jeff Sessions Has a Huge Conflict of Interest in a Federal Bribery Case—and It Keeps Getting Worse: Documents show he was deeply involved in an effort to derail an environmental cleanup at the heart of the case.",
    "label": 0
  },
  {
    "title": "‘Racist’ Trump Just Keeps Delivering Economic Gains For Women And Minorities",
    "label": 1
  },
  {
    "title": "George Takei: 'At Least During the Internment … I Was Not Taken from My Parents.' -- I was sent to a camp at just 5 years old — but even then, they didn't separate children from families.",
    "label": 0
  },
  {
    "title": "Thanks, Obama.",
    "label": 0
  },
  {
    "title": "It’s over. Democrat Ben McAdams ousts Republican Rep Mia Love by 694 votes.",
    "label": 0
  },
  {
    "title": "New Florida Republican governor suspends Broward County sheriff over school massacre, appoints first African-American sheriff in Broward County",
    "label": 1
  },
  {
    "title": "George Takei: 'Folks are acting as though we had no choice but to use tear gas at our border. But we have known about this group approaching for weeks. We could have had buses and agents ready to process people in an orderly and humane way. Instead, Trump closed the border and gassed them.'",
    "label": 0
  },
  {
    "title": "Hillary Clinton: As of last week, over 200 children in detention near the border are still separated from their families. It's been over 100 days since the deadline for the administration to reunite them.",
    "label": 0
  },
  {
    "title": "Nazis separated me from my parents as a child. The trauma lasts a lifetime: I know from experience that the Trump-sanctioned brutality at the US border with Mexico will scar its child victims for life",
    "label": 0
  },
  {
    "title": "Uninhibited Truth: Why I As a Black Man Support Donald Trump for 2020",
    "label": 1
  },
  {
    "title": "MERRY CHRISTMAS!",
    "label": 1
  },
  {
    "title": "Experts predicted economic Armageddon under Trump — where are they now?",
    "label": 1
  },
  {
    "title": "Trump has made America less racist",
    "label": 1
  },
  {
    "title": "Republicans think so low of men!",
    "label": 0
  },
  {
    "title": "The arrogance of BuzzFeed: These self-important Shitlords think they LITERALLY created and shaped the Internet as we know it today.",
    "label": 1
  },
  {
    "title": "US President caught colluding directly with Russia and Putin during the Presidential Election!",
    "label": 1
  },
  {
    "title": "Hell Freezes Over as The New York Times Says 'Give Trump His Border Money'",
    "label": 1
  },
  {
    "title": "Judge signs order permanently blocking citizenship question from 2020 census",
    "label": 0
  },
  {
    "title": "The Pro-Science Party",
    "label": 0
  },
  {
    "title": "That explains it.",
    "label": 1
  },
  {
    "title": "Loans of over $1 Billion to Trump by SCOTUS justice Kennedy's son, but nothing to see here...",
    "label": 0
  },
  {
    "title": "Porbs would happen",
    "label": 1
  },
  {
    "title": "HBO's Chernobyl: Brilliant Miniseries Indicts Socialism, Not Trump",
    "label": 1
  },
  {
    "title": "Trump lost the popular election by 3 million votes. So Trump lied that 3 million+ fraudulent votes were cast against him. Then Trump launched a commission to justify his lie. He finally had to shut that down, but is now demanding Voter ID. The Republicans are openly attacking American Democracy.",
    "label": 0
  },
  {
    "title": "The Princess of the Great American Banana Republic got to dip her toes into foreign policy yesterday!",
    "label": 0
  },
  {
    "title": "New York Times Kavanaugh book bombs, just 3,120 sold, Amazon rank #6,795",
    "label": 1
  },
  {
    "title": "Regarding Politics in General, & Political Discussion -",
    "label": 0
  },
  {
    "title": "Thought you guys might like this",
    "label": 1
  },
  {
    "title": "VIDEO: Black Trump Supporter Told Not to Wear MAGA Hat “Bought the Biggest MAGA Hat”",
    "label": 1
  },
  {
    "title": "Biden: ‘Everything’ at stake for Democrats in midterms",
    "label": 0
  },
  {
    "title": "'I didn't do it': Trump shuns responsibility for cutting pandemic team before White House cuts mic of reporter asking 'nasty question'",
    "label": 0
  },
  {
    "title": "John McCain, battling cancer, tells Joe Biden to stay in politics",
    "label": 0
  },
  {
    "title": "Biden's Attack On 'White Man’s Culture' Is A Mix Of Historical Illiteracy And Dishonesty",
    "label": 1
  },
  {
    "title": "Hillary Clinton: The president of the United States has betrayed our country. That’s not a political statement—it’s a harsh reality, and we must act. He is a clear and present danger to the things that keep us strong and free. I support impeachment.",
    "label": 0
  },
  {
    "title": "Trump’s failed shutdown strategy produced an even worse deal than he started with: The fact that Republicans signed off shows how little leverage they have.",
    "label": 0
  },
  {
    "title": "Cuomo: You know who's doing a good job on NY's COVID-19 outbreak? Trump",
    "label": 1
  },
  {
    "title": "“This misappropriates Native American culture and perpetuates harmful racial or ethnic stereotypes, promoting an inaccurate image of Native Americans”-The Left arguing for the abolishment of Illinois’ Chief Illiniwek, the SAME people who think it’s great that Sen. Warren is “Native American”. 1/1024",
    "label": 1
  },
  {
    "title": "“Obama golfed too much.”",
    "label": 0
  },
  {
    "title": "In 8-1 Decision, Supreme Court Overturns 9th Circuit – Gives Trump ‘Remain In Mexico’ Stay",
    "label": 1
  },
  {
    "title": "Veteran’s Wife is Shouted Down by Activists as She Recites the Pledge of Allegiance",
    "label": 1
  },
  {
    "title": "Trump has no excuse for mistreatment of children: He is to blame, not Obama or Congress. President Trump as usual refuses to accept responsibility for his administration’s ineptness and cruelty. He is interested in creating TV dramas and vilifying his opponents, not resolving problems.",
    "label": 0
  },
  {
    "title": "Ernst Reintroduces Bill to Cut Wasteful Spending, Cap Presidential Perks: “The national debt recently exceeded $22 trillion, thanks in part to taxpayer-funded presidential perks. It’s time we cap the monetary allowances allotted to former presidents and reign in Washington’s out-of-control spending'",
    "label": 1
  },
  {
    "title": "Joe Biden, Democrats facing 2020 disaster after Iowa and impeachment disasters",
    "label": 1
  },
  {
    "title": "William Barr and Mike Pompeo Are Now Fully Implicated in Trump's Trainwreck; The office of the president*, the Department of State, and the Department of Justice are now all involved.",
    "label": 0
  },
  {
    "title": "Bronx Republican says she plans to run against AOC since Amazon deal collapse",
    "label": 1
  },
  {
    "title": "Chris Hayes on Twitter: 'They literally ran an entire campaign about their opponent’s supposedly sloppy handling of classified material.' -- Josh Dawsey on Twitter: 'It's not just Rob Porter. 13 months in, dozens at White House lack permanent security clearances, including Jared Kushner. '",
    "label": 0
  },
  {
    "title": "Reddit Ignores Calls for Violence On Left-Leaning Subreddits Despite Censoring Pro-Trump Subreddit",
    "label": 1
  },
  {
    "title": "Trump Is Now Openly Trying to Censor His Critics. He May Succeed. - His campaign’s cease & desist letter to broadcast stations is a frightening assault on free speech.",
    "label": 0
  },
  {
    "title": "Booker: Trump is 'complicit' in white supremacist violence",
    "label": 0
  },
  {
    "title": "Forest fires down 25% and reforestation up 35% in the last 25-30 years. But the Democrats and its media lackeys won’t tell you this.",
    "label": 1
  },
  {
    "title": "The more you know",
    "label": 1
  },
  {
    "title": "Mueller getting a shout out on Jeopardy today",
    "label": 0
  },
  {
    "title": "Rep. Cummings (D-MD) asks Trump White House to list which ethics rules don't apply to it",
    "label": 0
  },
  {
    "title": "Insurance Industry Corrects Trump: Actually, We're Only Waiving Copays for Coronavirus Testing, Not Treatment - 'Heaven forbid they miss a chance to bankrupt sick people.'",
    "label": 0
  },
  {
    "title": "Colbert Blasts Sarah Sanders: ‘You Work For Donald Trump, You Don’t Even Treat Yourself With Respect’",
    "label": 0
  },
  {
    "title": "Nearly three-quarters of Republicans say the news media don’t understand people like them",
    "label": 1
  },
  {
    "title": "She is 1/1024th honest",
    "label": 1
  },
  {
    "title": "Sooo...Trump asks for an investigation into the son of the former VP who pressured the Gov to drop an investigation and bragged about it in National Television, and Trump is a danger to our country and should be executed?",
    "label": 1
  },
  {
    "title": "Remember the media outrage when this man was assualted by Leftist protestors? Of course you dont.",
    "label": 1
  },
  {
    "title": "Hillary Clinton: I know this is all hard for you, @realdonaldtrump, so let me spell it out: - Free testing - Fee waivers - Emergency sick leave - Quarantines - Cancellations - Giving a damn",
    "label": 0
  },
  {
    "title": "Reddit is full of gullible left wing people who think they are morally superior",
    "label": 1
  },
  {
    "title": "Journalists regret not taking Romney seriously on Russia",
    "label": 1
  },
  {
    "title": "It’s Not Just Jeff Sessions: The FBI Must Investigate Scott Pruitt for Lying to Congress. The new EPA head used private email to conduct government business in his prior job, but he didn’t say that when asked by the Senate. If Hillary Clinton was investigated for lying, he should be too.",
    "label": 0
  },
  {
    "title": "Tucker Carlson Is Republicans’ Most-Loved News Host",
    "label": 1
  },
  {
    "title": "David Yankovich on Twitter: 'Conservative programming has caused the right to hate the left so much that they're ok with leaders committing treason to win elections.'",
    "label": 0
  },
  {
    "title": "I bet it shoots 21 clips a second too",
    "label": 1
  },
  {
    "title": "Bette Midler on Twitter: 'NY Attorney General has ordered the Trump Foundation to dissolve. It’s always SAD to see a charitable organization fold, especially one that gave so much to the children— Ivanka, Eric, and Don Jr.'",
    "label": 0
  },
  {
    "title": "Leaked report suggests millions could lose coverage under GOP health proposal",
    "label": 0
  },
  {
    "title": "Uber fires driver who wouldn’t take woman to Planned Parenthood for abortion",
    "label": 1
  },
  {
    "title": "Jimmy Carter: Kavanaugh is 'unfit' to be a Supreme Court justice",
    "label": 0
  },
  {
    "title": "This is from Twitter...",
    "label": 0
  },
  {
    "title": "Polls: Trump Popularity Soars to Highest Level, Trust In Media Tanks To Lowest",
    "label": 1
  },
  {
    "title": "Google, Apple APPROVE Saudi app that tracks women as slaves owned by their husbands, but bans independent media apps for being “offensive”",
    "label": 1
  },
  {
    "title": "This is why I say f*ck your civility, Republicans.",
    "label": 0
  },
  {
    "title": "BREAKING: Trump Announces ICE To Begin Removing ‘Millions Of Illegal Aliens’ Next Week",
    "label": 1
  },
  {
    "title": "On tape: GOP Leader 'I think Putin pays [...] Trump'. Paul Ryan 'What’s said in the family stays in the family'",
    "label": 0
  },
  {
    "title": "BREAKING: The Secret Service just signed an “emergency order” to rent $45,000 worth of GOLF CARTS this weekend in Sterling, Virginia, home of Trump National Golf Club, in case you were wondering what Trump will be up to while thousands of Americans die.",
    "label": 0
  },
  {
    "title": "Under Trump, the United States are no longer the world's doormat.",
    "label": 1
  },
  {
    "title": "Nikki Haley Lights up Kamala Harris Over Her Cringeworthy Defense of Joe Biden on Ukraine",
    "label": 1
  },
  {
    "title": "Flashback: Obama Admin Asked Ukraine to Investigate Trump Campaign Manager Paul Manafort",
    "label": 1
  },
  {
    "title": "California Democrats plan to extend Medicaid to illegal immigrants",
    "label": 1
  },
  {
    "title": "Game of Thrones crossover",
    "label": 0
  },
  {
    "title": "It's on: Nobody Is Above the Law—Mueller Firing Rapid Response",
    "label": 0
  },
  {
    "title": "After Suing CNN, Sandmann's Legal Team Now Targeting Bill Maher, Kathy Griffin, HBO, NBC and AP",
    "label": 1
  },
  {
    "title": "CBS Baltimore: By golly, our murder rate actually IS higher than Guatemala, Honduras and El Salvador",
    "label": 1
  },
  {
    "title": "UNSUNG HERO: Admiral Mike Rogers, Obama's NSA Chief, Discovered Administration's '702' Illegal Spying Operation and Briefed Trump About Surveillance of Trump Tower",
    "label": 1
  },
  {
    "title": "Trump is ‘furious’ with New York Gov. Cuomo because his pandemic press conferences are overshadowing him",
    "label": 0
  },
  {
    "title": "In Genius Move, Trump Supports Impeachment, Forcing Democrats To Oppose",
    "label": 1
  },
  {
    "title": "Gun range video turned into combat footage Side by side comparison.",
    "label": 1
  },
  {
    "title": "[Discuss] Is congress in on it?",
    "label": 0
  },
  {
    "title": "Keep in mind that both parties are not the same.",
    "label": 0
  },
  {
    "title": "The Notorious R.G.B.",
    "label": 0
  },
  {
    "title": "Chicago police union wants federal investigation into Kim Foxx’s handling of Jussie Smollett case",
    "label": 1
  },
  {
    "title": "Hillary Clinton: With their votes to make the American president accountable to no one, Republican senators have put the interests of one president over the interests of all Americans. The only remedy now is for us all to vote in overwhelming numbers to replace them—and him—in November.",
    "label": 0
  },
  {
    "title": "Tucker Carlson: Tlaib Wants Power Due To Skin Color, Imagine A White Candidate Saying Vote For Me Based On Race",
    "label": 1
  },
  {
    "title": "Judge Blocks Trump Rule That Would Have Kicked 700,000 Off Food Stamps During Pandemic",
    "label": 0
  },
  {
    "title": "Yale University's newspaper: Republican Supreme Court nominee Brett Kavanaugh belonged to a 'secret society' known by the nickname 'Tit and Clit.' He also belonged to a fraternity that was later banned when recruits chanted 'no means yes, yes means anal' in front of the University's Women's Center.",
    "label": 0
  },
  {
    "title": "Trump Attends UFC Championship in NYC Only to Be Met With Loud Boos at Second Sporting Event This Week",
    "label": 0
  },
  {
    "title": "Democrat Doug Jones wins election to US Senate from Alabama",
    "label": 0
  },
  {
    "title": "Rep Eliot Engel- “Do-nothing” Democrats? We do nothing but pass #HR1 election & ethics reform. Do nothing but pass #HR9 on #climatechange. Do nothing but fight for affordable healthcare. Do nothing but pass gun background checks. You want real “do-nothing”? Go see #MoscowMitch.",
    "label": 0
  },
  {
    "title": "5 Lies of Black Lives Matter, Colin Kaepernick, and Nike",
    "label": 1
  },
  {
    "title": "Jennifer Rubin on Twitter: 'The notion R’s are entitled to D votes to break 60 without negotiating with them is bizarre. If you say take it or leave it, you have to be prepared for leave it.'",
    "label": 0
  },
  {
    "title": "Democrats be like...",
    "label": 1
  },
  {
    "title": "Why The Born-Alive Abortion Survivors Protection Act Is Necessary",
    "label": 1
  },
  {
    "title": "Melania Trump’s Radiant Smile For Barack Obama at Barbara Bush’s Funeral Lit Up the Internet: “Obama is a funny guy, but that’s a woman craving distance from a monster being reminded what dignity looks like.”",
    "label": 0
  },
  {
    "title": "As the healthcare industry reaches nearly 18% of GDP. Why aren’t we all outraged about healthcare? Why don’t we hold our elected officials accountable?",
    "label": 1
  },
  {
    "title": "Nearly 80,000 California retirees are receiving $100,000 or more in pension pay, new data show",
    "label": 1
  },
  {
    "title": "The United States is being run by a toddler: He has tantrums. He rips up paper. He disregards facts. He believes crazy conspiracies. He’s erratic and ill-informed.",
    "label": 0
  },
  {
    "title": "Ron DeSantis elected Florida governor in close race",
    "label": 1
  },
  {
    "title": "Racist Left",
    "label": 1
  },
  {
    "title": "Pro-life medical clinics get Title X funds as Planned Parenthood sees cuts",
    "label": 1
  },
  {
    "title": "Rand Paul acted like a Republican should act, and everyone else should take notes",
    "label": 1
  },
  {
    "title": "“The President actually said to Nancy Pelosi, ‘Hey, can we do something about this whistleblower complaint, can we work something out.’ And she said ‘Yes, you can tell your people to obey the law.’ So she quickly swatted that down.' - @HeidiNBC",
    "label": 0
  },
  {
    "title": "A new bill aims to send masked Antifa activists to jail for 15 years",
    "label": 1
  },
  {
    "title": "The Badass Women of Congress Took on the Credit Reporting Industry and It Was Glorious",
    "label": 0
  },
  {
    "title": "Sharing a conservative opinion on reddit",
    "label": 1
  },
  {
    "title": "The election is in six days. #WalkAway",
    "label": 1
  },
  {
    "title": "Parents of teen killed at Parkland were in El Paso during Walmart shooting; “You need to talk about guns, right now. You cannot wait because ‘it is too early to talk about guns,’ and not say ‘thoughts and prayer’ as an answer. Don’t do that.”",
    "label": 0
  },
  {
    "title": "Wow Trump said the truth",
    "label": 0
  },
  {
    "title": "Liberal media summarized",
    "label": 1
  },
  {
    "title": "North Carolina Republicans vote to override a budget veto while Democrats were at a 9/11 ceremony",
    "label": 0
  },
  {
    "title": "Trump’s ‘peace-through-strength’ philosophy on Iran is what America needs",
    "label": 1
  },
  {
    "title": "Trump at the UN",
    "label": 0
  },
  {
    "title": "West Virginia gets a taste of all Republican control of the entire government with new water quality standards opposed by advocates of clean water. The West Virginia Manufacturers Association argued that because West Virginians are heavier, their bodies can handle more pollutants.",
    "label": 0
  },
  {
    "title": "Trump to close government Dec. 5 in honor of President Bush",
    "label": 1
  },
  {
    "title": "College Forced Conservative To Advocate Liberal Causes. Now The Case Is Going To A Jury.",
    "label": 1
  },
  {
    "title": "Liz Warren’s No. 1 problem: the US economy is doing well",
    "label": 1
  },
  {
    "title": "Hillary Clinton: A reminder: None of these hearings would have happened if organizers, volunteers, and voters hadn't worked together to win back the House majority for Democrats last year. Let's keep working together in 2020 to hold power to account.",
    "label": 0
  },
  {
    "title": "Dem Who Said, ‘I Stand for the Flag, I Kneel at the Cross’ Forced to Resign as Local Party Exec",
    "label": 1
  },
  {
    "title": "House Republicans' bill would redirect Pakistan aid money to US infrastructure",
    "label": 1
  },
  {
    "title": "Ilhan Omar singled out in GOP resolution condemning anti-Semitism",
    "label": 1
  },
  {
    "title": "Michael Cohen reportedly gives Congress documents showing Trump's lawyers edited his false statement",
    "label": 0
  },
  {
    "title": "Biden: Trump is ‘incredibly dangerous and irresponsible’ as the ‘walls close in’",
    "label": 0
  },
  {
    "title": "Nordstrom drops Ivanka Trump-branded clothing and shoes",
    "label": 0
  },
  {
    "title": "Harrison Ford urges voters to 'stop electing leaders who don't believe in science'",
    "label": 0
  },
  {
    "title": "FBI spying is a far bigger scandal than the Trump impeachment",
    "label": 1
  },
  {
    "title": "A powerful video on the reality of Abortion",
    "label": 1
  },
  {
    "title": "Mike Pence just showed why Trump can’t be trusted with pardon power: VP Pence yet again disgraced the White House by saying he was “honored” to be joined by Joe Arpaio, because Arpaio is a “champion” of “the rule of law.” It was a complete inversion of the truth, turning reality upside down.",
    "label": 0
  },
  {
    "title": "r/politicalhumor didn’t like this.",
    "label": 1
  },
  {
    "title": "A Russian billionaire is tweeting Trump instructions on when to declare a state of emergency",
    "label": 0
  },
  {
    "title": "Triumph: Trump 'Indefinitely Suspends' Tariffs on Mexican Goods",
    "label": 1
  },
  {
    "title": "Donald Trump is on a search-and-destroy mission to remove anyone who might get in the way of him committing more crimes or using the federal government as a personal piggybank for himself and his friends. And he's using the coronavirus pandemic as a cover",
    "label": 0
  },
  {
    "title": "Catholic Church Disinvites NY Senator Who Backed Abortion Law To St. Patrick’s Day Parade",
    "label": 1
  },
  {
    "title": "Mikel Jollett on Twitter: 'Hitler: “The press is the enemy of the people!” Stalin: “The press is the enemy of the people!” Mao: “The press is the enemy of the people!” Donald Trump: “The press is the enemy of the people!”'",
    "label": 0
  },
  {
    "title": "David Hoffman on Twitter: 'Russian journalists were allowed in the room when Trump met Putin today. American journalists were not. Nuff said. #TraitorTrump'",
    "label": 0
  },
  {
    "title": "Ex-Bush ethics chief calls for Steve King expulsion after he posted meme of potential civil war",
    "label": 0
  },
  {
    "title": "Wisconsin voters flipping counties blue in April 3rd midterm",
    "label": 0
  },
  {
    "title": "Wisconsin Dem governor removes 82 Scott Walker appointees added during lame-duck session",
    "label": 0
  },
  {
    "title": "Michael Cohen’s plea deal is very bad for Trump: Cohen pleaded guilty to eight counts that include bank and tax fraud and, importantly, a campaign finance violation. For the first time, a Trump aide has been found guilty of an offense directly related to the campaign.",
    "label": 0
  },
  {
    "title": "California... A great place to be a Republican",
    "label": 1
  },
  {
    "title": "Dianne Feinstein Secretly Met with the Iranians Last Week and People Have Questions",
    "label": 1
  },
  {
    "title": "Rudy “Zombie Teeth” Gargamel today said Mueller should “stand up and be a man”.",
    "label": 0
  },
  {
    "title": "Tucker Carlson refuses to apologize amid uproar over past comments on 'extremely primitive' women",
    "label": 0
  },
  {
    "title": "China's regime lied about coronavirus for months. Why are the media believing its statistics now?",
    "label": 1
  },
  {
    "title": "Racist democrats have PLUNDERED Baltimore City schools for decades, treating EMERGENCY Federal Grants as personal piggy banks. Then, when Trump asks why only 12% of kids can read in city despite MASSIVE school budgets—they call Trump the racist!",
    "label": 1
  },
  {
    "title": "Oh the Reddit hypocrisy. Let’s build this man a wall!",
    "label": 1
  },
  {
    "title": "Leaked memo shows Trump administration weighed separating families at border, despite saying it was never policy",
    "label": 0
  },
  {
    "title": "Conservative Leaders Call on Facebook to Stand Up to Antifa’s Outrageous Violence",
    "label": 1
  },
  {
    "title": "The first step in combatting Russian interference in 2020 is calling out the obstacle: Moscow Mitch",
    "label": 0
  },
  {
    "title": "Ocasio-Cortez dismisses Ben Shapiro's debate offer, compares to 'catcalling'",
    "label": 1
  },
  {
    "title": "Warren Stammers After Being Asked If She Would Allow Her Vice President’s Son To Sit On A Foreign Company’s Board",
    "label": 1
  },
  {
    "title": "Texas Republican Party Endorses Marijuana Decriminalization",
    "label": 1
  },
  {
    "title": "Virginia will eliminate a state holiday honoring Robert E. Lee and Stonewall Jackson. It'll make Election Day a day off instead",
    "label": 0
  },
  {
    "title": "LOL: 'Moscow Mitch' is Taking Over McConnell's Life -- KEEP IT UP!",
    "label": 0
  },
  {
    "title": "Why is everyone at /Politics so left winged when it’s supposed to be both sides?",
    "label": 1
  },
  {
    "title": "Yes, Mexico’s drug cartels are terrorist groups",
    "label": 1
  },
  {
    "title": "'How dare that lady comedian be so vulgar!'",
    "label": 0
  },
  {
    "title": "Graham to introduce legislation to end birthright citizenship",
    "label": 1
  },
  {
    "title": "Palestinians launch 400 rockets at Jews, and suddenly media is done talking about anti-Semitism",
    "label": 1
  },
  {
    "title": "The danger of Democratic overreach: The Kavanaugh hearings could fuel Republican turnout, as many Americans see the weaponization of #MeToo",
    "label": 1
  },
  {
    "title": "What's happening with Tiffany?",
    "label": 0
  },
  {
    "title": "Grandmother, 104, has become the world's oldest person to survive coronavirus",
    "label": 1
  },
  {
    "title": "Shell Workers Had To Attend Trump Speech To Be Paid, Were Ordered Not To Protest: Report | They were instructed: 'No yelling, shouting, protesting or anything viewed as resistance,' according to the Pittsburgh Post-Gazette.",
    "label": 0
  },
  {
    "title": "Michelle Obama Launches Voter Registration Campaign",
    "label": 0
  },
  {
    "title": "Joe Lieberman formally registers as lobbyist for Chinese telecom giant ZTE",
    "label": 1
  },
  {
    "title": "Dogs are a good judge of character.",
    "label": 0
  },
  {
    "title": "George H.W. Bush’s funeral was a powerful renunciation of Trump: Trump’s name was mentioned not once by the four eulogists at Washington National Cathedral. But their words were an implicit rebuke of everything Trump is.",
    "label": 0
  },
  {
    "title": "8 Years of Trump Tax Returns Are Subpoenaed by Manhattan D.A.",
    "label": 0
  },
  {
    "title": "Fred Guttenberg: 'While you tweet about being home alone in the White House, I sit home today on my birthday, dealing with the reality that my daughter is no longer with me because she was killed in Parkland. Stop whining and fix what you broke.' -- Donald J. Trump: 'I am all alone (poor me) in...'",
    "label": 0
  },
  {
    "title": "Adam Schiff on Twitter: 'False statements about wiretaps at Trump Tower. False statements about unmasking. False statesments about a political spy in the Trump campaign. False statements about the Mueller investigation that has indicted the President’s top staff. It’s not spy-gate, only lie-gate.'",
    "label": 0
  },
  {
    "title": "CNN Slammed as Racist After Commentators Call Kanye West 'Token Negro'",
    "label": 1
  },
  {
    "title": "Judge Restores Wisconsin Governor's Powers, Strikes Down GOP Laws",
    "label": 0
  },
  {
    "title": "Server faked ‘we don’t tip terrorist’ note, Texas restaurant says",
    "label": 1
  },
  {
    "title": "Fox News Alert",
    "label": 0
  },
  {
    "title": "Thoughts on the 2nd Amendment, from a real conservative.",
    "label": 0
  },
  {
    "title": "Sen. Jeff Merkley on Twitter: Republican leaders gave away $4 billion dollars of Wisconsin taxpayers' money to a foreign company… and all they got was a stupid red hat.",
    "label": 0
  },
  {
    "title": "Tom Steyer Has Spent $47.6 Million on His Presidential Campaign. That Money Could Help Democrats in Hundreds of State Races",
    "label": 0
  },
  {
    "title": "AOC: “Wouldn’t you think someone who personally lost over a BILLION dollars (“more than nearly any other taxpayer in America”) be vulnerable to shady activity to get out of that hole? If they became the most powerful public servant in America, wouldn’t you want to see their taxes?“",
    "label": 0
  },
  {
    "title": "The aristocracy of Victimhood",
    "label": 1
  },
  {
    "title": "Iran Issues Sanctions on Top Trump Admin Officials, Sen. Cruz - Cruz spox: 'Cruz already avoids travel to terrorist regimes that take American citizens hostage'",
    "label": 1
  },
  {
    "title": "Get them while supplies last!",
    "label": 0
  },
  {
    "title": "Trump says administration looking 'seriously' at ending birthright citizenship",
    "label": 1
  },
  {
    "title": "Kurt Eichenwald: 'I have to get this off my chest. A cheating sleaze who grifts his way through life attacks a deceased great American, John McCain. The grifter’s cult then attacks McCain family, including widow @cindymccain and daughter @MeghanMcCain. Trump is a pig. And his fans are evil.'",
    "label": 0
  },
  {
    "title": "Keep up guys",
    "label": 1
  },
  {
    "title": "USS Roosevelt Captain's brutal choice",
    "label": 0
  },
  {
    "title": "BREAKING: Jobs Report Blows Away Expectations, Jobless Rate Hits 49-Year Low",
    "label": 1
  },
  {
    "title": "Trump Stops Taxpayer-Backed Mortgages for Illegal Aliens",
    "label": 1
  },
  {
    "title": "DeSantis announces new Florida school standards without Common Core... Florida students will read more classical literature and learn math differently, according to summary documents.",
    "label": 1
  },
  {
    "title": "First Common Core Graduates Worst-Prepared For College In 15 Years",
    "label": 1
  },
  {
    "title": "How bad does border have to be for Democrats to admit it's an emergency?",
    "label": 1
  },
  {
    "title": "Basically...",
    "label": 1
  },
  {
    "title": "Well well well....",
    "label": 1
  },
  {
    "title": "Trump Admin Moves To ‘Revoke And Terminate’ China-Owned Telecom Firm From Operating In U.S.",
    "label": 1
  },
  {
    "title": "How Did the Bidens' Corruption Become Trump's Scandal?",
    "label": 1
  },
  {
    "title": "Mike Bloomberg: 'Put down the soda & screw a 12 year old!'",
    "label": 1
  },
  {
    "title": "‘We are stronger than you’: VA governor blasts ‘pretend patriot’ white supremacists for Charlottesville violence",
    "label": 0
  },
  {
    "title": "‘Approximately 100 Percent’ of Trump’s Tariffs Were Paid by American Buyers: Report",
    "label": 0
  },
  {
    "title": "Governor Northam: 'Virginia Will Be Kept Comfortable While Lawmakers Debate Whether To Kill It'",
    "label": 1
  },
  {
    "title": "Conrad Black: Why Donald Trump will win big in 2020",
    "label": 1
  },
  {
    "title": "GOP says they're moving forward with Friday vote on Kavanaugh",
    "label": 1
  },
  {
    "title": "Hillary Clinton: As of today, this shutdown is the longest in history. The costs are already high: People are missing paychecks, losing business, or working without pay. Our national parks are overrun with trash. The FDA and FBI warn of the harm to our food safety and national security.",
    "label": 0
  },
  {
    "title": "Adam Schiff on Twitter: 'Trump is resisting every Congressional request for testimony and documents related to our oversight responsibility. Like an aspiring autocrat, he doesn’t recognize the co-equal branches of our government. He has lived his entire life without accountability. That ends now.'",
    "label": 0
  },
  {
    "title": "Democrats send death threats to little girl who made fun of idiot",
    "label": 1
  },
  {
    "title": "Trump ignores critics, serves fast food to more athletes. This time, it’s Chick-fil-A.",
    "label": 1
  },
  {
    "title": "This Is the Moment of Truth for Republicans: The GOP can either defend the United States or serve the damaged and defective man who is now its president.",
    "label": 0
  },
  {
    "title": "Valid point!",
    "label": 1
  },
  {
    "title": "?",
    "label": 1
  },
  {
    "title": "Making America Weak Again.",
    "label": 0
  },
  {
    "title": "If Trump's Doing So Bad....",
    "label": 1
  },
  {
    "title": "Fox News refuses to run ad for Oscar-nominated anti-Nazi documentary because it would offend its Republican viewers.",
    "label": 0
  },
  {
    "title": "No Republican senators have signed onto a bill to give federal contractors backpay after the shutdown",
    "label": 0
  },
  {
    "title": "Media Cancel James Mattis After They Learn His Book Criticizes the Wrong President",
    "label": 1
  },
  {
    "title": "Dan Rather: 'Trump disinvites Eagles from White House - while millions of Americans hurt. Puerto Rico suffers. Allies fret. The planet warms. He uses our National Anthem to sow disunity in what's supposed to be the UNITED States of America. I think history will mark it as akin to McCarthyism.'",
    "label": 0
  },
  {
    "title": "Hillary Clinton: “It took 70 days for Trump to treat the coronavirus not as a distant threat or harmless flu strain well under control, but as a lethal force poised to kill tens of thousands of citizens.” Replace this man in November.",
    "label": 0
  },
  {
    "title": "Sen. Jeff Merkley on Twitter: ...the president said, “If there is going to be peace and legislation, there cannot be war and investigation.” That’s baloney. It is Congress’ constitutional duty to serve as a check on the Executive Branch—whether the President likes it or not.",
    "label": 0
  },
  {
    "title": "The Media Is Always, Always Wrong About Trump And National Security",
    "label": 1
  },
  {
    "title": "Biden: 'All men are created... you know the thing.'",
    "label": 1
  },
  {
    "title": "One of the great conservative minds of our time has passed away today. Charles Krauthammer was 68 years old.",
    "label": 1
  },
  {
    "title": "Julia Davis on Twitter: 'Fox News: “We should honor Tulsi Gabbard for her service. Her loyalty to this country can’t be questioned.” Also Fox News: “Let’s disregard Lt. Col. Alexander Vindman’s service and insinuate he’s a spy.”'",
    "label": 0
  },
  {
    "title": "Trump bans Chinese companies for abuse against muslims",
    "label": 1
  },
  {
    "title": "Let’s Be Honest: Mexico Is A Bad Neighbor",
    "label": 1
  },
  {
    "title": "Joe Biden worked with whistleblower when he was vice president, officials reveal",
    "label": 1
  },
  {
    "title": "Even Stranger Things didn’t have as much of an Upside Down.",
    "label": 0
  },
  {
    "title": "Florida Woman Criminally Charged After Changing Voters’ Party Affiliations from Dem to GOP — She Works for Group Funded by Pro-Trump Super PAC",
    "label": 0
  },
  {
    "title": "Trump’s Economy: 1.6 Million More Jobs Than The ‘Experts’ Predicted",
    "label": 1
  },
  {
    "title": "Do preborn children have an actual heartbeat? The answer is yes.",
    "label": 1
  },
  {
    "title": "Gun rights group says it will sue over bump stock ban | TheHill",
    "label": 1
  },
  {
    "title": "Beto O’Rourke leads Ted Cruz by 2 among likely voters in US Senate race, new poll finds",
    "label": 0
  },
  {
    "title": "France 2018",
    "label": 1
  },
  {
    "title": "Breaking Barriers",
    "label": 1
  },
  {
    "title": "The crowd at #DAYTONA500 breaks out into chants of “USA, USA” as Air Force One flys over. 🇺🇸🇺🇸🇺🇸",
    "label": 1
  },
  {
    "title": "After losing billions, Gillette changes its marketing strategy. Perhaps insulting its customers and going woke was not a good idea.",
    "label": 1
  },
  {
    "title": "No collusion!",
    "label": 1
  },
  {
    "title": "In Private, Republicans Admit They Acquitted Trump Out of Fear",
    "label": 0
  },
  {
    "title": "Watch these two imbeciles fail first-grade math on MSNBC",
    "label": 1
  },
  {
    "title": "Tom Nichols: Democrats still think that the key to winning is someone who WILL DESTROY Trump in a debate. Get it clear: Clinton mopped the floor with Trump three times and lost. Your only goal is: 270. The rest is a revenge fantasy that won't happen.",
    "label": 0
  },
  {
    "title": "Brennan responds to the Censorship & Intimidation.",
    "label": 0
  },
  {
    "title": "Daily Reminder: 65 Countries Have Border Walls and So Does Nancy Pelosi's Backyard",
    "label": 1
  },
  {
    "title": "Joe Biden in 1996 saying if Iran attacked a USA facility it is an act of war and ANY retaliation is warranted",
    "label": 1
  },
  {
    "title": "Whistleblower alleges Trump White House moved records onto separate network: report",
    "label": 0
  },
  {
    "title": "After Roy Moore was almost elected to the Senate, I purchased GrandOldPerverts.com and after last week's rape allegations against Trump I finally turned it into a growing list of all the GOP perverts (OC)",
    "label": 0
  },
  {
    "title": "Fear is Dividing Us. Also, the World Will End in 12 Years if We Don’t Adopt and Embrace Socialist Policy.",
    "label": 1
  },
  {
    "title": "Judge rules ‘ISIS bride’ Hoda Muthana is not a US citizen and has no right to return to the US",
    "label": 1
  },
  {
    "title": "Steve Schmidt, John McCain's 2008 campaign manager: 'The Republican Party is corrupt, indecent, immoral, and filled with feckless cowards. The GOP has become a danger to our Democracy and values. The only party left that stands for what is right, truth, and the rule of law is the Democratic Party.'",
    "label": 0
  },
  {
    "title": "Michigan Governor Says No to More Taxpayer Funds for Anti-Choice Clinics: Michigan Gov. Gretchen Whitmer (D) threw a wrench into Republicans' plans to funnel state funding to clinics that lie to pregnant people and don't provide a full range of reproductive health services",
    "label": 0
  },
  {
    "title": "Despite his many policy successes, Trump’s most lasting achievement may very well be exposing the fake mainstream media. Tens of millions will never blindly follow their narratives again.",
    "label": 1
  },
  {
    "title": "Marsha Blackburn up 14 percent despite Taylor Swift's plea for opponent Phil Bredesen in Tennessee race",
    "label": 1
  },
  {
    "title": "Bill Clinton: We have talked, tweeted, and delayed long enough. This is about who we are as a country, and what America will look like years from now. It’s time to reinstate the assault weapons ban and make background checks universal.",
    "label": 0
  },
  {
    "title": "We Don't Govern By Temper Tantrum",
    "label": 0
  },
  {
    "title": "Preet Bharara: 'Bob Mueller today was decent, honest, humble, measured, patriotic, apolitical & above the fray. He returned none of the bile the president and others have heaped on him. Whatever you thought of his performance, he is far better than his critics and remains an American hero. 🙏'",
    "label": 0
  },
  {
    "title": "The GOP has become the drunken frat-boy party — and it sees no reason to sober up",
    "label": 0
  },
  {
    "title": "#AmericanPride!",
    "label": 1
  },
  {
    "title": "No More 'Undocumented': Justice Dept. Says the Correct Term Is 'Illegal Alien'",
    "label": 1
  },
  {
    "title": "Elijah Cummings: The White House hasn’t turned over a single piece of paper to my committee",
    "label": 0
  },
  {
    "title": "Republican Cries Against Voter Fraud Go Mostly Quiet After Scheme Tied to Party",
    "label": 0
  },
  {
    "title": "No, Trump isn’t putting ‘America first.’ He’s putting himself first.",
    "label": 0
  },
  {
    "title": "Oprah for President – another billionaire pseudoscience pusher looking for a job: Ms. Winfrey has been a strong supporter of Jenny McCarthy, who is simply a member of the anti-vaccine religion. Oprah foisted onto the world Dr. Mehmet Oz, one of the most reprehensible pushers of scientific nonsense.",
    "label": 0
  },
  {
    "title": "House Democrat demanding Trump’s tax returns is coming under fire for not releasing his returns, and spending lavishly on lobbyists and potential donors",
    "label": 1
  },
  {
    "title": "'Seriously?': Rep. Jim Jordan slams Democrats calling for coronavirus relief funding to illegal immigrants",
    "label": 1
  },
  {
    "title": "DNC Says It Will Exclude Fox News From Televising 2020 Debates",
    "label": 0
  },
  {
    "title": "Pelosi at war: 1) Checks Trump's schedule, sees meeting with foreign leader, knows Trump will hold a press conference. 3) Schedules her own presser ahead of his b/c she knows he will watch and stew. 4) Trump, predictably baited, melts down on live television. Advantage, Pelosi.",
    "label": 0
  },
  {
    "title": "Cohen: fears no 'peaceful transition' if Trump loses in 2020",
    "label": 0
  },
  {
    "title": "BREAKING: WHO Sided With China, Ignores Damning Warning From Taiwan On Possible Coronavirus Outbreak",
    "label": 1
  },
  {
    "title": "Mueller cleared Trump — now get over it",
    "label": 1
  },
  {
    "title": "Posted this on r/Democrat, flagged for trolling'",
    "label": 1
  },
  {
    "title": "You don't think the media has a clear agenda? This is Tyler Wingate: A 24-Year-Old white male who got in a car accident in a black male in 83% African American Detroit... He was beaten to death by black motorists. Why have you never heard of this? Would you have if the races were reversed?",
    "label": 1
  },
  {
    "title": "You’re telling me this guy would run, unarmed, toward the sound of gunfire?",
    "label": 0
  },
  {
    "title": "Every Single Government Authority Failed In Parkland. And They Expect Americans To Forfeit Our Self-Defense Rights To Them?",
    "label": 1
  },
  {
    "title": "Beto: Yes, in case it isn't perfectly clear, I'll be sending cops to your door to take your guns",
    "label": 1
  },
  {
    "title": "Hillary Clinton: A massive heat wave has caused the Greenland ice sheet to melt at rates not projected until 2070. We are in a climate emergency. Vote accordingly.",
    "label": 0
  },
  {
    "title": "Trump’s experiences vs Mueller’s experiences",
    "label": 0
  },
  {
    "title": "China Calls 'Wuhan Virus' Racist, But Their State Media Called It That Themselves",
    "label": 1
  },
  {
    "title": "Mexico deploys officers to its southern border to block migrants headed for the US",
    "label": 1
  },
  {
    "title": "Arizona poll shows Kelly (D) overtaking McSally (R); Kelly 46%, McSally 41%",
    "label": 0
  },
  {
    "title": "There must be a reckoning: President Trump committed another grotesque violation of the Constitution on his trip to Scotland, when he used $70,000 in public money to pay for rooms at a hotel he owns. This kind of bald corruption is chewing at the roots of the United States as a functioning nation.",
    "label": 0
  },
  {
    "title": "Trump has flipped the 9th Circuit",
    "label": 1
  },
  {
    "title": "Republican projected to beat Democrat for Texas state House, in race watched for 2020 clues",
    "label": 1
  },
  {
    "title": "Republicans who held 33 hearings on Benghazi complain that Cohen’s testimony was a waste of time",
    "label": 0
  },
  {
    "title": "Republican run Iowa Caucus Vs. Democrat Run Iowa Caucus.",
    "label": 1
  },
  {
    "title": "If you’re in Texas, remember to vote Beto!!!",
    "label": 0
  },
  {
    "title": "To Protect the Future, Hold China Accountable",
    "label": 1
  },
  {
    "title": "Now inflated right outside Mordor tower on Fifth Ave, NYC.",
    "label": 0
  },
  {
    "title": "Yep",
    "label": 1
  },
  {
    "title": "Scott Dworkin: 'Trump will go down as the worst president ever in the history of the United States. Not mainly for his incompetence. Or his corruption. Or his collusion. Or his nepotism. Or his foul mouth. Or his disrespect for American values. Mainly for the fact he’s simply fucking lazy.'",
    "label": 0
  },
  {
    "title": "#Impeachment",
    "label": 0
  },
  {
    "title": "Trump Has Now Shifted $1.7 Million From Campaign Donors To His Private Business",
    "label": 0
  },
  {
    "title": "Nancy Pelosi: It really tells you all you need to know about the priorities of Washington Republicans that a bill to make it easier to vote, increase government transparency, get dark money out of politics & empower working people in our elections is met with such disdain. #ForThePeople",
    "label": 0
  },
  {
    "title": "Obamacare study proves that having health insurance reduces U.S. death rates",
    "label": 0
  },
  {
    "title": "Trump cutting Obama-era refugee admissions 77%",
    "label": 1
  },
  {
    "title": "Christian persecution 'at near genocide levels', report says",
    "label": 1
  },
  {
    "title": "Meanwhile at Yale",
    "label": 1
  },
  {
    "title": "California Gov. Jerry Brown vetoes bill that would have allowed undocumented immigrants to serve on state and local boards",
    "label": 1
  },
  {
    "title": "Uncle Joe’s mannequin.",
    "label": 1
  },
  {
    "title": "The current Democratic House has been one of the most productive in history. It’s passed over 400 pieces of legislation, including gun control, increasing the minimum wage, lowering prescription drug costs & taking on climate change. #MoscowMitch has blocked every single one.",
    "label": 0
  },
  {
    "title": "In gun-controlled Mexico, the murder rate is nearly 500% HIGHER than in the USA",
    "label": 1
  },
  {
    "title": "Adam Schiff: 'For a President who has made over 4,200 false statements and misleading claims since taking office — an average of over 7 per day — asking Trump if he knows the difference between fact and fiction is a perjury trap.' -- Reuters Politics: 'Trump says that speaking to Mueller's...'",
    "label": 0
  },
  {
    "title": "There should be an investigation. A huge number of votes appeared in South Florida after polls closed. I still do not believe incompetence was the cause.",
    "label": 1
  },
  {
    "title": "Stephen Colbert on Twitter: 'Why is anyone surprised that Trump's willing to shut down our government when it's clearly not the one he works for?'",
    "label": 0
  },
  {
    "title": "This is absolutely sickening.",
    "label": 1
  },
  {
    "title": "Lawrence O'Donnell on Twitter: 'The president who did NOT run toward the sound of the guns in Vietnam 50 years ago, now labels an officer with a handgun a 'coward' for not running toward the sound of an AR15. Trump is by far the most cowardly president in history.'",
    "label": 0
  },
  {
    "title": "Ainsley Earhardt Accidentally Reveals FOX News Really Is State TV",
    "label": 0
  },
  {
    "title": "Reporter who falsely Claimed Annapolis Shooter Wore MAGA Hat Resigns",
    "label": 1
  },
  {
    "title": "Elizabeth Warren: 'We need to call it out: Fox News is a hate-for-profit machine that gives a megaphone to racists and conspiracists.'",
    "label": 0
  },
  {
    "title": "Donald Trump Spends Nearly Two Thirds Of His Time Doing Literally Nothing",
    "label": 0
  },
  {
    "title": "President Trump Declares He Will Veto Any Pro-Abortion Legislation",
    "label": 1
  },
  {
    "title": "Rape and Incest ≠ Abortion for All",
    "label": 1
  },
  {
    "title": "Scarborough: The Supreme Court Will Have to Decide on Indicting Trump for ‘Crimes Which Helped Him Get Elected’",
    "label": 0
  },
  {
    "title": "Senator Bob Corker on Twitter: 'I never thought I’d see the day a White House would moonlight as a public relations firm for the Crown Prince of Saudi Arabia.'",
    "label": 0
  },
  {
    "title": "Not that it makes a difference on Reddit...",
    "label": 1
  },
  {
    "title": "Lindsey Graham challenger raises $270,000 within 24 hours of announcing Senate bid",
    "label": 0
  },
  {
    "title": "All guns matter",
    "label": 1
  },
  {
    "title": "Kamala Harris's Cowardly ICE Attack Reveals Anti-Americanism",
    "label": 1
  },
  {
    "title": "Acting ICE director said families separated in upcoming deportation raids can 'voluntarily' reunify by choosing to leave U.S. with loved ones",
    "label": 1
  },
  {
    "title": "Donald Trump dared Nancy Pelosi to cancel his State of the Union speech. So she did.",
    "label": 0
  },
  {
    "title": "Hugely Incriminating Phone Records Suggest Giuliani Is F---ed",
    "label": 0
  },
  {
    "title": "Former NFL Player and Obama Fundraiser Now Supports Trump; Says 'There Is An Awakening' Among Black Voters",
    "label": 1
  },
  {
    "title": "Gun Ownership Surges In Europe Over Fears Of Terrorism And Crime",
    "label": 1
  },
  {
    "title": "Scherie Murray-Jamaican Immigrant/Business Owner Challenging AOCs spot. She is a REPUBLICAN Candidate for Ny-14",
    "label": 1
  },
  {
    "title": "Trump to end catch and release. Illegal families will be sent back home or remain in Mexico. Common sense.",
    "label": 1
  },
  {
    "title": "Shocking: mueller disputes buzzfeed article on cohen",
    "label": 1
  },
  {
    "title": "Tolerant Left v Fascist Right 😂",
    "label": 1
  },
  {
    "title": "Trump literally called cameras into the Oval Office last month and said 'if we don't get what we want...I will shut down the government,' and then it happened, and the mainstream press is still #bothsidesing it.",
    "label": 0
  },
  {
    "title": "Parents of Teen Boy Falsely Accused of Sexual Assault Sue Five ‘Mean Girl’ Accusers",
    "label": 1
  },
  {
    "title": "Message from God",
    "label": 0
  },
  {
    "title": "Antifa gets busted up in Portland",
    "label": 1
  },
  {
    "title": "Planned Parenthood debunked again: No, thousands of women didn’t die annually from abortion before Roe v. Wade",
    "label": 1
  },
  {
    "title": "Trump Doesn’t Want Voters to Know How Much His Family’s Trips Cost Taxpayers",
    "label": 0
  },
  {
    "title": "The broadcast of the Democratic presidential primary debate in Las Vegas on Wednesday drew 19.7 million viewers across NBC and MSNBC, making it the most-watched Democratic debate in television history, the network said",
    "label": 0
  },
  {
    "title": "Really Reddit, really?",
    "label": 1
  },
  {
    "title": "Nancy Pelosi: Today is a profoundly heart-breaking day. The @SenateGOP Majority has done violence to the reputation of both the Senate Judiciary Committee & Supreme Court. I will file a FOIA request so that the public can see the FBI report & underlying documents.",
    "label": 0
  },
  {
    "title": "OBAMA: 'There's a pattern' of Republicans running the economy 'into the ground' and Democrats having to 'come back and clean things up'",
    "label": 0
  },
  {
    "title": "It’s time to designate the Mexican cartels as terrorist organizations",
    "label": 1
  },
  {
    "title": "If they didn't already exist, public libraries would strike people as the most outlandish left-wing idea.",
    "label": 0
  },
  {
    "title": "Trump’s First 3 Years Created 1.5 Million Fewer Jobs Than Obama’s Last 3",
    "label": 0
  },
  {
    "title": "Bush Senior: Media Coverage",
    "label": 1
  },
  {
    "title": "Confidence in the U.S. President.",
    "label": 0
  },
  {
    "title": "Trump said he was ‘f--ked’ after Mueller’s appointment, special counsel’s report suggests Congress take action against president",
    "label": 0
  },
  {
    "title": "Why We Have Electoral College: Founders, Alexander Hamilton ‘Feared the Mob’",
    "label": 1
  },
  {
    "title": "A look back at Clinton's impeachment reveals the GOP's searing hypocrisy",
    "label": 0
  },
  {
    "title": "Supreme Court may expand Second Amendment rights despite repeal of disputed gun restrictions",
    "label": 1
  },
  {
    "title": "This is President Barack Obama. He did not sell Americans out to the telecom lobby, but instead called upon on the FCC to take up the strongest possible rules to protect net neutrality, which they did at his instruction in 2015.",
    "label": 0
  },
  {
    "title": "Mueller: ‘If We Had Confidence That the President Did Not Commit a Crime, We Would Have Said So’",
    "label": 0
  },
  {
    "title": "Rep. Tim Ryan says he'll lead a 'caravan' to McConnell's home state to protest for gun control",
    "label": 0
  },
  {
    "title": "California court strikes down law seeking release of Trump's tax returns",
    "label": 1
  },
  {
    "title": "Sanders Says He Does Not Have a Price Tag for All of His ‘Free’ Plans",
    "label": 1
  },
  {
    "title": "in response to alL LiVeS mAtTeR",
    "label": 0
  },
  {
    "title": "Trump: You wouldn’t like my supporters in the military if they got angry -- This kind of rhetoric could “plant a seed” in his supporters’ minds that violence might reasonably occur, if they feel sufficiently “wronged by the political process.” Trump regularly indulges in lies about such wrongs.",
    "label": 0
  },
  {
    "title": "Only Caravan is the Republican One of Fools.",
    "label": 0
  },
  {
    "title": "Trumps a little lost",
    "label": 0
  },
  {
    "title": "Tell them, Mr. President!",
    "label": 0
  },
  {
    "title": "President Trump Restores Chief Petty Officer Gallagher to his Pre-Court Martial Rank",
    "label": 1
  },
  {
    "title": "The New Green Deal was developed with advanced computer modeling...",
    "label": 1
  },
  {
    "title": "Idaho Joins Movement to Prevent Transgender Athletes from Competing Against Girls",
    "label": 1
  },
  {
    "title": "Rick Scott’s Company Committed Historic Medicare Fraud. He Will Now Lead Trump’s Health-Care Push.",
    "label": 0
  },
  {
    "title": "Now being projected onto San Francisco Federal Building.",
    "label": 0
  },
  {
    "title": "If Trump’s To Blame For El Paso Shooting, Is Warren To Blame For Dayton?",
    "label": 1
  },
  {
    "title": "Former Clinton adviser: 'Biden should be required to have a test for Alzheimer’s disease'",
    "label": 1
  },
  {
    "title": "Buttery Males Revisited.",
    "label": 0
  },
  {
    "title": "For the first time more young Americans are dying from gun violence than they are in car accidents.",
    "label": 0
  },
  {
    "title": "Trump Is The Worst President, Expert Ranking Survey Reveals On Presidents' Day: On a scale of 0 to 100 for overall greatness, President Trump scored just over 12, coming in dead last. “His average rating is nearly 3 points lower than James Buchanan, who previously occupied the lowest rank.”",
    "label": 0
  },
  {
    "title": "Nancy Pelosi on Twitter: 'The effort to end the #FakeEmergency is not about partisanship — it is about patriotism. Every Member of Congress swears an oath to protect & defend the Constitution. We must not abandon that responsibility now.'",
    "label": 0
  },
  {
    "title": "House Democrats’ 1st bill targets big donors, voting access.",
    "label": 0
  },
  {
    "title": "March For Our Lives, Washington, DC.",
    "label": 0
  },
  {
    "title": "Nick Jack Pappas on Twitter: 'Betsy DeVos, on cutting funding to the Special Olympics: 'We had to make some difficult decisions.' The Special Olympics cost around $18 million, or about the same as five of Trump's golf trips to Mar-a-Lago. It's not a difficult decision. It's an evil one.'",
    "label": 0
  },
  {
    "title": "Double standards",
    "label": 0
  },
  {
    "title": "The RedCap Paradox.",
    "label": 0
  },
  {
    "title": "Make-Believe and Wishful-Thinking: This is Post-Modern News",
    "label": 1
  },
  {
    "title": "Boris Johnson's government is reportedly furious with China and believes it could have 40 times more coronavirus cases than it claims",
    "label": 1
  },
  {
    "title": "Barack Obama dons a Santa hat and hands out gifts in surprise visit to D.C. children’s hospital",
    "label": 0
  },
  {
    "title": "The more you know",
    "label": 1
  },
  {
    "title": "In 50 years of the 'War on Poverty' the US has taxed over $22 TRILLION dollars from productive people and handed it out to unproductive people. The poverty rate has not budged. Maybe giving people 'free shit' stolen from people who worked for it, isn't a solution to anything",
    "label": 1
  },
  {
    "title": "British Progressives Horrified As Boris Johnson Removes Mask Revealing Self To Be Donald Trump",
    "label": 1
  },
  {
    "title": "Hillary Clinton: The House just passed a bill to require background checks on all gun sales in the country. It's the first gun control legislation to pass since 1994. Thank @gabbygiffords, @lucymcbath, @speakerpelosi and so many others for their work on this issue by calling your senators!",
    "label": 0
  },
  {
    "title": "Parkland Father Gets Emotional Directly Responding to Trump’s Claim Shooting Victims Love Him: ‘I Hate What You Do’",
    "label": 0
  },
  {
    "title": "City officials in Portland discuss banning masked protesters like Antifa, in an effort to crack down on violent clashes",
    "label": 1
  },
  {
    "title": "Rand Paul's wife: 'I now keep a loaded gun by my bed' after activists threatened family",
    "label": 1
  },
  {
    "title": "America The Beautiful",
    "label": 1
  },
  {
    "title": "Elizabeth Warren is ending her presidential campaign",
    "label": 0
  },
  {
    "title": "South Dakota, Iowa add firearm safety courses to middle school curriculum",
    "label": 1
  },
  {
    "title": "Nancy Pelosi Says it's Fair Game to Go After Ivanka Trump, Jared Kushner: 'They Are Advisers to the President... Not Their Children at Home'",
    "label": 0
  },
  {
    "title": "Poll: Voters oppose abolishing ICE - POLITICO",
    "label": 1
  },
  {
    "title": "Justice officials say AG Sessions spoke with Russian ambassador during presidential campaign, may have lied about it",
    "label": 0
  },
  {
    "title": "Florida Senate approves bill allowing armed teachers",
    "label": 1
  },
  {
    "title": "Bernie Sanders briefed by U.S. officials that Russia is trying to help his presidential campaign",
    "label": 1
  },
  {
    "title": "John McAfee Is Launching an ‘Epstein Didn’t Kill Himself’ Cryptocurrency",
    "label": 1
  },
  {
    "title": "Walter Shaub on Twitter: 'When this is over, when the lights are turned back on, it will become clear that there were only two kinds of people: Those who stood against Trump’s corruption, cruelty and degradation of American values, and those who enabled him.'",
    "label": 0
  },
  {
    "title": "Scott Dworkin on Twitter: 'CIA concluded the Saudi Crown Prince ordered the assassination of WaPo journalist Jamal Khashoggi. Trump did nothing but help stall, lie about it and help with the cover up. Trump and anyone else who helped him, including Kushner and Ivanka, need to all resign immediately'",
    "label": 0
  },
  {
    "title": "A Tale of Two Summits: When Obama hosted in 2012 and this year.",
    "label": 0
  },
  {
    "title": "Amy Siskind: 'On the eve of the second mass shooting at a Jewish place of worship in 6 months, the leader of our country - instead of calming and uniting - led chants of “Lock her up!” and “CNN sucks” and joked it was his “sick” idea to use migrants as pawns. SHAME ON YOU GOP for your silence!'",
    "label": 0
  },
  {
    "title": "US economy grows by 3.2% in the first quarter, topping expectations",
    "label": 1
  },
  {
    "title": "Trump: 'We Will Close the Border Permanently if Need Be'",
    "label": 1
  },
  {
    "title": "Democrats offer amendment to tax plan to ensure corporations use savings to increase employee wages; every Republican votes no",
    "label": 0
  },
  {
    "title": "Trump Sexual Assault Accuser: We’re Forgotten By Those Who ‘Put Party Above All Else’",
    "label": 0
  },
  {
    "title": "Fair",
    "label": 1
  },
  {
    "title": "Democrats see coronavirus as just another crisis to exploit",
    "label": 1
  },
  {
    "title": "Got this today from my Representative, in response to my constant letters/calls/faxes....W. T. F.??!?",
    "label": 0
  },
  {
    "title": "Trump approval at three-year high after Soleimani killing",
    "label": 1
  },
  {
    "title": "Trump fires back at Schumer over coronavirus criticism: 'No wonder AOC is thinking about running against you'",
    "label": 1
  },
  {
    "title": "9-Year-Old Girl Was Detained at Border for 30 Hours Despite Being a U.S. Citizen",
    "label": 0
  },
  {
    "title": "Mike Ghassali is running as a Republican for Congress in NJ-05. He is a legal immigrant from Syria, Mayor of Montvale, and a patriotic American! He has lowered taxes, and refused to make his town a “sanctuary city”. He has raised over 300k since July to unseat Josh Gottheimer. Let’s put NJ first!",
    "label": 1
  },
  {
    "title": "Senate expressly condemns anti-Semitism, after Democrat-led House 'can't bring itself' to do the same",
    "label": 1
  },
  {
    "title": "If Trump’s Voters Turn Out This Fall, They’ll Give Republicans A Big Senate Majority",
    "label": 1
  },
  {
    "title": "Plans by Warren and Sanders Neglect Logic, Math, and Honesty",
    "label": 1
  },
  {
    "title": "Trump cancels Pelosi trip citing furloughed workers",
    "label": 1
  },
  {
    "title": "Tomorrow morning at the DNC headquarters. Credit to u/steveoneill",
    "label": 1
  },
  {
    "title": "Texas mass shooting survivor lobbies Congress for less gun control",
    "label": 1
  },
  {
    "title": "Rewritten with feminist buzzwords 'Mein Kampf' was published by five academic journals. The Academics can't distinguish feminism from nazism",
    "label": 1
  },
  {
    "title": "Biden says Trump should release transcript of Ukraine call so ‘the American people can judge for themselves’",
    "label": 0
  },
  {
    "title": "Bill DeBlasio goes to gym after closing gyms in NYC.",
    "label": 1
  },
  {
    "title": "Democrats ask Kavanaugh to withdraw as Republicans cast doubt on second assault allegation",
    "label": 0
  },
  {
    "title": "The vast attempt to undo the 2016 election has failed",
    "label": 1
  },
  {
    "title": "Tucker Carlson: Millions of US jobs are about to vanish, so why does DC want to import more unskilled workers?",
    "label": 1
  },
  {
    "title": "Obama says Republicans have 'racked up enough indictments to field a football team'",
    "label": 0
  },
  {
    "title": "Georgia voters suing for paper ballots win appeal to 11th Circuit",
    "label": 0
  },
  {
    "title": "The Press Conference",
    "label": 0
  },
  {
    "title": "President Trump's 'Benghazi' Has Ended Much Better Than Hillary Clinton's Did",
    "label": 1
  },
  {
    "title": "Adam Schiff: 'You seem confused, Mr. Mulvaney. When the law says the IRS “shall” provide tax returns upon the request of the Chairman of the Ways and Means Committee, it doesn’t mean: Unless the President fears it, Tweets about it, Or his lawyer complains about it. Shall means shall.'",
    "label": 0
  },
  {
    "title": "The evidence from survey after survey, election after election, is clear: The Democratic agenda is incredibly popular, and the 116h Congress has no excuse not to go big",
    "label": 0
  },
  {
    "title": "Why are they running?",
    "label": 1
  },
  {
    "title": "Dan Rather gets it - 'I'm old enough to remember when 'national emergency' actually meant an emergency to the nation and not an emergency to a damaged politico ego.'",
    "label": 0
  },
  {
    "title": "How Hard Can It Possibly Be For Democrats To Denounce Antifa?",
    "label": 1
  },
  {
    "title": "'The Red MAGA Hat Is the New White Hood' Says Alyssa Milano in Twitter Storm",
    "label": 0
  },
  {
    "title": "Democrats are unlikely to take control of Congress",
    "label": 1
  },
  {
    "title": "Wages and salaries jump by 3.1%, highest level in a decade",
    "label": 1
  },
  {
    "title": "BLEXIT: The Black Exit from the Democratic Party | ZU Media",
    "label": 1
  },
  {
    "title": "Ohio school district votes ‘yes’ to arming teachers",
    "label": 1
  },
  {
    "title": "Activist Candace Owens Candace Owens tells Congress: 'White supremacy' is not even a top 100 issue for minorities",
    "label": 1
  },
  {
    "title": "The problem wasn't Mitt Romney...the problem was the Republican Party.",
    "label": 1
  },
  {
    "title": "Trump has already made a list of people he will blame if a recession strikes in 2020: report",
    "label": 0
  },
  {
    "title": "Kelly leads McSally by 7 points in Arizona Senate poll",
    "label": 0
  },
  {
    "title": "Kushner's use of WhatsApp 'far more egregious' than Clinton’s emails: Cybersecurity expert",
    "label": 0
  },
  {
    "title": "Yes, Trump’s Acquittal Is Real, And It’s Spectacular",
    "label": 1
  },
  {
    "title": "Supreme Court rules non-union workers cannot be forced to pay fees to public sector unions",
    "label": 1
  },
  {
    "title": "Trump says he'll cut entitlements like Social Security and Medicare if reelected to shrink trillions in national debt, trump creates problem (tax cuts) and makes us pay for it, not the root of the problem. God forbid you rescind the 1%er’s tax cuts and loop holes.",
    "label": 0
  },
  {
    "title": "Contrast",
    "label": 1
  },
  {
    "title": "Paul Ryan tries to tout a 1.50 a week raise, gets shut down hard.",
    "label": 0
  },
  {
    "title": "The one thing we can do to address gun violence -- It’s simple and straightforward. Are you ready? Here it is: Don’t vote for Republicans.",
    "label": 0
  },
  {
    "title": "Nancy Pelosi: .@realDonaldTrump’s ban on trans Americans serving in our nation’s military was purpose-built to humiliate brave men & women seeking to serve their country. Deeply concerning that #SCOTUS is allowing his ban to proceed for now. #ProtectTransTroops",
    "label": 0
  },
  {
    "title": "Warren falling in polls. Perhaps she shouldn’t have revealed plan to bankrupt the nation while simultaneously stealing from nearly every taxpayer.",
    "label": 1
  },
  {
    "title": "Hunter Biden: I'm resigning from Chinese-backed board because I did nothing wrong",
    "label": 1
  },
  {
    "title": "Michelle Obama to Greta Thunberg: Former first lady tweets message of support to Thunberg after Trump slams the climate change activist",
    "label": 0
  },
  {
    "title": "At 37 weeks, a pre-born baby can:",
    "label": 1
  },
  {
    "title": "Less Than Half in U.S. Would Vote for a Socialist for President",
    "label": 1
  },
  {
    "title": "Biden rips Trump for golfing amid coronavirus outbreak, says president 'turns everything into a political benefit for himself'",
    "label": 0
  },
  {
    "title": "Senator Rand Paul: 'I spoke with @realDonaldTrump today. The president shares my thoughts that the last thing we need is another ground war. He doesn’t want endless wars. I continue to hope for de-escalation and diplomacy.'",
    "label": 1
  },
  {
    "title": "Facebook admits it blocked Florida Republican's pro-gun ad, reverses course",
    "label": 1
  },
  {
    "title": "Trump cracks down on Pakistan and cuts $1.3 Billion in foreign aid",
    "label": 1
  },
  {
    "title": "Blue Lives Matter. Unless it helps our narrative.",
    "label": 0
  },
  {
    "title": "After Deadly Trump Tower Blaze, Fire Chief Reveals Lack of Sprinklers",
    "label": 0
  },
  {
    "title": "As GOP Moves to Cut Medicare & Social Security, 60% of Americans Say Repeal Trump Tax Scam Instead - 'Working families shouldn't have to pay for the GOP tax bill. The rich & big corporations must pay their fair share of taxes!'",
    "label": 0
  },
  {
    "title": "I think Sen. Grassley just ended Bernie Sanders' life",
    "label": 1
  },
  {
    "title": "In Texas, where 750 polling places have closed since 2012, voters wait in line for hours; 'This is what voting in Texas looks like after Supreme Court gutted the Voting Rights Act.'",
    "label": 0
  },
  {
    "title": "I think there’s an amendment that would’ve help them rn",
    "label": 1
  },
  {
    "title": "Nikki Haley Slams Ilhan Omar For Blaming U.S. For Venezuela Crisis",
    "label": 1
  },
  {
    "title": "Al Franken Torches Spineless GOP Colleagues For Not Opposing Betsy DeVos",
    "label": 0
  },
  {
    "title": "System Fail - the Mueller Report is an unmitigated disaster for the American press and the ‘expert’ class that it promotes",
    "label": 1
  },
  {
    "title": "President Trump sparks outrage after considering a ban on the Muslim Brotherhood in the US",
    "label": 1
  },
  {
    "title": "ABC Reports Americans Spent More On Premiums In 2018 Than 2008, Forget To Mention Obamacare's Selling Point Was it Would LOWER Premiums...",
    "label": 1
  },
  {
    "title": "Takes a little more than hashtags and marches.",
    "label": 0
  },
  {
    "title": "Woman gets 5 years for illegally voting in 2016 presidential election",
    "label": 1
  },
  {
    "title": "Hillary Clinton: Voting isn't a privilege. It's a right. And requiring voters to pay off fines and fees to exercise that right is a modern-day poll tax.",
    "label": 0
  },
  {
    "title": "CNN roasted on Twitter after claiming Trump was lying. Fact checked by their own article",
    "label": 1
  },
  {
    "title": "BREAKING: Democrat Jaime Harrison is virtually tied with Trump puppet Lindsey Graham in the latest polling of the Senate race in deep-red South Carolina! RETWEET if you support Harrison as he fights to beat Graham and take back the U.S. Senate! https://t.co/mvoRTDTYA3",
    "label": 0
  },
  {
    "title": "Donald Trump's Walk of Fame Star Could Be Removed Forever—Because of His Views on Women: West Hollywood City Council wants the landmark gone.",
    "label": 0
  },
  {
    "title": "Harvard Study shows fox news is the least biased network despite despite left-wing attacks on their credibility",
    "label": 1
  },
  {
    "title": "Trump derangement syndrome",
    "label": 1
  },
  {
    "title": "Dan Shapiro: 'Yes, Obama congratulated Putin in 2012. That was before Russia invaded Ukraine, before Russia deployed to Syria to back Assad's genocide, before Russia interfered in US elections, before Russia launched a CW attack in the UK. Pay attention: Trump's own people know he blew this.'",
    "label": 0
  },
  {
    "title": "Brainwash Complete --- White Leftists Are The Only Group That Hates Their Own Race",
    "label": 1
  },
  {
    "title": "Budget Deficit Will Go Up 31% Thanks To Trump Tax Cuts For Billionaires",
    "label": 0
  },
  {
    "title": "Since we believe in consistency.",
    "label": 1
  },
  {
    "title": "Leftist Defensive Shield",
    "label": 1
  },
  {
    "title": "The South Dakota Democratic Party will no longer have a physical presence in the state",
    "label": 1
  },
  {
    "title": "California bad, Texas good",
    "label": 1
  },
  {
    "title": "Well Deserved! - Gillum intern arrested in Florida for throwing chocolate milk at College Republicans",
    "label": 1
  },
  {
    "title": "Joe Walsh on Twitter: 'Donald Trump has never, ever gotten angry at Russia for interfering with our election. He gets angry all the time at the Americans who investigated the interference. But he's never, ever gotten angry at the Russians. Pretty telling, huh?'",
    "label": 0
  },
  {
    "title": "His record",
    "label": 0
  },
  {
    "title": "Not to mention he obstructed a counter intel investigation into his own campaign, been accused of sexual assault by nearly 20 women and is a pig in general.",
    "label": 0
  },
  {
    "title": "Immigrants Should Not Be on Welfare",
    "label": 1
  },
  {
    "title": "Tucker Carlson's Commercial Breaks Tell The Real Story Of His Advertising Problems; Last year, Fox News’ “Tucker Carlson Tonight” would feature more than 30 paid ads. In his Thursday show, there were only 13. Friday, there were just 11 ads.",
    "label": 0
  },
  {
    "title": "Oh yes, let’s trust these guys...",
    "label": 1
  },
  {
    "title": "CNN Poll: More approve of Mueller than of Trump",
    "label": 0
  },
  {
    "title": "The Real #WalkAway",
    "label": 0
  },
  {
    "title": "ACLU says planned national emergency declaration is 'clear abuse of presidential power'",
    "label": 0
  },
  {
    "title": "Tommy MMXIXtopher on Twitter: 'Trump just said 'my father is German, was German. Born in a very wonderful place in Germany.' Fred Trump was born in New York.'",
    "label": 0
  },
  {
    "title": "Mexican Restaurant Attacked By Liberals Because Latino Owners Support Trump. Trump Helps The Owners Out.",
    "label": 1
  },
  {
    "title": "“Sponsored by Republicans for honesty in government”",
    "label": 0
  },
  {
    "title": "Biden: 'Not Only Will I Appoint A Woman Running Mate, But I Will Stand Behind Her At All Times'",
    "label": 1
  },
  {
    "title": "It’s about time!",
    "label": 1
  },
  {
    "title": "Facial Expression Guide",
    "label": 1
  },
  {
    "title": "Opinion: Black millennials who refuse to vote are falling for a political fraud",
    "label": 0
  },
  {
    "title": "Andrew Gillum has conceded defeat after a recount in the close fought Florida gubernatorial election",
    "label": 1
  },
  {
    "title": "UNREAL: Watch Liberals Protest ICE As The Agency Breaks Up A Child Sex-Trafficking Ring",
    "label": 1
  },
  {
    "title": "Crowder Reads the Green New Deal. From Start to Finish. | Louder With Crowder",
    "label": 1
  },
  {
    "title": "Mark Jacob on Twitter: 'Donald Trump promised on August 9, 2016, that his wife., Melania, would answer questions about her immigration at a news conference 'in the next couple weeks.' It's been 1,113 days since then. We're still waiting.'",
    "label": 0
  },
  {
    "title": "🤦‍♂️🤦‍♂️🤦‍♂️",
    "label": 1
  },
  {
    "title": "My wife being sworn in as first woman of color to serve on our NJ town’s council",
    "label": 0
  },
  {
    "title": "The more you know",
    "label": 0
  },
  {
    "title": "Democrats to plow ahead with Trump investigations post-acquittal",
    "label": 0
  },
  {
    "title": "Poll: Trump approval rating ticks up to 47 percent",
    "label": 1
  },
  {
    "title": "Sen. Elizabeth Warren says she has ‘zero’ sympathy for parents caught in college admissions scam.",
    "label": 0
  },
  {
    "title": "Culture Is Responsible For Japan’s Low Gun Violence Rates, Not Gun Control",
    "label": 1
  }
]
